StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VK234.h
typedef struct {                                /*!< (@ 0x40018000) MDR_EEPROM Structure                                       */
  
  union {
    __IOM uint32_t CMD;                         /*!< (@ 0x00000000) EEPROM Control register                                    */
    
    struct {
      __IOM uint32_t CON        : 1;            /*!< [0..0] Enable memory access through EEPROM controller                     */
      __IOM uint32_t WR         : 1;            /*!< [1..1] Write operation (test bit)                                         */
      __IOM uint32_t RD         : 1;            /*!< [2..2] Read operation, (test bit)                                         */
      __IOM uint32_t DELAY      : 1;            /*!< [3..3] Memory access CPU delay tacts                                      */
      __IM  uint32_t            : 2;
      __IOM uint32_t XE         : 1;            /*!< [6..6] Enable ADDR[16..9]                                                 */
      __IOM uint32_t YE         : 1;            /*!< [7..7] Enable ADDR[8..2]                                                  */
      __IOM uint32_t SE         : 1;            /*!< [8..8] RD Amplifier enable                                                */
      __IOM uint32_t IFREN      : 1;            /*!< [9..9] Select main or info memory                                         */
      __IOM uint32_t ERASE      : 1;            /*!< [10..10] Erase string at ADDR[16:0]                                       */
      __IOM uint32_t MAS1       : 1;            /*!< [11..11] Erase whole block with ERASE                                     */
      __IOM uint32_t PROG       : 1;            /*!< [12..12] Programm EEPROM_DI to ADDR[16:0]                                 */
      __IOM uint32_t NVSTR      : 1;            /*!< [13..13] Memory access mode                                               */
    } CMD_b;
  } ;
  __IOM uint32_t  ADDR;                         /*!< (@ 0x00000004) Address register                                           */
  __IOM uint32_t  DI;                           /*!< (@ 0x00000008) Write data register                                        */
  __IOM uint32_t  DO;                           /*!< (@ 0x0000000C) Read data register                                         */
  __IOM uint32_t  KEY;                          /*!< (@ 0x00000010) Unlock block register                                      */
} MDR_EEPROM_Type;                              /*!< Size = 20 (0x14)                                                          */



/* =========================================================================================================================== */
/* ================                                       MDR_RST_CLOCK                                       ================ */
/* =========================================================================================================================== */


/**
  * @brief CLock Control (MDR_RST_CLOCK)
  */

typedef struct {                                /*!< (@ 0x40020000) MDR_RST_CLOCK Structure                                    */
  
  union {
    __IM  uint32_t CLOCK_STATUS;                /*!< (@ 0x00000000) Clock Status Register                                      */
    
    struct {
      __IM  uint32_t            : 1;
      __IM  uint32_t PLL_CPU_RDY : 1;           /*!< [1..1] PLL CPU ready                                                      */
      __IM  uint32_t HSE_RDY    : 1;            /*!< [2..2] HSE generator ready                                                */
    } CLOCK_STATUS_b;
  } ;
  
  union {
    __IOM uint32_t PLL_CONTROL;                 /*!< (@ 0x00000004) PLL Control Register                                       */
    
    struct {
      __IM  uint32_t            : 2;
      __IOM uint32_t PLL_CPU_ON : 1;            /*!< [2..2] PLL CPU Enable                                                     */
      __IOM uint32_t PLL_CPU_PLD : 1;           /*!< [3..3] PLL CPU Restart                                                    */
      __IM  uint32_t            : 4;
      __IOM uint32_t PLL_CPU_MUL : 4;           /*!< [11..8] PLL CPU Mul, [x1 .. x16]                                          */
    } PLL_CONTROL_b;
  } ;
  
  union {
    __IOM uint32_t HS_CONTROL;                  /*!< (@ 0x00000008) HSE Generator Control                                      */
    
    struct {
      __IOM uint32_t HSE_ON     : 1;            /*!< [0..0] HSE Enable                                                         */
      __IOM uint32_t HSE_BYP    : 1;            /*!< [1..1] HSE Bypass Mode                                                    */
    } HS_CONTROL_b;
  } ;
  
  union {
    __IOM uint32_t CPU_CLOCK;                   /*!< (@ 0x0000000C) CPU Clock Control                                          */
    
    struct {
      __IOM uint32_t CPU_C1_SEL : 2;            /*!< [1..0] CPU_C1 mux freq select                                             */
      __IOM uint32_t CPU_C2_SEL : 1;            /*!< [2..2] CPU_C2 mux freq select                                             */
      __IM  uint32_t            : 1;
      __IOM uint32_t CPU_C3_SEL : 4;            /*!< [7..4] CPU_C2 mux output freq devider, [/1, /2, /4 .. /256]               */
      __IOM uint32_t HCLK_SEL   : 2;            /*!< [9..8] Select Clock for CPU                                               */
    } CPU_CLOCK_b;
  } ;
  
  union {
    __IOM uint32_t PER1_CLOCK;                  /*!< (@ 0x00000010) Peripherials Clock Control1                                */
    
    struct {
      __IOM uint32_t PER1_C1_SEL : 2;           /*!< [1..0] PER1_C1 mux freq select                                            */
      __IOM uint32_t PER1_C2_SEL : 2;           /*!< [3..2] PER1_C2 mux freq select                                            */
      __IOM uint32_t DEBUG_EN   : 1;            /*!< [4..4] Debug clock enable                                                 */
      __IOM uint32_t DMA_EN     : 1;            /*!< [5..5] DMA clock enable                                                   */
    } PER1_CLOCK_b;
  } ;
  
  union {
    __IOM uint32_t ADC_CLOCK;                   /*!< (@ 0x00000014) ADC Clock Control                                          */
    
