StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VK234.h
    struct {
      __IM  uint32_t            : 17;
      __IOM uint32_t ADC1_OP    : 1;            /*!< [17..17] ADC1 Setpoint Vref source                                        */
    } ADC2_Cfg_b;
  } ;
  
  union {
    __IOM uint32_t ADC1_H_Level;                /*!< (@ 0x00000008) ADC High limit                                             */
    
    struct {
      __IOM uint32_t Level      : 12;           /*!< [11..0] Signal limit level                                                */
    } ADC1_H_Level_b;
  } ;
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t ADC1_L_Level;                /*!< (@ 0x00000010) ADC Low limit                                              */
    
    struct {
      __IOM uint32_t Level      : 12;           /*!< [11..0] Signal limit level                                                */
    } ADC1_L_Level_b;
  } ;
  __IM  uint32_t  RESERVED1;
  
  union {
    __IM  uint32_t ADC1_RESULT;                 /*!< (@ 0x00000018) ADC result register                                        */
    
    struct {
      __IM  uint32_t Value      : 12;           /*!< [11..0] Channel signal value                                              */
      __IM  uint32_t            : 4;
      __IM  uint32_t Channel    : 5;            /*!< [20..16] Channel index                                                    */
    } ADC1_RESULT_b;
  } ;
  __IM  uint32_t  RESERVED2;
  
  union {
    __IOM uint32_t ADC1_STATUS;                 /*!< (@ 0x00000020) ADC status register                                        */
    
    struct {
      __IOM uint32_t Overwrite  : 1;            /*!< [0..0] Result overwritten flag                                            */
      __IOM uint32_t AWOIFEN    : 1;            /*!< [1..1] Signal is out of limiters range                                    */
      __IOM uint32_t EOCIF      : 1;            /*!< [2..2] Result ready to read                                               */
      __IOM uint32_t AWOIF_IE   : 1;            /*!< [3..3] Enable IRQ by AWOIFEN flag                                         */
      __IOM uint32_t EOCIF_EN   : 1;            /*!< [4..4] Enable IRQ by EOCIF flag                                           */
    } ADC1_STATUS_b;
  } ;
  __IM  uint32_t  RESERVED3;
  
  union {
    __IOM uint32_t ADC1_CHSEL;                  /*!< (@ 0x00000028) ADC channels select register                               */
    
    struct {
      __IOM uint32_t Channel_0  : 1;            /*!< [0..0] Signal on PC4, Ref-                                                */
      __IOM uint32_t Channel_1  : 1;            /*!< [1..1] Signal on PC3, Ref+                                                */
      __IOM uint32_t Channel_2  : 1;            /*!< [2..2] Signal on PC2                                                      */
      __IOM uint32_t Channel_3  : 1;            /*!< [3..3] Signal on PC1                                                      */
      __IOM uint32_t Channel_4  : 1;            /*!< [4..4] Signal on PB9                                                      */
      __IOM uint32_t Channel_5  : 1;            /*!< [5..5] Signal on PB8                                                      */
      __IOM uint32_t Channel_6  : 1;            /*!< [6..6] Signal on PB7                                                      */
      __IOM uint32_t Channel_7  : 1;            /*!< [7..7] Signal on PB6                                                      */
      __IM  uint32_t            : 22;
      __IOM uint32_t Channel_30 : 1;            /*!< [30..30] VRef from Thermosensor                                           */
      __IOM uint32_t Channel_31 : 1;            /*!< [31..31] Temperature from Thermosensor                                    */
    } ADC1_CHSEL_b;
  } ;
  __IM  uint32_t  RESERVED4;
  
  union {
    __IOM uint32_t ADC1_TRIM;                   /*!< (@ 0x00000030) ADC TS_Vref trim register                                  */
    
    struct {
      __IM  uint32_t            : 1;
      __IOM uint32_t TS_Trim    : 5;            /*!< [5..1] Trim Vref from Thermosensor                                        */
      __IOM uint32_t SEL_VREF_BUF : 1;          /*!< [6..6] Output Vref_Buf=1.23 from Thermosensor                             */
    } ADC1_TRIM_b;
  } ;
} MDR_ADC_Type;                                 /*!< Size = 52 (0x34)                                                          */



/* =========================================================================================================================== */
/* ================                                          MDR_BKP                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief Backup and RTC Control (MDR_BKP)
  */

typedef struct {                                /*!< (@ 0x40060000) MDR_BKP Structure                                          */
  __IOM uint32_t  REG_00;                       /*!< (@ 0x00000000) User backup registers                                      */
  __IOM uint32_t  REG_01;                       /*!< (@ 0x00000004) User backup registers                                      */
  __IOM uint32_t  REG_02;                       /*!< (@ 0x00000008) User backup registers                                      */
  __IOM uint32_t  REG_03;                       /*!< (@ 0x0000000C) User backup registers                                      */
  __IOM uint32_t  REG_04;                       /*!< (@ 0x00000010) User backup registers                                      */
  __IOM uint32_t  REG_05;                       /*!< (@ 0x00000014) User backup registers                                      */
  __IOM uint32_t  REG_06;                       /*!< (@ 0x00000018) User backup registers                                      */
  __IOM uint32_t  REG_07;                       /*!< (@ 0x0000001C) User backup registers                                      */
  __IOM uint32_t  REG_08;                       /*!< (@ 0x00000020) User backup registers                                      */
  __IOM uint32_t  REG_09;                       /*!< (@ 0x00000024) User backup registers                                      */
  __IOM uint32_t  REG_0A;                       /*!< (@ 0x00000028) User backup registers                                      */
  __IOM uint32_t  REG_0B;                       /*!< (@ 0x0000002C) User backup registers                                      */
  __IOM uint32_t  REG_0C;                       /*!< (@ 0x00000030) User backup registers                                      */
  __IOM uint32_t  REG_0D;                       /*!< (@ 0x00000034) User backup registers                                      */
  
  union {
    __IOM uint32_t REG_0E;                      /*!< (@ 0x00000038) REG_OE Control register                                    */
    
