StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VK234.h
    struct {
      __IOM uint32_t LOW        : 3;            /*!< [2..0] DUcc Freq control                                                  */
      __IOM uint32_t SelectRI   : 3;            /*!< [5..3] DUcc extra I, should be equals to LOW field!                       */
      __IOM uint32_t Jtag_A     : 1;            /*!< [6..6] Enable Jtag_A interface                                            */
      __IOM uint32_t Jtag_B     : 1;            /*!< [7..7] Enable Jtag_B interface                                            */
      __IOM uint32_t Trim_dDUcc : 3;            /*!< [10..8] Ducc adjust voltages                                              */
      __IOM uint32_t FPOR       : 1;            /*!< [11..11] Power Reset Flag                                                 */
      __IOM uint32_t Trim_DUcc  : 2;            /*!< [13..12] Select DUcc voltage                                              */
      __IOM uint32_t COVDET     : 1;            /*!< [14..14] Breaking access flag                                             */
      __IOM uint32_t I_LimEn    : 1;            /*!< [15..15] Enable I 150mA protection                                        */
    } REG_0E_b;
  } ;
  
  union {
    __IOM uint32_t REG_0F;                      /*!< (@ 0x0000003C) REG_OF Control register                                    */
    
    struct {
      __IOM uint32_t LSE_ON     : 1;            /*!< [0..0] LSE generator enable                                               */
      __IOM uint32_t LSE_BYP    : 1;            /*!< [1..1] LSE generator                                                      */
      __IOM uint32_t RTC_SEL    : 2;            /*!< [3..2] Select Clock for RTC                                               */
      __IOM uint32_t RTC_EN     : 1;            /*!< [4..4] RTC enable                                                         */
      __IOM uint32_t RTC_CAL    : 8;            /*!< [12..5] RTC calibration                                                   */
      __IM  uint32_t LSE_RDY    : 1;            /*!< [13..13] LSE frequency ready                                              */
      __IM  uint32_t            : 1;
      __IOM uint32_t LSI_ON     : 1;            /*!< [15..15] LSI generator enable                                             */
      __IOM uint32_t LSI_TRIM   : 5;            /*!< [20..16] LSI frequency adjust                                             */
      __IM  uint32_t LSI_RDY    : 1;            /*!< [21..21] LSI frequency ready                                              */
      __IOM uint32_t HSI_ON     : 1;            /*!< [22..22] HSI generator enable                                             */
      __IOM uint32_t HSI_RDY    : 1;            /*!< [23..23] HSI frequency ready                                              */
      __IOM uint32_t HSI_TRIM   : 6;            /*!< [29..24] HSI frequency adjust                                             */
      __IOM uint32_t Standby    : 1;            /*!< [30..30] Standby sleep mode                                               */
      __IOM uint32_t RTC_RESET  : 1;            /*!< [31..31] Reset RTC bit                                                    */
    } REG_0F_b;
  } ;
  __IOM uint32_t  RTC_CNT;                      /*!< (@ 0x00000040) Count periods of PRL                                       */
  
  union {
    __IOM uint32_t RTC_DIV;                     /*!< (@ 0x00000044) Counts RTC Clock to get PRL value                          */
    
    struct {
      __IOM uint32_t Value      : 20;           /*!< [19..0] RTC DIV value                                                     */
    } RTC_DIV_b;
  } ;
  
  union {
    __IOM uint32_t RTC_PRL;                     /*!< (@ 0x00000048) Period value for DIV counter                               */
    
    struct {
      __IOM uint32_t Value      : 20;           /*!< [19..0] RTC PRL value                                                     */
    } RTC_PRL_b;
  } ;
  
  union {
    __IOM uint32_t RTC_ALRM;                    /*!< (@ 0x0000004C) Event value for CNT counter                                */
    
    struct {
      __IOM uint32_t Value      : 32;           /*!< [31..0] Alarm value of CNT                                                */
    } RTC_ALRM_b;
  } ;
  
  union {
    __IOM uint32_t RTC_CS;                      /*!< (@ 0x00000050) RTC Control and Status                                     */
    
    struct {
      __IOM uint32_t OWF        : 1;            /*!< [0..0] CNT Overflow flag, clear by set 1                                  */
      __IOM uint32_t SECF       : 1;            /*!< [1..1] DIV == PRL Event, clear by set 1                                   */
      __IOM uint32_t ALRF       : 1;            /*!< [2..2] CNT == ALRM Event, clear by set 1                                  */
      __IOM uint32_t OWF_IE     : 1;            /*!< [3..3] Enable IRQ by OWF                                                  */
      __IOM uint32_t SECF_IE    : 1;            /*!< [4..4] Enable IRQ by SECF                                                 */
      __IOM uint32_t ALRF_IE    : 1;            /*!< [5..5] Enable IRQ by ALRF                                                 */
      __IOM uint32_t WEC        : 1;            /*!< [6..6] RTC Busy flag                                                      */
    } RTC_CS_b;
  } ;
} MDR_BKP_Type;                                 /*!< Size = 84 (0x54)                                                          */



/* =========================================================================================================================== */
/* ================                                         MDR_ADCUI                                         ================ */
/* =========================================================================================================================== */


/**
  * @brief Energy Counter Block (MDR_ADCUI)
  */

typedef struct {                                /*!< (@ 0x40068000) MDR_ADCUI Structure                                        */
  
  union {
    __IOM uint32_t CTRL1;                       /*!< (@ 0x00000000) ADCUI Control1 Register                                    */
    
