StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VK234.h
    struct {
      __IOM uint32_t I0EN       : 1;            /*!< [0..0] Channel enable                                                     */
      __IOM uint32_t V0EN       : 1;            /*!< [1..1] Channel enable                                                     */
      __IOM uint32_t I1EN       : 1;            /*!< [2..2] Channel enable                                                     */
      __IOM uint32_t V1EN       : 1;            /*!< [3..3] Channel enable                                                     */
      __IOM uint32_t I2EN       : 1;            /*!< [4..4] Channel enable                                                     */
      __IOM uint32_t V2EN       : 1;            /*!< [5..5] Channel enable                                                     */
      __IOM uint32_t I3EN       : 1;            /*!< [6..6] Channel enable                                                     */
      __IOM uint32_t RESOL      : 1;            /*!< [7..7] Data resolution                                                    */
      __IOM uint32_t ZXLPF      : 1;            /*!< [8..8] V0 cross zero LPF enable                                           */
      __IOM uint32_t PER_Length : 3;            /*!< [11..9] Period to calc aver period and dPhase                             */
      __IOM uint32_t APNOLOAD   : 2;            /*!< [13..12] Active Energy min level to accumulate                            */
      __IM  uint32_t            : 1;
      __IOM uint32_t VARNOLOAD  : 2;            /*!< [16..15] Reactive Energy min level to accumulate                          */
      __IOM uint32_t VANOLOAD   : 2;            /*!< [18..17] Full Energy min level to accumulate                              */
      __IOM uint32_t FREQSEL    : 1;            /*!< [19..19] Enable V0 period detection to FxMD0.PER_FREQ                     */
      __IOM uint32_t VREF_SEL   : 1;            /*!< [20..20] ADC Vref select                                                  */
      __IOM uint32_t BUF_BYP    : 1;            /*!< [21..21] Bypass Vref buffer                                               */
      __IOM uint32_t CHOP_EN    : 1;            /*!< [22..22] Chopper Mode Select                                              */
      __IOM uint32_t CHOP_FREQ  : 2;            /*!< [24..23] Chopper Frequency                                                */
      __IM  uint32_t            : 2;
      __IOM uint32_t ZXRMS      : 1;            /*!< [27..27] RMS Update mode                                                  */
      __IOM uint32_t RESET_DIG  : 1;            /*!< [28..28] Digital Logic Reset                                              */
      __IOM uint32_t IBOOST     : 1;            /*!< [29..29] Boost I mode                                                     */
      __IOM uint32_t OSR_CONF   : 2;            /*!< [31..30] ADC Output Sampling Rate                                         */
    } CTRL1_b;
  } ;
  
  union {
    __IOM uint32_t CTRL2;                       /*!< (@ 0x00000004) ADCUI Control2 Register                                    */
    
    struct {
      __IOM uint32_t SAGLVL     : 16;           /*!< [15..0] V0 min OK level                                                   */
      __IOM uint32_t SAGCYC     : 8;            /*!< [23..16] Count of V0 half periods to calc V0 level                        */
    } CTRL2_b;
  } ;
  
  union {
    __IOM uint32_t CTRL3;                       /*!< (@ 0x00000008) ADCUI Control3 Register                                    */
    
    struct {
      __IOM uint32_t ZTXOUT     : 12;           /*!< [11..0] V0 cross zero timeout                                             */
    } CTRL3_b;
  } ;
  
  union {
    __IOM uint32_t F0CTR;                       /*!< (@ 0x0000000C) FxCTR register                                             */
    
    struct {
      __IOM uint32_t I0NTEN     : 1;            /*!< [0..0] Integrator enable                                                  */
      __IOM uint32_t I3NTEN     : 1;            /*!< [1..1] Integrator enable                                                  */
      __IOM uint32_t VASEL      : 1;            /*!< [2..2] Select source for FullEnergy                                       */
      __OM  uint32_t RARS       : 1;            /*!< [3..3] Active Energy Accumulator Reset                                    */
      __OM  uint32_t RRRS       : 1;            /*!< [4..4] Reactive Energy Accumulator Reset                                  */
      __OM  uint32_t RVRS       : 1;            /*!< [5..5] Full Energy Accumulator Reset                                      */
      __IOM uint32_t I0GAIN     : 2;            /*!< [7..6] PGA value                                                          */
      __IOM uint32_t VGAIN      : 2;            /*!< [9..8] PGA value                                                          */
      __IOM uint32_t VPHASE     : 8;            /*!< [17..10] Phase V0 adjustment by step of +-124us                           */
      __IOM uint32_t I3GAIN     : 2;            /*!< [19..18] PGA value                                                        */
      __IOM uint32_t IRMSOS     : 12;           /*!< [31..20] RMS calibration of channel I                                     */
    } F0CTR_b;
  } ;
  
  union {
    __IOM uint32_t F0WC;                        /*!< (@ 0x00000010) Active energy calibration                                  */
    
    struct {
      __IOM uint32_t WATTOS     : 16;           /*!< [15..0] Calibr bias of active energy                                      */
      __IOM uint32_t WGAIN      : 12;           /*!< [27..16] Calibr gain of active energy                                     */
    } F0WC_b;
  } ;
  
  union {
    __IM  uint32_t F0WATTP;                     /*!< (@ 0x00000014) Positive Active Energy accumulator                         */
    
    struct {
      __IM  uint32_t WATTHRP    : 32;           /*!< [31..0] High 32 bits of Accumulator                                       */
    } F0WATTP_b;
  } ;
  
  union {
    __IM  uint32_t F0WATTN;                     /*!< (@ 0x00000018) Negative Active Energy accumulator                         */
    
