StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VK234.h
    struct {
      __IM  uint32_t WATTHRN    : 32;           /*!< [31..0] High 32 bits of 57bits Accumulator                                */
    } F0WATTN_b;
  } ;
  
  union {
    __IOM uint32_t F0VC;                        /*!< (@ 0x0000001C) Reactive energy calibration                                */
    
    struct {
      __IOM uint32_t VAROS      : 16;           /*!< [15..0] Calibr bias of reactive energy                                    */
      __IOM uint32_t VARGAIN    : 12;           /*!< [27..16] Calibr gain of reactive energy                                   */
    } F0VC_b;
  } ;
  
  union {
    __IM  uint32_t F0VARP;                      /*!< (@ 0x00000020) Positive Reactive Energy accumulator                       */
    
    struct {
      __IM  uint32_t VARHRP     : 32;           /*!< [31..0] High 32 bits of of 57bits Accumulator                             */
    } F0VARP_b;
  } ;
  
  union {
    __IM  uint32_t F0VARN;                      /*!< (@ 0x00000024) Negative Reactive Energy accumulator                       */
    
    struct {
      __IM  uint32_t VARHRN     : 32;           /*!< [31..0] High 32 bits of of 57bits Accumulator                             */
    } F0VARN_b;
  } ;
  
  union {
    __IOM uint32_t F0AC;                        /*!< (@ 0x00000028) V0 RMS calibration                                         */
    
    struct {
      __IOM uint32_t VRMSOS     : 12;           /*!< [11..0] Calibr bias of V0 RMS                                             */
      __IM  uint32_t            : 4;
      __IOM uint32_t VAGAIN     : 12;           /*!< [27..16] Calibr gain of Full energy                                       */
    } F0AC_b;
  } ;
  
  union {
    __IM  uint32_t F0VR;                        /*!< (@ 0x0000002C) Full Energy accumulator                                    */
    
    struct {
      __IM  uint32_t VAHR       : 32;           /*!< [31..0] High 32 bits of of 57bits Accumulator                             */
    } F0VR_b;
  } ;
  
  union {
    __IOM uint32_t F0MD0;                       /*!< (@ 0x00000030) FxMD0 register                                             */
    
    struct {
      __IOM uint32_t VSEL       : 2;            /*!< [1..0] Select source for FxVDAT                                           */
      __IOM uint32_t ISEL       : 2;            /*!< [3..2] Select source for FxI0DAT                                          */
      __IM  uint32_t ACTS       : 1;            /*!< [4..4] Active Energy sign in last period                                  */
      __IM  uint32_t REACTS     : 1;            /*!< [5..5] Reactive Energy sign in last period                                */
      __IOM uint32_t IOGAIN     : 1;            /*!< [6..6] ADC Decimation gain                                                */
      __IOM uint32_t V0GAIN     : 1;            /*!< [7..7] ADC Decimation gain                                                */
      __IOM uint32_t I3GAIN     : 1;            /*!< [8..8] ADC Decimation gain                                                */
      __IM  uint32_t            : 3;
      __IM  uint32_t PER_FREQ   : 17;           /*!< [28..12] Measured period of V                                             */
      __IOM uint32_t I3SEL      : 1;            /*!< [29..29] Select source for FxI3DAT                                        */
      __IOM uint32_t SEL_I_CH   : 2;            /*!< [31..30] Select I for calc power                                          */
    } F0MD0_b;
  } ;
  
  union {
    __IOM uint32_t F0MD1;                       /*!< (@ 0x00000034) FxMD1 register                                             */
    
    struct {
      __IOM uint32_t IPKLVL     : 16;           /*!< [15..0] Imax level                                                        */
      __IOM uint32_t VPKLVL     : 16;           /*!< [31..16] Vmax level                                                       */
    } F0MD1_b;
  } ;
  
  union {
    __IOM uint32_t F0VPEAK;                     /*!< (@ 0x00000038) VPEAK Result register                                      */
    
    struct {
      __IOM uint32_t IPEAK      : 24;           /*!< [23..0] Vmax measured, write any to clear                                 */
    } F0VPEAK_b;
  } ;
  
  union {
    __IOM uint32_t F0IPEAK;                     /*!< (@ 0x0000003C) IPEAK Result register                                      */
    
    struct {
      __IOM uint32_t IPEAK      : 24;           /*!< [23..0] Imax measured, write any to clear                                 */
    } F0IPEAK_b;
  } ;
  
  union {
    __IM  uint32_t F0VDAT;                      /*!< (@ 0x00000040) VDAT Result register                                       */
    
    struct {
      __IM  uint32_t VDAT       : 24;           /*!< [23..0] FIFO of V or Power                                                */
    } F0VDAT_b;
  } ;
  
  union {
    __IM  uint32_t F0I0DAT;                     /*!< (@ 0x00000044) I0DAT Result register                                      */
    
    struct {
      __IM  uint32_t I0DAT      : 24;           /*!< [23..0] FIFO of I0 or Power                                               */
    } F0I0DAT_b;
  } ;
  
  union {
    __IM  uint32_t F0I3DAT;                     /*!< (@ 0x00000048) I3DAT Result register                                      */
    
    struct {
      __IM  uint32_t I3DAT      : 24;           /*!< [23..0] FIFO of I3 or Power                                               */
    } F0I3DAT_b;
  } ;
  
  union {
    __IM  uint32_t F0VRMS;                      /*!< (@ 0x0000004C) VRMS Result register                                       */
    
    struct {
      __IM  uint32_t VRMS       : 24;           /*!< [23..0] RMS of V                                                          */
    } F0VRMS_b;
  } ;
  
  union {
    __IM  uint32_t F0VRMS2;                     /*!< (@ 0x00000050) VRMS^2 Result register                                     */
    
