StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VK234.h
    struct {
      __IOM uint32_t INTEN      : 1;            /*!< [0..0] Integrator enable                                                  */
      __IM  uint32_t            : 1;
      __IOM uint32_t VASEL      : 1;            /*!< [2..2] Select source for FullEnergy                                       */
      __OM  uint32_t RARS       : 1;            /*!< [3..3] Active Energy Accumulator Reset                                    */
      __OM  uint32_t RRRS       : 1;            /*!< [4..4] Reactive Energy Accumulator Reset                                  */
      __OM  uint32_t RVRS       : 1;            /*!< [5..5] Full Energy Accumulator Reset                                      */
      __IOM uint32_t IGAIN      : 2;            /*!< [7..6] PGA value                                                          */
      __IOM uint32_t VGAIN      : 2;            /*!< [9..8] PGA value                                                          */
      __IOM uint32_t VPHASE     : 8;            /*!< [17..10] Phase V adjustment by step of +-124us                            */
      __IM  uint32_t            : 2;
      __IOM uint32_t IRMSOS     : 12;           /*!< [31..20] RMS calibration of channel I                                     */
    } F1CTR_b;
  } ;
  
  union {
    __IOM uint32_t F1WC;                        /*!< (@ 0x00000068) Active energy calibration                                  */
    
    struct {
      __IOM uint32_t WATTOS     : 16;           /*!< [15..0] Calibr bias of active energy                                      */
      __IOM uint32_t WGAIN      : 12;           /*!< [27..16] Calibr gain of active energy                                     */
    } F1WC_b;
  } ;
  
  union {
    __IM  uint32_t F1WATTP;                     /*!< (@ 0x0000006C) Positive Active Energy accumulator                         */
    
    struct {
      __IM  uint32_t WATTHRP    : 32;           /*!< [31..0] High 32 bits of Accumulator                                       */
    } F1WATTP_b;
  } ;
  
  union {
    __IM  uint32_t F1WATTN;                     /*!< (@ 0x00000070) Negative Active Energy accumulator                         */
    
    struct {
      __IM  uint32_t WATTHRN    : 32;           /*!< [31..0] High 32 bits of 57bits Accumulator                                */
    } F1WATTN_b;
  } ;
  
  union {
    __IOM uint32_t F1VC;                        /*!< (@ 0x00000074) Reactive energy calibration                                */
    
    struct {
      __IOM uint32_t VAROS      : 16;           /*!< [15..0] Calibr bias of reactive energy                                    */
      __IOM uint32_t VARGAIN    : 12;           /*!< [27..16] Calibr gain of reactive energy                                   */
    } F1VC_b;
  } ;
  
  union {
    __IM  uint32_t F1VARP;                      /*!< (@ 0x00000078) Positive Reactive Energy accumulator                       */
    
    struct {
      __IM  uint32_t VARHRP     : 32;           /*!< [31..0] High 32 bits of of 57bits Accumulator                             */
    } F1VARP_b;
  } ;
  
  union {
    __IM  uint32_t F1VARN;                      /*!< (@ 0x0000007C) Negative Reactive Energy accumulator                       */
    
    struct {
      __IM  uint32_t VARHRN     : 32;           /*!< [31..0] High 32 bits of of 57bits Accumulator                             */
    } F1VARN_b;
  } ;
  
  union {
    __IOM uint32_t F1AC;                        /*!< (@ 0x00000080) V RMS calibration                                          */
    
    struct {
      __IOM uint32_t VRMSOS     : 12;           /*!< [11..0] Calibr bias of V RMS                                              */
      __IM  uint32_t            : 4;
      __IOM uint32_t VAGAIN     : 12;           /*!< [27..16] Calibr gain of Full energy                                       */
    } F1AC_b;
  } ;
  
  union {
    __IM  uint32_t F1VR;                        /*!< (@ 0x00000084) Full Energy accumulator                                    */
    
    struct {
      __IM  uint32_t VAHR       : 32;           /*!< [31..0] High 32 bits of of 57bits Accumulator                             */
    } F1VR_b;
  } ;
  
  union {
    __IOM uint32_t F1MD0;                       /*!< (@ 0x00000088) FxMD0 register                                             */
    
    struct {
      __IOM uint32_t VSEL       : 2;            /*!< [1..0] Select source for FxVDAT                                           */
      __IOM uint32_t ISEL       : 2;            /*!< [3..2] Select source for FxI0DAT                                          */
      __IM  uint32_t ACTS       : 1;            /*!< [4..4] Active Energy sign in last period                                  */
      __IM  uint32_t REACTS     : 1;            /*!< [5..5] Reactive Energy sign in last period                                */
      __IOM uint32_t IGAIN      : 1;            /*!< [6..6] ADC Decimation gain                                                */
      __IOM uint32_t VGAIN      : 1;            /*!< [7..7] ADC Decimation gain                                                */
      __IM  uint32_t            : 4;
      __IM  uint32_t PER_FREQ   : 17;           /*!< [28..12] Measured period of V                                             */
    } F1MD0_b;
  } ;
  
  union {
    __IOM uint32_t F1MD1;                       /*!< (@ 0x0000008C) FxMD1 register                                             */
    
    struct {
      __IOM uint32_t IPKLVL     : 16;           /*!< [15..0] Imax level                                                        */
      __IOM uint32_t VPKLVL     : 16;           /*!< [31..16] Vmax level                                                       */
    } F1MD1_b;
  } ;
  
  union {
    __IM  uint32_t F1MD2;                       /*!< (@ 0x00000090) FxMD2 register                                             */
    
    struct {
      __IM  uint32_t PhaseV_toV0 : 17;          /*!< [16..0] Phase V1 ref to V0                                                */
    } F1MD2_b;
  } ;
  
  union {
    __IOM uint32_t F1VPEAK;                     /*!< (@ 0x00000094) VPEAK Result register                                      */
    
