StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VK234.h
    struct {
      __IOM uint32_t IPEAK      : 24;           /*!< [23..0] Vmax measured, write any to clear                                 */
    } F1VPEAK_b;
  } ;
  
  union {
    __IOM uint32_t F1IPEAK;                     /*!< (@ 0x00000098) IPEAK Result register                                      */
    
    struct {
      __IOM uint32_t IPEAK      : 24;           /*!< [23..0] Imax measured, write any to clear                                 */
    } F1IPEAK_b;
  } ;
  
  union {
    __IM  uint32_t F1VDAT;                      /*!< (@ 0x0000009C) VDAT Result register                                       */
    
    struct {
      __IM  uint32_t VDAT       : 24;           /*!< [23..0] FIFO of V or Power                                                */
    } F1VDAT_b;
  } ;
  
  union {
    __IM  uint32_t F1IDAT;                      /*!< (@ 0x000000A0) IDAT Result register                                       */
    
    struct {
      __IM  uint32_t IDAT       : 24;           /*!< [23..0] FIFO of I or Power                                                */
    } F1IDAT_b;
  } ;
  
  union {
    __IM  uint32_t F1VRMS;                      /*!< (@ 0x000000A4) VRMS Result register                                       */
    
    struct {
      __IM  uint32_t VRMS       : 24;           /*!< [23..0] RMS of V                                                          */
    } F1VRMS_b;
  } ;
  
  union {
    __IM  uint32_t F1VRMS2;                     /*!< (@ 0x000000A8) VRMS^2 Result register                                     */
    
    struct {
      __IM  uint32_t VRMS2      : 24;           /*!< [23..0] RMS of V^2                                                        */
    } F1VRMS2_b;
  } ;
  
  union {
    __IM  uint32_t F1IRMS;                      /*!< (@ 0x000000AC) IRMS Result register                                       */
    
    struct {
      __IM  uint32_t IRMS       : 24;           /*!< [23..0] RMS of I                                                          */
    } F1IRMS_b;
  } ;
  
  union {
    __IM  uint32_t F1IRMS2;                     /*!< (@ 0x000000B0) IRMS^2 Result register                                     */
    
    struct {
      __IM  uint32_t IRMS2      : 24;           /*!< [23..0] RMS of I^2                                                        */
    } F1IRMS2_b;
  } ;
  
  union {
    __IOM uint32_t F1STAT;                      /*!< (@ 0x000000B4) Status Register                                            */
    
    struct {
      __IM  uint32_t VF_EMP     : 1;            /*!< [0..0] FIFO_VDAT is Empty                                                 */
      __IM  uint32_t VF_FLL     : 1;            /*!< [1..1] FIFO_VDAT is Full                                                  */
      __IOM uint32_t VF_OVER    : 1;            /*!< [2..2] FIFO_VDAT is Overflow                                              */
      __IM  uint32_t IF_EMP     : 1;            /*!< [3..3] FIFO_IDAT is Empty                                                 */
      __IM  uint32_t IF_FLL     : 1;            /*!< [4..4] FIFO_IDAT is Full                                                  */
      __IOM uint32_t IF_OVER    : 1;            /*!< [5..5] FIFO_IDAT is Overflow                                              */
      __IOM uint32_t SAGF       : 1;            /*!< [6..6] V is less than CTRL2.SAGLVL                                        */
      __IOM uint32_t PEAKVF     : 1;            /*!< [7..7] V exceeds F0MD1.VPKLVL                                             */
      __IOM uint32_t PEAKIF     : 1;            /*!< [8..8] I exceeds F0MD1.VPKLVL                                             */
      __IOM uint32_t WATTOVP    : 1;            /*!< [9..9] FxWATTP value overflow                                             */
      __IOM uint32_t VAROVP     : 1;            /*!< [10..10] FxVARP value overflow                                            */
      __IOM uint32_t VAOV       : 1;            /*!< [11..11] FxVR value overflow                                              */
      __IOM uint32_t ZTXVF      : 1;            /*!< [12..12] Timeout of V cross zero                                          */
      __IM  uint32_t            : 2;
      __IOM uint32_t APSIGN     : 1;            /*!< [15..15] ActivePower sign changed                                         */
      __IM  uint32_t APNLDFL    : 1;            /*!< [16..16] ActivePower less CNTL1.APNOLOAD                                  */
      __IOM uint32_t VARSIGN    : 1;            /*!< [17..17] ReactivePower sign changed                                       */
      __IM  uint32_t VARNLDFL   : 1;            /*!< [18..18] ReactivePower less CNTL1.VARNOLOAD                               */
      __IM  uint32_t            : 1;
      __IM  uint32_t VANLDFL    : 1;            /*!< [20..20] FullPower less CNTL1.VANOLOAD                                    */
      __IOM uint32_t ZEROCRS    : 1;            /*!< [21..21] V crossed zero                                                   */
      __IM  uint32_t            : 3;
      __IOM uint32_t WATTOVN    : 1;            /*!< [25..25] FxWATTN value overflow                                           */
      __IOM uint32_t VAROVN     : 1;            /*!< [26..26] FxVARN value overflow                                            */
    } F1STAT_b;
  } ;
  
  union {
    __IOM uint32_t F1MASK;                      /*!< (@ 0x000000B8) IRQ Mask Register                                          */
    
    struct {
      __IOM uint32_t VF_EMPM    : 1;            /*!< [0..0] FIFO_VDAT is Empty                                                 */
      __IOM uint32_t VF_FLLM    : 1;            /*!< [1..1] FIFO_VDAT is Full                                                  */
      __IOM uint32_t VF_OVERM   : 1;            /*!< [2..2] FIFO_VDAT is Overflow                                              */
      __IOM uint32_t IF_EMPM    : 1;            /*!< [3..3] FIFO_IDAT is Empty                                                 */
      __IOM uint32_t IF_FLLM    : 1;            /*!< [4..4] FIFO_IDAT is Full                                                  */
      __IOM uint32_t IF_OVERM   : 1;            /*!< [5..5] FIFO_IDAT is Overflow                                              */
      __IOM uint32_t SAGFM      : 1;            /*!< [6..6] V is less than CTRL2.SAGLVL                                        */
      __IOM uint32_t PEAKVFM    : 1;            /*!< [7..7] V exceeds F0MD1.VPKLVL                                             */
      __IOM uint32_t PEAKIFM    : 1;            /*!< [8..8] I exceeds F0MD1.VPKLVL                                             */
      __IOM uint32_t WATTOVPM   : 1;            /*!< [9..9] FxWATTP value overflow                                             */
      __IOM uint32_t VAROVPM    : 1;            /*!< [10..10] FxVARP value overflow                                            */
      __IOM uint32_t VAOVM      : 1;            /*!< [11..11] FxVR value overflow                                              */
      __IOM uint32_t ZTXVFM     : 1;            /*!< [12..12] Timeout of V cross zero                                          */
      __IM  uint32_t            : 2;
      __IOM uint32_t APSIGNM    : 1;            /*!< [15..15] ActivePower sign changed                                         */
      __IOM uint32_t APNLDFLM   : 1;            /*!< [16..16] ActivePower less CNTL1.APNOLOAD                                  */
      __IOM uint32_t VARSIGNM   : 1;            /*!< [17..17] ReactivePower sign changed                                       */
      __IOM uint32_t VARNLDFLM  : 1;            /*!< [18..18] ReactivePower less CNTL1.VARNOLOAD                               */
      __IM  uint32_t            : 1;
      __IOM uint32_t VANLDFLM   : 1;            /*!< [20..20] FullPower less CNTL1.VANOLOAD                                    */
      __IOM uint32_t ZEROCRSM   : 1;            /*!< [21..21] V crossed zero                                                   */
      __IM  uint32_t            : 3;
      __IOM uint32_t WATTOVNM   : 1;            /*!< [25..25] FxWATTN value overflow                                           */
      __IOM uint32_t VAROVNM    : 1;            /*!< [26..26] FxVARN value overflow                                            */
    } F1MASK_b;
  } ;
  
  union {
    __IOM uint32_t F2CTR;                       /*!< (@ 0x000000BC) FxCTR register                                             */
    
