StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VK234.h
    struct {
      __IOM uint32_t V0BGAIN    : 12;           /*!< [11..0] V0 calibration gain                                               */
      __IOM uint32_t I0BGAIN    : 12;           /*!< [23..12] I0 calibration gain                                              */
    } CCAL1_b;
  } ;
  
  union {
    __IOM uint32_t CCAL2;                       /*!< (@ 0x00000118) Calibration Register 2                                     */
    
    struct {
      __IOM uint32_t V1BGAIN    : 12;           /*!< [11..0] V1 calibration gain                                               */
      __IOM uint32_t I1BGAIN    : 12;           /*!< [23..12] I1 calibration gain                                              */
    } CCAL2_b;
  } ;
  
  union {
    __IOM uint32_t CCAL3;                       /*!< (@ 0x0000011C) Calibration Register 3                                     */
    
    struct {
      __IOM uint32_t V2BGAIN    : 12;           /*!< [11..0] V2 calibration gain                                               */
      __IOM uint32_t I2BGAIN    : 12;           /*!< [23..12] I2 calibration gain                                              */
    } CCAL3_b;
  } ;
  
  union {
    __IOM uint32_t CCAL4;                       /*!< (@ 0x00000120) Calibration Register 4                                     */
    
    struct {
      __IOM uint32_t I3BGAIN    : 12;           /*!< [11..0] I3 calibration gain                                               */
    } CCAL4_b;
  } ;
} MDR_ADCUI_Type;                               /*!< Size = 292 (0x124)                                                        */



/* =========================================================================================================================== */
/* ================                                         MDR_UART1                                         ================ */
/* =========================================================================================================================== */


/**
  * @brief UART Control (MDR_UART1)
  */

typedef struct {                                /*!< (@ 0x40008000) MDR_UART1 Structure                                        */
  
  union {
    __IOM uint32_t DR;                          /*!< (@ 0x00000000) Data Register                                              */
    
    struct {
      __IOM uint32_t DATA       : 8;            /*!< [7..0] Data FIFO access                                                   */
      __IOM uint32_t FE         : 1;            /*!< [8..8] Stop Bit Error                                                     */
      __IOM uint32_t PE         : 1;            /*!< [9..9] Parity Error                                                       */
      __IOM uint32_t BE         : 1;            /*!< [10..10] Break Error                                                      */
      __IOM uint32_t OE         : 1;            /*!< [11..11] Overrun FIFO_RX                                                  */
    } DR_b;
  } ;
  
  union {
    __IOM uint32_t RSR_ECR;                     /*!< (@ 0x00000004) Receive Status and Error Clear Register                    */
    
    struct {
      __IOM uint32_t FE         : 1;            /*!< [0..0] Stop Bit Error                                                     */
      __IOM uint32_t PE         : 1;            /*!< [1..1] Parity Error                                                       */
      __IOM uint32_t BE         : 1;            /*!< [2..2] Break Error                                                        */
      __IOM uint32_t OE         : 1;            /*!< [3..3] Overrun FIFO_RX                                                    */
    } RSR_ECR_b;
  } ;
  __IM  uint32_t  RESERVED[4];
  
  union {
    __IM  uint32_t FR;                          /*!< (@ 0x00000018) Flag Register                                              */
    
    struct {
      __IM  uint32_t CTS        : 1;            /*!< [0..0] Modem Clear To Send                                                */
      __IM  uint32_t DSR        : 1;            /*!< [1..1] Modem Data Set Ready                                               */
      __IM  uint32_t DCD        : 1;            /*!< [2..2] Modem Data Carrier Detect                                          */
      __IM  uint32_t BUSY       : 1;            /*!< [3..3] Transmitting data                                                  */
      __IM  uint32_t RXFE       : 1;            /*!< [4..4] FIFO_RX Empty status                                               */
      __IM  uint32_t TXFF       : 1;            /*!< [5..5] FIFO_TX Full Status                                                */
      __IM  uint32_t RXFF       : 1;            /*!< [6..6] FIFO_RX Full Status                                                */
      __IM  uint32_t TXFE       : 1;            /*!< [7..7] FIFO_RX Empty status                                               */
      __IM  uint32_t RI         : 1;            /*!< [8..8] Modem Ring Indicator                                               */
    } FR_b;
  } ;
  __IM  uint32_t  RESERVED1;
  
  union {
    __IOM uint32_t ILPR;                        /*!< (@ 0x00000020) IrDA Low-Power Counter                                     */
    
    struct {
      __IOM uint32_t DVSR       : 8;            /*!< [7..0] Div of SampleRate                                                  */
    } ILPR_b;
  } ;
  
  union {
    __IOM uint32_t IBRD;                        /*!< (@ 0x00000024) Integer BaudRate Divisor                                   */
    
    struct {
      __IOM uint32_t Baud_DivInt : 16;          /*!< [15..0] Integer part of Rate divisor                                      */
    } IBRD_b;
  } ;
  
  union {
    __IOM uint32_t FBRD;                        /*!< (@ 0x00000028) Fractional BaudRate Divisor                                */
    
    struct {
      __IOM uint32_t Baud_DivFrac : 6;          /*!< [5..0] Fractional part of Rate divisor                                    */
    } FBRD_b;
  } ;
  
  union {
    __IOM uint32_t LCR_H;                       /*!< (@ 0x0000002C) Line Control Register                                      */
    
