StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VK234.h
    struct {
      __IOM uint32_t BRK        : 1;            /*!< [0..0] Send Break - TX LOW for 2 words                                    */
      __IOM uint32_t PEN        : 1;            /*!< [1..1] Parity Enable                                                      */
      __IOM uint32_t EPS        : 1;            /*!< [2..2] Even Parity Select                                                 */
      __IOM uint32_t STP2       : 1;            /*!< [3..3] Double Stop Bits Enable                                            */
      __IOM uint32_t FEN        : 1;            /*!< [4..4] FIFOs Enable                                                       */
      __IOM uint32_t WLEN       : 2;            /*!< [6..5] Word Length                                                        */
      __IOM uint32_t SPS        : 1;            /*!< [7..7] Stick Parity Select                                                */
    } LCR_H_b;
  } ;
  
  union {
    __IOM uint32_t CR;                          /*!< (@ 0x00000030) Control Register                                           */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] Enable UART                                                        */
      __IOM uint32_t SIREN      : 1;            /*!< [1..1] IrDA Enable                                                        */
      __IOM uint32_t SIRLP      : 1;            /*!< [2..2] IrDA Low-Power Enable                                              */
      __IM  uint32_t            : 4;
      __IOM uint32_t LBE        : 1;            /*!< [7..7] LoopBack Enable                                                    */
      __IOM uint32_t TXE        : 1;            /*!< [8..8] Transmitter Enable                                                 */
      __IOM uint32_t RXE        : 1;            /*!< [9..9] Receiver Enable                                                    */
      __IOM uint32_t DTR        : 1;            /*!< [10..10] Data Transmit Ready                                              */
      __IOM uint32_t RTS        : 1;            /*!< [11..11] Request To Send                                                  */
      __IOM uint32_t Out1       : 1;            /*!< [12..12] Custom Modem Output1 - DCD                                       */
      __IOM uint32_t Out2       : 1;            /*!< [13..13] Custom Modem Output2 - RI                                        */
      __IOM uint32_t RTSEn      : 1;            /*!< [14..14] Hardware RTS Control                                             */
      __IOM uint32_t CTSEn      : 1;            /*!< [15..15] Hardware CTS Control                                             */
    } CR_b;
  } ;
  
  union {
    __IOM uint32_t IFLS;                        /*!< (@ 0x00000034) IRQ FIFO Level                                             */
    
    struct {
      __IOM uint32_t TXIFLSES   : 3;            /*!< [2..0] IRQ FIFO_TX level                                                  */
      __IOM uint32_t RXIFLSES   : 3;            /*!< [5..3] IRQ FIFO_RX level                                                  */
    } IFLS_b;
  } ;
  
  union {
    __IOM uint32_t IMSC;                        /*!< (@ 0x00000038) IRQ Mask Set Clear                                         */
    
    struct {
      __IOM uint32_t RIM_IM     : 1;            /*!< [0..0] RI Modem IRQ Mask                                                  */
      __IOM uint32_t STCM_IM    : 1;            /*!< [1..1] STC Modem IRQ Mask                                                 */
      __IOM uint32_t DCDM_IM    : 1;            /*!< [2..2] DCD Modem IRQ Mask                                                 */
      __IOM uint32_t DSRM_IM    : 1;            /*!< [3..3] DSR Modem IRQ Mask                                                 */
      __IOM uint32_t RX_IM      : 1;            /*!< [4..4] RX IRQ Mask                                                        */
      __IOM uint32_t TX_IM      : 1;            /*!< [5..5] TX IRQ Mask                                                        */
      __IOM uint32_t RT_IM      : 1;            /*!< [6..6] RX Timeout IRQ Mask                                                */
      __IOM uint32_t FE_IM      : 1;            /*!< [7..7] Frame Error IRQ Mask                                               */
      __IOM uint32_t PE_IM      : 1;            /*!< [8..8] Parity Error IRQ Mask                                              */
      __IOM uint32_t BE_IM      : 1;            /*!< [9..9] BreakLine IRQ Mask                                                 */
      __IOM uint32_t OE_IM      : 1;            /*!< [10..10] Overrun FIFO_RX IRQ Mask                                         */
    } IMSC_b;
  } ;
  
  union {
    __IM  uint32_t RIS;                         /*!< (@ 0x0000003C) Raw IQR Status Register                                    */
    
    struct {
      __IM  uint32_t RIM_RIS    : 1;            /*!< [0..0] RI Modem Event                                                     */
      __IM  uint32_t STCM_RIS   : 1;            /*!< [1..1] STC Modem Event                                                    */
      __IM  uint32_t DCDM_RIS   : 1;            /*!< [2..2] DCD Modem Event                                                    */
      __IM  uint32_t DSRM_RIS   : 1;            /*!< [3..3] DSR Modem Event                                                    */
      __IM  uint32_t RX_RIS     : 1;            /*!< [4..4] RX Event                                                           */
      __IM  uint32_t TX_RIS     : 1;            /*!< [5..5] TX Event                                                           */
      __IM  uint32_t RT_RIS     : 1;            /*!< [6..6] RX Timeout Event                                                   */
      __IM  uint32_t FE_RIS     : 1;            /*!< [7..7] Frame Error Event                                                  */
      __IM  uint32_t PE_RIS     : 1;            /*!< [8..8] Parity Error Event                                                 */
      __IM  uint32_t BE_RIS     : 1;            /*!< [9..9] BreakLine Event                                                    */
      __IM  uint32_t OE_RIS     : 1;            /*!< [10..10] Overrun FIFO_RX Event                                            */
    } RIS_b;
  } ;
  
  union {
    __IM  uint32_t MIS;                         /*!< (@ 0x00000040) Masked IQR Status Register                                 */
    
