StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VK234.h
    struct {
      __IOM uint32_t Pin_0      : 1;            /*!< [0..0] Pin data direction                                                 */
      __IOM uint32_t Pin_1      : 1;            /*!< [1..1] Pin data direction                                                 */
      __IOM uint32_t Pin_2      : 1;            /*!< [2..2] Pin data direction                                                 */
      __IOM uint32_t Pin_3      : 1;            /*!< [3..3] Pin data direction                                                 */
      __IOM uint32_t Pin_4      : 1;            /*!< [4..4] Pin data direction                                                 */
      __IOM uint32_t Pin_5      : 1;            /*!< [5..5] Pin data direction                                                 */
      __IOM uint32_t Pin_6      : 1;            /*!< [6..6] Pin data direction                                                 */
      __IOM uint32_t Pin_7      : 1;            /*!< [7..7] Pin data direction                                                 */
      __IOM uint32_t Pin_8      : 1;            /*!< [8..8] Pin data direction                                                 */
      __IOM uint32_t Pin_9      : 1;            /*!< [9..9] Pin data direction                                                 */
      __IOM uint32_t Pin_10     : 1;            /*!< [10..10] Pin data direction                                               */
      __IOM uint32_t Pin_11     : 1;            /*!< [11..11] Pin data direction                                               */
      __IOM uint32_t Pin_12     : 1;            /*!< [12..12] Pin data direction                                               */
      __IOM uint32_t Pin_13     : 1;            /*!< [13..13] Pin data direction                                               */
      __IOM uint32_t Pin_14     : 1;            /*!< [14..14] Pin data direction                                               */
      __IOM uint32_t Pin_15     : 1;            /*!< [15..15] Pin data direction                                               */
    } OE_b;
  } ;
  
  union {
    __IOM uint32_t FUNC;                        /*!< (@ 0x00000008) Pin Functions in Digital mode                              */
    
    struct {
      __IOM uint32_t Pin_0      : 2;            /*!< [1..0] Pin Digital Function                                               */
      __IOM uint32_t Pin_1      : 2;            /*!< [3..2] Pin Digital Function                                               */
      __IOM uint32_t Pin_2      : 2;            /*!< [5..4] Pin Digital Function                                               */
      __IOM uint32_t Pin_3      : 2;            /*!< [7..6] Pin Digital Function                                               */
      __IOM uint32_t Pin_4      : 2;            /*!< [9..8] Pin Digital Function                                               */
      __IOM uint32_t Pin_5      : 2;            /*!< [11..10] Pin Digital Function                                             */
      __IOM uint32_t Pin_6      : 2;            /*!< [13..12] Pin Digital Function                                             */
      __IOM uint32_t Pin_7      : 2;            /*!< [15..14] Pin Digital Function                                             */
      __IOM uint32_t Pin_8      : 2;            /*!< [17..16] Pin Digital Function                                             */
      __IOM uint32_t Pin_9      : 2;            /*!< [19..18] Pin Digital Function                                             */
      __IOM uint32_t Pin_10     : 2;            /*!< [21..20] Pin Digital Function                                             */
      __IOM uint32_t Pin_11     : 2;            /*!< [23..22] Pin Digital Function                                             */
      __IOM uint32_t Pin_12     : 2;            /*!< [25..24] Pin Digital Function                                             */
      __IOM uint32_t Pin_13     : 2;            /*!< [27..26] Pin Digital Function                                             */
      __IOM uint32_t Pin_14     : 2;            /*!< [29..28] Pin Digital Function                                             */
      __IOM uint32_t Pin_15     : 2;            /*!< [31..30] Pin Digital Function                                             */
    } FUNC_b;
  } ;
  
  union {
    __IOM uint32_t ANALOG;                      /*!< (@ 0x0000000C) Enable Digital Mode Control                                */
    
    struct {
      __IOM uint32_t Pin_0      : 1;            /*!< [0..0] Enable Digital mode                                                */
      __IOM uint32_t Pin_1      : 1;            /*!< [1..1] Enable Digital mode                                                */
      __IOM uint32_t Pin_2      : 1;            /*!< [2..2] Enable Digital mode                                                */
      __IOM uint32_t Pin_3      : 1;            /*!< [3..3] Enable Digital mode                                                */
      __IOM uint32_t Pin_4      : 1;            /*!< [4..4] Enable Digital mode                                                */
      __IOM uint32_t Pin_5      : 1;            /*!< [5..5] Enable Digital mode                                                */
      __IOM uint32_t Pin_6      : 1;            /*!< [6..6] Enable Digital mode                                                */
      __IOM uint32_t Pin_7      : 1;            /*!< [7..7] Enable Digital mode                                                */
      __IOM uint32_t Pin_8      : 1;            /*!< [8..8] Enable Digital mode                                                */
      __IOM uint32_t Pin_9      : 1;            /*!< [9..9] Enable Digital mode                                                */
      __IOM uint32_t Pin_10     : 1;            /*!< [10..10] Enable Digital mode                                              */
      __IOM uint32_t Pin_11     : 1;            /*!< [11..11] Enable Digital mode                                              */
      __IOM uint32_t Pin_12     : 1;            /*!< [12..12] Enable Digital mode                                              */
      __IOM uint32_t Pin_13     : 1;            /*!< [13..13] Enable Digital mode                                              */
      __IOM uint32_t Pin_14     : 1;            /*!< [14..14] Enable Digital mode                                              */
      __IOM uint32_t Pin_15     : 1;            /*!< [15..15] Enable Digital mode                                              */
    } ANALOG_b;
  } ;
  
  union {
    __IOM uint32_t PULL;                        /*!< (@ 0x00000010) PULL Up and Down Control                                   */
    
