StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VK234.h
    struct {
      __IOM uint32_t Down_Pin_0 : 1;            /*!< [0..0] Pull Down Enable                                                   */
      __IOM uint32_t Down_Pin_1 : 1;            /*!< [1..1] Pull Down Enable                                                   */
      __IOM uint32_t Down_Pin_2 : 1;            /*!< [2..2] Pull Down Enable                                                   */
      __IOM uint32_t Down_Pin_3 : 1;            /*!< [3..3] Pull Down Enable                                                   */
      __IOM uint32_t Down_Pin_4 : 1;            /*!< [4..4] Pull Down Enable                                                   */
      __IOM uint32_t Down_Pin_5 : 1;            /*!< [5..5] Pull Down Enable                                                   */
      __IOM uint32_t Down_Pin_6 : 1;            /*!< [6..6] Pull Down Enable                                                   */
      __IOM uint32_t Down_Pin_7 : 1;            /*!< [7..7] Pull Down Enable                                                   */
      __IOM uint32_t Down_Pin_8 : 1;            /*!< [8..8] Pull Down Enable                                                   */
      __IOM uint32_t Down_Pin_9 : 1;            /*!< [9..9] Pull Down Enable                                                   */
      __IOM uint32_t Down_Pin_10 : 1;           /*!< [10..10] Pull Down Enable                                                 */
      __IOM uint32_t Down_Pin_11 : 1;           /*!< [11..11] Pull Down Enable                                                 */
      __IOM uint32_t Down_Pin_12 : 1;           /*!< [12..12] Pull Down Enable                                                 */
      __IOM uint32_t Down_Pin_13 : 1;           /*!< [13..13] Pull Down Enable                                                 */
      __IOM uint32_t Down_Pin_14 : 1;           /*!< [14..14] Pull Down Enable                                                 */
      __IOM uint32_t Down_Pin_15 : 1;           /*!< [15..15] Pull Down Enable                                                 */
      __IOM uint32_t UP_Pin_0   : 1;            /*!< [16..16] Pull Up Enable                                                   */
      __IOM uint32_t UP_Pin_1   : 1;            /*!< [17..17] Pull Up Enable                                                   */
      __IOM uint32_t UP_Pin_2   : 1;            /*!< [18..18] Pull Up Enable                                                   */
      __IOM uint32_t UP_Pin_3   : 1;            /*!< [19..19] Pull Up Enable                                                   */
      __IOM uint32_t UP_Pin_4   : 1;            /*!< [20..20] Pull Up Enable                                                   */
      __IOM uint32_t UP_Pin_5   : 1;            /*!< [21..21] Pull Up Enable                                                   */
      __IOM uint32_t UP_Pin_6   : 1;            /*!< [22..22] Pull Up Enable                                                   */
      __IOM uint32_t UP_Pin_7   : 1;            /*!< [23..23] Pull Up Enable                                                   */
      __IOM uint32_t UP_Pin_8   : 1;            /*!< [24..24] Pull Up Enable                                                   */
      __IOM uint32_t UP_Pin_9   : 1;            /*!< [25..25] Pull Up Enable                                                   */
      __IOM uint32_t UP_Pin_10  : 1;            /*!< [26..26] Pull Up Enable                                                   */
      __IOM uint32_t UP_Pin_11  : 1;            /*!< [27..27] Pull Up Enable                                                   */
      __IOM uint32_t UP_Pin_12  : 1;            /*!< [28..28] Pull Up Enable                                                   */
      __IOM uint32_t UP_Pin_13  : 1;            /*!< [29..29] Pull Up Enable                                                   */
      __IOM uint32_t UP_Pin_14  : 1;            /*!< [30..30] Pull Up Enable                                                   */
      __IOM uint32_t UP_Pin_15  : 1;            /*!< [31..31] Pull Up Enable                                                   */
    } PULL_b;
  } ;
  
  union {
    __IOM uint32_t PD;                          /*!< (@ 0x00000014) Otput Driver Mode                                          */
    
    struct {
      __IOM uint32_t Driver_Pin_0 : 1;          /*!< [0..0] Driver mode for pin                                                */
      __IOM uint32_t Driver_Pin_1 : 1;          /*!< [1..1] Driver mode for pin                                                */
      __IOM uint32_t Driver_Pin_2 : 1;          /*!< [2..2] Driver mode for pin                                                */
      __IOM uint32_t Driver_Pin_3 : 1;          /*!< [3..3] Driver mode for pin                                                */
      __IOM uint32_t Driver_Pin_4 : 1;          /*!< [4..4] Driver mode for pin                                                */
      __IOM uint32_t Driver_Pin_5 : 1;          /*!< [5..5] Driver mode for pin                                                */
      __IOM uint32_t Driver_Pin_6 : 1;          /*!< [6..6] Driver mode for pin                                                */
      __IOM uint32_t Driver_Pin_7 : 1;          /*!< [7..7] Driver mode for pin                                                */
      __IOM uint32_t Driver_Pin_8 : 1;          /*!< [8..8] Driver mode for pin                                                */
      __IOM uint32_t Driver_Pin_9 : 1;          /*!< [9..9] Driver mode for pin                                                */
      __IOM uint32_t Driver_Pin_10 : 1;         /*!< [10..10] Driver mode for pin                                              */
      __IOM uint32_t Driver_Pin_11 : 1;         /*!< [11..11] Driver mode for pin                                              */
      __IOM uint32_t Driver_Pin_12 : 1;         /*!< [12..12] Driver mode for pin                                              */
      __IOM uint32_t Driver_Pin_13 : 1;         /*!< [13..13] Driver mode for pin                                              */
      __IOM uint32_t Driver_Pin_14 : 1;         /*!< [14..14] Driver mode for pin                                              */
      __IOM uint32_t Driver_Pin_15 : 1;         /*!< [15..15] Driver mode for pin                                              */
      __IOM uint32_t Schmitt_Pin_0 : 1;         /*!< [16..16] Schmitt trigger enable                                           */
      __IOM uint32_t Schmitt_Pin_1 : 1;         /*!< [17..17] Schmitt trigger enable                                           */
      __IOM uint32_t Schmitt_Pin_2 : 1;         /*!< [18..18] Schmitt trigger enable                                           */
      __IOM uint32_t Schmitt_Pin_3 : 1;         /*!< [19..19] Schmitt trigger enable                                           */
      __IOM uint32_t Schmitt_Pin_4 : 1;         /*!< [20..20] Schmitt trigger enable                                           */
      __IOM uint32_t Schmitt_Pin_5 : 1;         /*!< [21..21] Schmitt trigger enable                                           */
      __IOM uint32_t Schmitt_Pin_6 : 1;         /*!< [22..22] Schmitt trigger enable                                           */
      __IOM uint32_t Schmitt_Pin_7 : 1;         /*!< [23..23] Schmitt trigger enable                                           */
      __IOM uint32_t Schmitt_Pin_8 : 1;         /*!< [24..24] Schmitt trigger enable                                           */
      __IOM uint32_t Schmitt_Pin_9 : 1;         /*!< [25..25] Schmitt trigger enable                                           */
      __IOM uint32_t Schmitt_Pin_10 : 1;        /*!< [26..26] Schmitt trigger enable                                           */
      __IOM uint32_t Schmitt_Pin_11 : 1;        /*!< [27..27] Schmitt trigger enable                                           */
      __IOM uint32_t Schmitt_Pin_12 : 1;        /*!< [28..28] Schmitt trigger enable                                           */
      __IOM uint32_t Schmitt_Pin_13 : 1;        /*!< [29..29] Schmitt trigger enable                                           */
      __IOM uint32_t Schmitt_Pin_14 : 1;        /*!< [30..30] Schmitt trigger enable                                           */
      __IOM uint32_t Schmitt_Pin_15 : 1;        /*!< [31..31] Schmitt trigger enable                                           */
    } PD_b;
  } ;
  
  union {
    __IOM uint32_t PWR;                         /*!< (@ 0x00000018) Output voltage switch rate                                 */
    
