StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VK234.h
    struct {
      __IOM uint32_t Pin_0      : 2;            /*!< [1..0] Voltage levels switch rate                                         */
      __IOM uint32_t Pin_1      : 2;            /*!< [3..2] Voltage levels switch rate                                         */
      __IOM uint32_t Pin_2      : 2;            /*!< [5..4] Voltage levels switch rate                                         */
      __IOM uint32_t Pin_3      : 2;            /*!< [7..6] Voltage levels switch rate                                         */
      __IOM uint32_t Pin_4      : 2;            /*!< [9..8] Voltage levels switch rate                                         */
      __IOM uint32_t Pin_5      : 2;            /*!< [11..10] Voltage levels switch rate                                       */
      __IOM uint32_t Pin_6      : 2;            /*!< [13..12] Voltage levels switch rate                                       */
      __IOM uint32_t Pin_7      : 2;            /*!< [15..14] Voltage levels switch rate                                       */
      __IOM uint32_t Pin_8      : 2;            /*!< [17..16] Voltage levels switch rate                                       */
      __IOM uint32_t Pin_9      : 2;            /*!< [19..18] Voltage levels switch rate                                       */
      __IOM uint32_t Pin_10     : 2;            /*!< [21..20] Voltage levels switch rate                                       */
      __IOM uint32_t Pin_11     : 2;            /*!< [23..22] Voltage levels switch rate                                       */
      __IOM uint32_t Pin_12     : 2;            /*!< [25..24] Voltage levels switch rate                                       */
      __IOM uint32_t Pin_13     : 2;            /*!< [27..26] Voltage levels switch rate                                       */
      __IOM uint32_t Pin_14     : 2;            /*!< [29..28] Voltage levels switch rate                                       */
      __IOM uint32_t Pin_15     : 2;            /*!< [31..30] Voltage levels switch rate                                       */
    } PWR_b;
  } ;
  
  union {
    __IOM uint32_t GFEN;                        /*!< (@ 0x0000001C) Input pulses filter                                        */
    
    struct {
      __IOM uint32_t Pin_0      : 1;            /*!< [0..0] Filter for pin                                                     */
      __IOM uint32_t Pin_1      : 1;            /*!< [1..1] Filter for pin                                                     */
      __IOM uint32_t Pin_2      : 1;            /*!< [2..2] Filter for pin                                                     */
      __IOM uint32_t Pin_3      : 1;            /*!< [3..3] Filter for pin                                                     */
      __IOM uint32_t Pin_4      : 1;            /*!< [4..4] Filter for pin                                                     */
      __IOM uint32_t Pin_5      : 1;            /*!< [5..5] Filter for pin                                                     */
      __IOM uint32_t Pin_6      : 1;            /*!< [6..6] Filter for pin                                                     */
      __IOM uint32_t Pin_7      : 1;            /*!< [7..7] Filter for pin                                                     */
      __IOM uint32_t Pin_8      : 1;            /*!< [8..8] Filter for pin                                                     */
      __IOM uint32_t Pin_9      : 1;            /*!< [9..9] Filter for pin                                                     */
      __IOM uint32_t Pin_10     : 1;            /*!< [10..10] Filter for pin                                                   */
      __IOM uint32_t Pin_11     : 1;            /*!< [11..11] Filter for pin                                                   */
      __IOM uint32_t Pin_12     : 1;            /*!< [12..12] Filter for pin                                                   */
      __IOM uint32_t Pin_13     : 1;            /*!< [13..13] Filter for pin                                                   */
      __IOM uint32_t Pin_14     : 1;            /*!< [14..14] Filter for pin                                                   */
      __IOM uint32_t Pin_15     : 1;            /*!< [15..15] Filter for pin                                                   */
    } GFEN_b;
  } ;
} MDR_PORTA_Type;                               /*!< Size = 32 (0x20)                                                          */


/** @} */ /* End of group Device_Peripheral_peripherals */


/* =========================================================================================================================== */
/* ================                          Device Specific Peripheral Address Map                           ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripheralAddr
  * @{
  */

#define MDR_EEPROM_BASE             0x40018000UL
#define MDR_RST_CLOCK_BASE          0x40020000UL
#define MDR_WWDT_BASE               0x40048000UL
#define MDR_IWDT_BASE               0x40050000UL
#define MDR_ADC_BASE                0x40040000UL
#define MDR_BKP_BASE                0x40060000UL
#define MDR_ADCUI_BASE              0x40068000UL
#define MDR_UART1_BASE              0x40008000UL
#define MDR_UART2_BASE              0x40010000UL
#define MDR_PORTA_BASE              0x40080000UL
#define MDR_PORTB_BASE              0x40088000UL
#define MDR_PORTC_BASE              0x40090000UL

/** @} */ /* End of group Device_Peripheral_peripheralAddr */


/* =========================================================================================================================== */
/* ================                                  Peripheral declaration                                   ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_declaration
  * @{
  */

#define MDR_EEPROM                  ((MDR_EEPROM_Type*)        MDR_EEPROM_BASE)
#define MDR_RST_CLOCK               ((MDR_RST_CLOCK_Type*)     MDR_RST_CLOCK_BASE)
#define MDR_WWDT                    ((MDR_WWDT_Type*)          MDR_WWDT_BASE)
#define MDR_IWDT                    ((MDR_IWDT_Type*)          MDR_IWDT_BASE)
#define MDR_ADC                     ((MDR_ADC_Type*)           MDR_ADC_BASE)
#define MDR_BKP                     ((MDR_BKP_Type*)           MDR_BKP_BASE)
#define MDR_ADCUI                   ((MDR_ADCUI_Type*)         MDR_ADCUI_BASE)
#define MDR_UART1                   ((MDR_UART1_Type*)         MDR_UART1_BASE)
#define MDR_UART2                   ((MDR_UART1_Type*)         MDR_UART2_BASE)
#define MDR_PORTA                   ((MDR_PORTA_Type*)         MDR_PORTA_BASE)
#define MDR_PORTB                   ((MDR_PORTA_Type*)         MDR_PORTB_BASE)
#define MDR_PORTC                   ((MDR_PORTA_Type*)         MDR_PORTC_BASE)

