StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VK234.h
/* ==========================================================  KR  =========================================================== */
#define MDR_IWDT_KR_KEY_Pos               (0UL)                     /*!< MDR_IWDT KR: KEY (Bit 0)                              */
#define MDR_IWDT_KR_KEY_Msk               (0xffffUL)                /*!< MDR_IWDT KR: KEY (Bitfield-Mask: 0xffff)              */
/* ==========================================================  PR  =========================================================== */
#define MDR_IWDT_PR_PR_Pos                (0UL)                     /*!< MDR_IWDT PR: PR (Bit 0)                               */
#define MDR_IWDT_PR_PR_Msk                (0x7UL)                   /*!< MDR_IWDT PR: PR (Bitfield-Mask: 0x07)                 */
/* ==========================================================  RLR  ========================================================== */
#define MDR_IWDT_RLR_PRL_Pos              (0UL)                     /*!< MDR_IWDT RLR: PRL (Bit 0)                             */
#define MDR_IWDT_RLR_PRL_Msk              (0xfffUL)                 /*!< MDR_IWDT RLR: PRL (Bitfield-Mask: 0xfff)              */
/* ==========================================================  SR  =========================================================== */
#define MDR_IWDT_SR_PVU_Pos               (0UL)                     /*!< MDR_IWDT SR: PVU (Bit 0)                              */
#define MDR_IWDT_SR_PVU_Msk               (0x1UL)                   /*!< MDR_IWDT SR: PVU (Bitfield-Mask: 0x01)                */
#define MDR_IWDT_SR_RVU_Pos               (1UL)                     /*!< MDR_IWDT SR: RVU (Bit 1)                              */
#define MDR_IWDT_SR_RVU_Msk               (0x2UL)                   /*!< MDR_IWDT SR: RVU (Bitfield-Mask: 0x01)                */


/* =========================================================================================================================== */
/* ================                                          MDR_ADC                                          ================ */
/* =========================================================================================================================== */

/* =======================================================  ADC1_Cfg  ======================================================== */
#define MDR_ADC_ADC1_Cfg_ADON_Pos         (0UL)                     /*!< MDR_ADC ADC1_Cfg: ADON (Bit 0)                        */
#define MDR_ADC_ADC1_Cfg_ADON_Msk         (0x1UL)                   /*!< MDR_ADC ADC1_Cfg: ADON (Bitfield-Mask: 0x01)          */
#define MDR_ADC_ADC1_Cfg_GO_Pos           (1UL)                     /*!< MDR_ADC ADC1_Cfg: GO (Bit 1)                          */
#define MDR_ADC_ADC1_Cfg_GO_Msk           (0x2UL)                   /*!< MDR_ADC ADC1_Cfg: GO (Bitfield-Mask: 0x01)            */
#define MDR_ADC_ADC1_Cfg_CLKS_Pos         (2UL)                     /*!< MDR_ADC ADC1_Cfg: CLKS (Bit 2)                        */
#define MDR_ADC_ADC1_Cfg_CLKS_Msk         (0x4UL)                   /*!< MDR_ADC ADC1_Cfg: CLKS (Bitfield-Mask: 0x01)          */
#define MDR_ADC_ADC1_Cfg_SAMPLE_Pos       (3UL)                     /*!< MDR_ADC ADC1_Cfg: SAMPLE (Bit 3)                      */
#define MDR_ADC_ADC1_Cfg_SAMPLE_Msk       (0x8UL)                   /*!< MDR_ADC ADC1_Cfg: SAMPLE (Bitfield-Mask: 0x01)        */
#define MDR_ADC_ADC1_Cfg_CHS_Pos          (4UL)                     /*!< MDR_ADC ADC1_Cfg: CHS (Bit 4)                         */
#define MDR_ADC_ADC1_Cfg_CHS_Msk          (0x1f0UL)                 /*!< MDR_ADC ADC1_Cfg: CHS (Bitfield-Mask: 0x1f)           */
#define MDR_ADC_ADC1_Cfg_CHCH_Pos         (9UL)                     /*!< MDR_ADC ADC1_Cfg: CHCH (Bit 9)                        */
#define MDR_ADC_ADC1_Cfg_CHCH_Msk         (0x200UL)                 /*!< MDR_ADC ADC1_Cfg: CHCH (Bitfield-Mask: 0x01)          */
#define MDR_ADC_ADC1_Cfg_RGNC_Pos         (10UL)                    /*!< MDR_ADC ADC1_Cfg: RGNC (Bit 10)                       */
#define MDR_ADC_ADC1_Cfg_RGNC_Msk         (0x400UL)                 /*!< MDR_ADC ADC1_Cfg: RGNC (Bitfield-Mask: 0x01)          */
#define MDR_ADC_ADC1_Cfg_M_REF_Pos        (11UL)                    /*!< MDR_ADC ADC1_Cfg: M_REF (Bit 11)                      */
#define MDR_ADC_ADC1_Cfg_M_REF_Msk        (0x800UL)                 /*!< MDR_ADC ADC1_Cfg: M_REF (Bitfield-Mask: 0x01)         */
#define MDR_ADC_ADC1_Cfg_DIV_CLK_Pos      (12UL)                    /*!< MDR_ADC ADC1_Cfg: DIV_CLK (Bit 12)                    */
#define MDR_ADC_ADC1_Cfg_DIV_CLK_Msk      (0xf000UL)                /*!< MDR_ADC ADC1_Cfg: DIV_CLK (Bitfield-Mask: 0x0f)       */
#define MDR_ADC_ADC1_Cfg_TS_EN_Pos        (17UL)                    /*!< MDR_ADC ADC1_Cfg: TS_EN (Bit 17)                      */
#define MDR_ADC_ADC1_Cfg_TS_EN_Msk        (0x20000UL)               /*!< MDR_ADC ADC1_Cfg: TS_EN (Bitfield-Mask: 0x01)         */
#define MDR_ADC_ADC1_Cfg_TS_BUFF_EN_Pos   (18UL)                    /*!< MDR_ADC ADC1_Cfg: TS_BUFF_EN (Bit 18)                 */
#define MDR_ADC_ADC1_Cfg_TS_BUFF_EN_Msk   (0x40000UL)               /*!< MDR_ADC ADC1_Cfg: TS_BUFF_EN (Bitfield-Mask: 0x01)    */
#define MDR_ADC_ADC1_Cfg_SEL_TS_Pos       (19UL)                    /*!< MDR_ADC ADC1_Cfg: SEL_TS (Bit 19)                     */
#define MDR_ADC_ADC1_Cfg_SEL_TS_Msk       (0x80000UL)               /*!< MDR_ADC ADC1_Cfg: SEL_TS (Bitfield-Mask: 0x01)        */
#define MDR_ADC_ADC1_Cfg_SEL_VREF_Pos     (20UL)                    /*!< MDR_ADC ADC1_Cfg: SEL_VREF (Bit 20)                   */
#define MDR_ADC_ADC1_Cfg_SEL_VREF_Msk     (0x100000UL)              /*!< MDR_ADC ADC1_Cfg: SEL_VREF (Bitfield-Mask: 0x01)      */
#define MDR_ADC_ADC1_Cfg_Delay_GO_Pos     (25UL)                    /*!< MDR_ADC ADC1_Cfg: Delay_GO (Bit 25)                   */
#define MDR_ADC_ADC1_Cfg_Delay_GO_Msk     (0xe000000UL)             /*!< MDR_ADC ADC1_Cfg: Delay_GO (Bitfield-Mask: 0x07)      */
/* =======================================================  ADC2_Cfg  ======================================================== */
#define MDR_ADC_ADC2_Cfg_ADC1_OP_Pos      (17UL)                    /*!< MDR_ADC ADC2_Cfg: ADC1_OP (Bit 17)                    */
#define MDR_ADC_ADC2_Cfg_ADC1_OP_Msk      (0x20000UL)               /*!< MDR_ADC ADC2_Cfg: ADC1_OP (Bitfield-Mask: 0x01)       */
/* =====================================================  ADC1_H_Level  ====================================================== */
#define MDR_ADC_ADC1_H_Level_Level_Pos    (0UL)                     /*!< MDR_ADC ADC1_H_Level: Level (Bit 0)                   */
#define MDR_ADC_ADC1_H_Level_Level_Msk    (0xfffUL)                 /*!< MDR_ADC ADC1_H_Level: Level (Bitfield-Mask: 0xfff)    */
/* =====================================================  ADC1_L_Level  ====================================================== */
#define MDR_ADC_ADC1_L_Level_Level_Pos    (0UL)                     /*!< MDR_ADC ADC1_L_Level: Level (Bit 0)                   */
#define MDR_ADC_ADC1_L_Level_Level_Msk    (0xfffUL)                 /*!< MDR_ADC ADC1_L_Level: Level (Bitfield-Mask: 0xfff)    */
/* ======================================================  ADC1_RESULT  ====================================================== */
#define MDR_ADC_ADC1_RESULT_Value_Pos     (0UL)                     /*!< MDR_ADC ADC1_RESULT: Value (Bit 0)                    */
#define MDR_ADC_ADC1_RESULT_Value_Msk     (0xfffUL)                 /*!< MDR_ADC ADC1_RESULT: Value (Bitfield-Mask: 0xfff)     */
#define MDR_ADC_ADC1_RESULT_Channel_Pos   (16UL)                    /*!< MDR_ADC ADC1_RESULT: Channel (Bit 16)                 */
#define MDR_ADC_ADC1_RESULT_Channel_Msk   (0x1f0000UL)              /*!< MDR_ADC ADC1_RESULT: Channel (Bitfield-Mask: 0x1f)    */
/* ======================================================  ADC1_STATUS  ====================================================== */
#define MDR_ADC_ADC1_STATUS_Overwrite_Pos (0UL)                     /*!< MDR_ADC ADC1_STATUS: Overwrite (Bit 0)                */
#define MDR_ADC_ADC1_STATUS_Overwrite_Msk (0x1UL)                   /*!< MDR_ADC ADC1_STATUS: Overwrite (Bitfield-Mask: 0x01)  */
#define MDR_ADC_ADC1_STATUS_AWOIFEN_Pos   (1UL)                     /*!< MDR_ADC ADC1_STATUS: AWOIFEN (Bit 1)                  */
#define MDR_ADC_ADC1_STATUS_AWOIFEN_Msk   (0x2UL)                   /*!< MDR_ADC ADC1_STATUS: AWOIFEN (Bitfield-Mask: 0x01)    */
#define MDR_ADC_ADC1_STATUS_EOCIF_Pos     (2UL)                     /*!< MDR_ADC ADC1_STATUS: EOCIF (Bit 2)                    */
#define MDR_ADC_ADC1_STATUS_EOCIF_Msk     (0x4UL)                   /*!< MDR_ADC ADC1_STATUS: EOCIF (Bitfield-Mask: 0x01)      */
#define MDR_ADC_ADC1_STATUS_AWOIF_IE_Pos  (3UL)                     /*!< MDR_ADC ADC1_STATUS: AWOIF_IE (Bit 3)                 */
#define MDR_ADC_ADC1_STATUS_AWOIF_IE_Msk  (0x8UL)                   /*!< MDR_ADC ADC1_STATUS: AWOIF_IE (Bitfield-Mask: 0x01)   */
#define MDR_ADC_ADC1_STATUS_EOCIF_EN_Pos  (4UL)                     /*!< MDR_ADC ADC1_STATUS: EOCIF_EN (Bit 4)                 */
#define MDR_ADC_ADC1_STATUS_EOCIF_EN_Msk  (0x10UL)                  /*!< MDR_ADC ADC1_STATUS: EOCIF_EN (Bitfield-Mask: 0x01)   */
/* ======================================================  ADC1_CHSEL  ======================================================= */
#define MDR_ADC_ADC1_CHSEL_Channel_0_Pos  (0UL)                     /*!< MDR_ADC ADC1_CHSEL: Channel_0 (Bit 0)                 */
#define MDR_ADC_ADC1_CHSEL_Channel_0_Msk  (0x1UL)                   /*!< MDR_ADC ADC1_CHSEL: Channel_0 (Bitfield-Mask: 0x01)   */
#define MDR_ADC_ADC1_CHSEL_Channel_1_Pos  (1UL)                     /*!< MDR_ADC ADC1_CHSEL: Channel_1 (Bit 1)                 */
#define MDR_ADC_ADC1_CHSEL_Channel_1_Msk  (0x2UL)                   /*!< MDR_ADC ADC1_CHSEL: Channel_1 (Bitfield-Mask: 0x01)   */
#define MDR_ADC_ADC1_CHSEL_Channel_2_Pos  (2UL)                     /*!< MDR_ADC ADC1_CHSEL: Channel_2 (Bit 2)                 */
#define MDR_ADC_ADC1_CHSEL_Channel_2_Msk  (0x4UL)                   /*!< MDR_ADC ADC1_CHSEL: Channel_2 (Bitfield-Mask: 0x01)   */
#define MDR_ADC_ADC1_CHSEL_Channel_3_Pos  (3UL)                     /*!< MDR_ADC ADC1_CHSEL: Channel_3 (Bit 3)                 */
#define MDR_ADC_ADC1_CHSEL_Channel_3_Msk  (0x8UL)                   /*!< MDR_ADC ADC1_CHSEL: Channel_3 (Bitfield-Mask: 0x01)   */
#define MDR_ADC_ADC1_CHSEL_Channel_4_Pos  (4UL)                     /*!< MDR_ADC ADC1_CHSEL: Channel_4 (Bit 4)                 */
#define MDR_ADC_ADC1_CHSEL_Channel_4_Msk  (0x10UL)                  /*!< MDR_ADC ADC1_CHSEL: Channel_4 (Bitfield-Mask: 0x01)   */
#define MDR_ADC_ADC1_CHSEL_Channel_5_Pos  (5UL)                     /*!< MDR_ADC ADC1_CHSEL: Channel_5 (Bit 5)                 */
#define MDR_ADC_ADC1_CHSEL_Channel_5_Msk  (0x20UL)                  /*!< MDR_ADC ADC1_CHSEL: Channel_5 (Bitfield-Mask: 0x01)   */
#define MDR_ADC_ADC1_CHSEL_Channel_6_Pos  (6UL)                     /*!< MDR_ADC ADC1_CHSEL: Channel_6 (Bit 6)                 */
#define MDR_ADC_ADC1_CHSEL_Channel_6_Msk  (0x40UL)                  /*!< MDR_ADC ADC1_CHSEL: Channel_6 (Bitfield-Mask: 0x01)   */
#define MDR_ADC_ADC1_CHSEL_Channel_7_Pos  (7UL)                     /*!< MDR_ADC ADC1_CHSEL: Channel_7 (Bit 7)                 */
#define MDR_ADC_ADC1_CHSEL_Channel_7_Msk  (0x80UL)                  /*!< MDR_ADC ADC1_CHSEL: Channel_7 (Bitfield-Mask: 0x01)   */
#define MDR_ADC_ADC1_CHSEL_Channel_30_Pos (30UL)                    /*!< MDR_ADC ADC1_CHSEL: Channel_30 (Bit 30)               */
#define MDR_ADC_ADC1_CHSEL_Channel_30_Msk (0x40000000UL)            /*!< MDR_ADC ADC1_CHSEL: Channel_30 (Bitfield-Mask: 0x01)  */
#define MDR_ADC_ADC1_CHSEL_Channel_31_Pos (31UL)                    /*!< MDR_ADC ADC1_CHSEL: Channel_31 (Bit 31)               */
#define MDR_ADC_ADC1_CHSEL_Channel_31_Msk (0x80000000UL)            /*!< MDR_ADC ADC1_CHSEL: Channel_31 (Bitfield-Mask: 0x01)  */
/* =======================================================  ADC1_TRIM  ======================================================= */
#define MDR_ADC_ADC1_TRIM_TS_Trim_Pos     (1UL)                     /*!< MDR_ADC ADC1_TRIM: TS_Trim (Bit 1)                    */
#define MDR_ADC_ADC1_TRIM_TS_Trim_Msk     (0x3eUL)                  /*!< MDR_ADC ADC1_TRIM: TS_Trim (Bitfield-Mask: 0x1f)      */
#define MDR_ADC_ADC1_TRIM_SEL_VREF_BUF_Pos (6UL)                    /*!< MDR_ADC ADC1_TRIM: SEL_VREF_BUF (Bit 6)               */
#define MDR_ADC_ADC1_TRIM_SEL_VREF_BUF_Msk (0x40UL)                 /*!< MDR_ADC ADC1_TRIM: SEL_VREF_BUF (Bitfield-Mask: 0x01) */


/* =========================================================================================================================== */
/* ================                                          MDR_BKP                                          ================ */
/* =========================================================================================================================== */

/* =========================================================  REG_0  ========================================================= */
/* ========================================================  REG_0E  ========================================================= */
#define MDR_BKP_REG_0E_LOW_Pos            (0UL)                     /*!< MDR_BKP REG_0E: LOW (Bit 0)                           */
#define MDR_BKP_REG_0E_LOW_Msk            (0x7UL)                   /*!< MDR_BKP REG_0E: LOW (Bitfield-Mask: 0x07)             */
#define MDR_BKP_REG_0E_SelectRI_Pos       (3UL)                     /*!< MDR_BKP REG_0E: SelectRI (Bit 3)                      */
#define MDR_BKP_REG_0E_SelectRI_Msk       (0x38UL)                  /*!< MDR_BKP REG_0E: SelectRI (Bitfield-Mask: 0x07)        */
#define MDR_BKP_REG_0E_Jtag_A_Pos         (6UL)                     /*!< MDR_BKP REG_0E: Jtag_A (Bit 6)                        */
#define MDR_BKP_REG_0E_Jtag_A_Msk         (0x40UL)                  /*!< MDR_BKP REG_0E: Jtag_A (Bitfield-Mask: 0x01)          */
#define MDR_BKP_REG_0E_Jtag_B_Pos         (7UL)                     /*!< MDR_BKP REG_0E: Jtag_B (Bit 7)                        */
#define MDR_BKP_REG_0E_Jtag_B_Msk         (0x80UL)                  /*!< MDR_BKP REG_0E: Jtag_B (Bitfield-Mask: 0x01)          */
#define MDR_BKP_REG_0E_Trim_dDUcc_Pos     (8UL)                     /*!< MDR_BKP REG_0E: Trim_dDUcc (Bit 8)                    */
#define MDR_BKP_REG_0E_Trim_dDUcc_Msk     (0x700UL)                 /*!< MDR_BKP REG_0E: Trim_dDUcc (Bitfield-Mask: 0x07)      */
#define MDR_BKP_REG_0E_FPOR_Pos           (11UL)                    /*!< MDR_BKP REG_0E: FPOR (Bit 11)                         */
#define MDR_BKP_REG_0E_FPOR_Msk           (0x800UL)                 /*!< MDR_BKP REG_0E: FPOR (Bitfield-Mask: 0x01)            */
#define MDR_BKP_REG_0E_Trim_DUcc_Pos      (12UL)                    /*!< MDR_BKP REG_0E: Trim_DUcc (Bit 12)                    */
#define MDR_BKP_REG_0E_Trim_DUcc_Msk      (0x3000UL)                /*!< MDR_BKP REG_0E: Trim_DUcc (Bitfield-Mask: 0x03)       */
#define MDR_BKP_REG_0E_COVDET_Pos         (14UL)                    /*!< MDR_BKP REG_0E: COVDET (Bit 14)                       */
#define MDR_BKP_REG_0E_COVDET_Msk         (0x4000UL)                /*!< MDR_BKP REG_0E: COVDET (Bitfield-Mask: 0x01)          */
#define MDR_BKP_REG_0E_I_LimEn_Pos        (15UL)                    /*!< MDR_BKP REG_0E: I_LimEn (Bit 15)                      */
#define MDR_BKP_REG_0E_I_LimEn_Msk        (0x8000UL)                /*!< MDR_BKP REG_0E: I_LimEn (Bitfield-Mask: 0x01)         */
/* ========================================================  REG_0F  ========================================================= */
#define MDR_BKP_REG_0F_LSE_ON_Pos         (0UL)                     /*!< MDR_BKP REG_0F: LSE_ON (Bit 0)                        */
#define MDR_BKP_REG_0F_LSE_ON_Msk         (0x1UL)                   /*!< MDR_BKP REG_0F: LSE_ON (Bitfield-Mask: 0x01)          */
#define MDR_BKP_REG_0F_LSE_BYP_Pos        (1UL)                     /*!< MDR_BKP REG_0F: LSE_BYP (Bit 1)                       */
#define MDR_BKP_REG_0F_LSE_BYP_Msk        (0x2UL)                   /*!< MDR_BKP REG_0F: LSE_BYP (Bitfield-Mask: 0x01)         */
#define MDR_BKP_REG_0F_RTC_SEL_Pos        (2UL)                     /*!< MDR_BKP REG_0F: RTC_SEL (Bit 2)                       */
#define MDR_BKP_REG_0F_RTC_SEL_Msk        (0xcUL)                   /*!< MDR_BKP REG_0F: RTC_SEL (Bitfield-Mask: 0x03)         */
#define MDR_BKP_REG_0F_RTC_EN_Pos         (4UL)                     /*!< MDR_BKP REG_0F: RTC_EN (Bit 4)                        */
#define MDR_BKP_REG_0F_RTC_EN_Msk         (0x10UL)                  /*!< MDR_BKP REG_0F: RTC_EN (Bitfield-Mask: 0x01)          */
#define MDR_BKP_REG_0F_RTC_CAL_Pos        (5UL)                     /*!< MDR_BKP REG_0F: RTC_CAL (Bit 5)                       */
#define MDR_BKP_REG_0F_RTC_CAL_Msk        (0x1fe0UL)                /*!< MDR_BKP REG_0F: RTC_CAL (Bitfield-Mask: 0xff)         */
#define MDR_BKP_REG_0F_LSE_RDY_Pos        (13UL)                    /*!< MDR_BKP REG_0F: LSE_RDY (Bit 13)                      */
#define MDR_BKP_REG_0F_LSE_RDY_Msk        (0x2000UL)                /*!< MDR_BKP REG_0F: LSE_RDY (Bitfield-Mask: 0x01)         */
#define MDR_BKP_REG_0F_LSI_ON_Pos         (15UL)                    /*!< MDR_BKP REG_0F: LSI_ON (Bit 15)                       */
#define MDR_BKP_REG_0F_LSI_ON_Msk         (0x8000UL)                /*!< MDR_BKP REG_0F: LSI_ON (Bitfield-Mask: 0x01)          */
#define MDR_BKP_REG_0F_LSI_TRIM_Pos       (16UL)                    /*!< MDR_BKP REG_0F: LSI_TRIM (Bit 16)                     */
#define MDR_BKP_REG_0F_LSI_TRIM_Msk       (0x1f0000UL)              /*!< MDR_BKP REG_0F: LSI_TRIM (Bitfield-Mask: 0x1f)        */
#define MDR_BKP_REG_0F_LSI_RDY_Pos        (21UL)                    /*!< MDR_BKP REG_0F: LSI_RDY (Bit 21)                      */
#define MDR_BKP_REG_0F_LSI_RDY_Msk        (0x200000UL)              /*!< MDR_BKP REG_0F: LSI_RDY (Bitfield-Mask: 0x01)         */
#define MDR_BKP_REG_0F_HSI_ON_Pos         (22UL)                    /*!< MDR_BKP REG_0F: HSI_ON (Bit 22)                       */
#define MDR_BKP_REG_0F_HSI_ON_Msk         (0x400000UL)              /*!< MDR_BKP REG_0F: HSI_ON (Bitfield-Mask: 0x01)          */
#define MDR_BKP_REG_0F_HSI_RDY_Pos        (23UL)                    /*!< MDR_BKP REG_0F: HSI_RDY (Bit 23)                      */
#define MDR_BKP_REG_0F_HSI_RDY_Msk        (0x800000UL)              /*!< MDR_BKP REG_0F: HSI_RDY (Bitfield-Mask: 0x01)         */
#define MDR_BKP_REG_0F_HSI_TRIM_Pos       (24UL)                    /*!< MDR_BKP REG_0F: HSI_TRIM (Bit 24)                     */
#define MDR_BKP_REG_0F_HSI_TRIM_Msk       (0x3f000000UL)            /*!< MDR_BKP REG_0F: HSI_TRIM (Bitfield-Mask: 0x3f)        */
#define MDR_BKP_REG_0F_Standby_Pos        (30UL)                    /*!< MDR_BKP REG_0F: Standby (Bit 30)                      */
#define MDR_BKP_REG_0F_Standby_Msk        (0x40000000UL)            /*!< MDR_BKP REG_0F: Standby (Bitfield-Mask: 0x01)         */
#define MDR_BKP_REG_0F_RTC_RESET_Pos      (31UL)                    /*!< MDR_BKP REG_0F: RTC_RESET (Bit 31)                    */
#define MDR_BKP_REG_0F_RTC_RESET_Msk      (0x80000000UL)            /*!< MDR_BKP REG_0F: RTC_RESET (Bitfield-Mask: 0x01)       */
/* ========================================================  RTC_CNT  ======================================================== */
/* ========================================================  RTC_DIV  ======================================================== */
#define MDR_BKP_RTC_DIV_Value_Pos         (0UL)                     /*!< MDR_BKP RTC_DIV: Value (Bit 0)                        */
#define MDR_BKP_RTC_DIV_Value_Msk         (0xfffffUL)               /*!< MDR_BKP RTC_DIV: Value (Bitfield-Mask: 0xfffff)       */
/* ========================================================  RTC_PRL  ======================================================== */
#define MDR_BKP_RTC_PRL_Value_Pos         (0UL)                     /*!< MDR_BKP RTC_PRL: Value (Bit 0)                        */
#define MDR_BKP_RTC_PRL_Value_Msk         (0xfffffUL)               /*!< MDR_BKP RTC_PRL: Value (Bitfield-Mask: 0xfffff)       */
/* =======================================================  RTC_ALRM  ======================================================== */
#define MDR_BKP_RTC_ALRM_Value_Pos        (0UL)                     /*!< MDR_BKP RTC_ALRM: Value (Bit 0)                       */
#define MDR_BKP_RTC_ALRM_Value_Msk        (0xffffffffUL)            /*!< MDR_BKP RTC_ALRM: Value (Bitfield-Mask: 0xffffffff)   */
/* ========================================================  RTC_CS  ========================================================= */
#define MDR_BKP_RTC_CS_OWF_Pos            (0UL)                     /*!< MDR_BKP RTC_CS: OWF (Bit 0)                           */
#define MDR_BKP_RTC_CS_OWF_Msk            (0x1UL)                   /*!< MDR_BKP RTC_CS: OWF (Bitfield-Mask: 0x01)             */
#define MDR_BKP_RTC_CS_SECF_Pos           (1UL)                     /*!< MDR_BKP RTC_CS: SECF (Bit 1)                          */
#define MDR_BKP_RTC_CS_SECF_Msk           (0x2UL)                   /*!< MDR_BKP RTC_CS: SECF (Bitfield-Mask: 0x01)            */
#define MDR_BKP_RTC_CS_ALRF_Pos           (2UL)                     /*!< MDR_BKP RTC_CS: ALRF (Bit 2)                          */
#define MDR_BKP_RTC_CS_ALRF_Msk           (0x4UL)                   /*!< MDR_BKP RTC_CS: ALRF (Bitfield-Mask: 0x01)            */
#define MDR_BKP_RTC_CS_OWF_IE_Pos         (3UL)                     /*!< MDR_BKP RTC_CS: OWF_IE (Bit 3)                        */
#define MDR_BKP_RTC_CS_OWF_IE_Msk         (0x8UL)                   /*!< MDR_BKP RTC_CS: OWF_IE (Bitfield-Mask: 0x01)          */
#define MDR_BKP_RTC_CS_SECF_IE_Pos        (4UL)                     /*!< MDR_BKP RTC_CS: SECF_IE (Bit 4)                       */
#define MDR_BKP_RTC_CS_SECF_IE_Msk        (0x10UL)                  /*!< MDR_BKP RTC_CS: SECF_IE (Bitfield-Mask: 0x01)         */
#define MDR_BKP_RTC_CS_ALRF_IE_Pos        (5UL)                     /*!< MDR_BKP RTC_CS: ALRF_IE (Bit 5)                       */
#define MDR_BKP_RTC_CS_ALRF_IE_Msk        (0x20UL)                  /*!< MDR_BKP RTC_CS: ALRF_IE (Bitfield-Mask: 0x01)         */
#define MDR_BKP_RTC_CS_WEC_Pos            (6UL)                     /*!< MDR_BKP RTC_CS: WEC (Bit 6)                           */
#define MDR_BKP_RTC_CS_WEC_Msk            (0x40UL)                  /*!< MDR_BKP RTC_CS: WEC (Bitfield-Mask: 0x01)             */


/* =========================================================================================================================== */
/* ================                                         MDR_ADCUI                                         ================ */
/* =========================================================================================================================== */

