StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VK234.h
/* =========================================================  CTRL1  ========================================================= */
#define MDR_ADCUI_CTRL1_I0EN_Pos          (0UL)                     /*!< MDR_ADCUI CTRL1: I0EN (Bit 0)                         */
#define MDR_ADCUI_CTRL1_I0EN_Msk          (0x1UL)                   /*!< MDR_ADCUI CTRL1: I0EN (Bitfield-Mask: 0x01)           */
#define MDR_ADCUI_CTRL1_V0EN_Pos          (1UL)                     /*!< MDR_ADCUI CTRL1: V0EN (Bit 1)                         */
#define MDR_ADCUI_CTRL1_V0EN_Msk          (0x2UL)                   /*!< MDR_ADCUI CTRL1: V0EN (Bitfield-Mask: 0x01)           */
#define MDR_ADCUI_CTRL1_I1EN_Pos          (2UL)                     /*!< MDR_ADCUI CTRL1: I1EN (Bit 2)                         */
#define MDR_ADCUI_CTRL1_I1EN_Msk          (0x4UL)                   /*!< MDR_ADCUI CTRL1: I1EN (Bitfield-Mask: 0x01)           */
#define MDR_ADCUI_CTRL1_V1EN_Pos          (3UL)                     /*!< MDR_ADCUI CTRL1: V1EN (Bit 3)                         */
#define MDR_ADCUI_CTRL1_V1EN_Msk          (0x8UL)                   /*!< MDR_ADCUI CTRL1: V1EN (Bitfield-Mask: 0x01)           */
#define MDR_ADCUI_CTRL1_I2EN_Pos          (4UL)                     /*!< MDR_ADCUI CTRL1: I2EN (Bit 4)                         */
#define MDR_ADCUI_CTRL1_I2EN_Msk          (0x10UL)                  /*!< MDR_ADCUI CTRL1: I2EN (Bitfield-Mask: 0x01)           */
#define MDR_ADCUI_CTRL1_V2EN_Pos          (5UL)                     /*!< MDR_ADCUI CTRL1: V2EN (Bit 5)                         */
#define MDR_ADCUI_CTRL1_V2EN_Msk          (0x20UL)                  /*!< MDR_ADCUI CTRL1: V2EN (Bitfield-Mask: 0x01)           */
#define MDR_ADCUI_CTRL1_I3EN_Pos          (6UL)                     /*!< MDR_ADCUI CTRL1: I3EN (Bit 6)                         */
#define MDR_ADCUI_CTRL1_I3EN_Msk          (0x40UL)                  /*!< MDR_ADCUI CTRL1: I3EN (Bitfield-Mask: 0x01)           */
#define MDR_ADCUI_CTRL1_RESOL_Pos         (7UL)                     /*!< MDR_ADCUI CTRL1: RESOL (Bit 7)                        */
#define MDR_ADCUI_CTRL1_RESOL_Msk         (0x80UL)                  /*!< MDR_ADCUI CTRL1: RESOL (Bitfield-Mask: 0x01)          */
#define MDR_ADCUI_CTRL1_ZXLPF_Pos         (8UL)                     /*!< MDR_ADCUI CTRL1: ZXLPF (Bit 8)                        */
#define MDR_ADCUI_CTRL1_ZXLPF_Msk         (0x100UL)                 /*!< MDR_ADCUI CTRL1: ZXLPF (Bitfield-Mask: 0x01)          */
#define MDR_ADCUI_CTRL1_PER_Length_Pos    (9UL)                     /*!< MDR_ADCUI CTRL1: PER_Length (Bit 9)                   */
#define MDR_ADCUI_CTRL1_PER_Length_Msk    (0xe00UL)                 /*!< MDR_ADCUI CTRL1: PER_Length (Bitfield-Mask: 0x07)     */
#define MDR_ADCUI_CTRL1_APNOLOAD_Pos      (12UL)                    /*!< MDR_ADCUI CTRL1: APNOLOAD (Bit 12)                    */
#define MDR_ADCUI_CTRL1_APNOLOAD_Msk      (0x3000UL)                /*!< MDR_ADCUI CTRL1: APNOLOAD (Bitfield-Mask: 0x03)       */
#define MDR_ADCUI_CTRL1_VARNOLOAD_Pos     (15UL)                    /*!< MDR_ADCUI CTRL1: VARNOLOAD (Bit 15)                   */
#define MDR_ADCUI_CTRL1_VARNOLOAD_Msk     (0x18000UL)               /*!< MDR_ADCUI CTRL1: VARNOLOAD (Bitfield-Mask: 0x03)      */
#define MDR_ADCUI_CTRL1_VANOLOAD_Pos      (17UL)                    /*!< MDR_ADCUI CTRL1: VANOLOAD (Bit 17)                    */
#define MDR_ADCUI_CTRL1_VANOLOAD_Msk      (0x60000UL)               /*!< MDR_ADCUI CTRL1: VANOLOAD (Bitfield-Mask: 0x03)       */
#define MDR_ADCUI_CTRL1_FREQSEL_Pos       (19UL)                    /*!< MDR_ADCUI CTRL1: FREQSEL (Bit 19)                     */
#define MDR_ADCUI_CTRL1_FREQSEL_Msk       (0x80000UL)               /*!< MDR_ADCUI CTRL1: FREQSEL (Bitfield-Mask: 0x01)        */
#define MDR_ADCUI_CTRL1_VREF_SEL_Pos      (20UL)                    /*!< MDR_ADCUI CTRL1: VREF_SEL (Bit 20)                    */
#define MDR_ADCUI_CTRL1_VREF_SEL_Msk      (0x100000UL)              /*!< MDR_ADCUI CTRL1: VREF_SEL (Bitfield-Mask: 0x01)       */
#define MDR_ADCUI_CTRL1_BUF_BYP_Pos       (21UL)                    /*!< MDR_ADCUI CTRL1: BUF_BYP (Bit 21)                     */
#define MDR_ADCUI_CTRL1_BUF_BYP_Msk       (0x200000UL)              /*!< MDR_ADCUI CTRL1: BUF_BYP (Bitfield-Mask: 0x01)        */
#define MDR_ADCUI_CTRL1_CHOP_EN_Pos       (22UL)                    /*!< MDR_ADCUI CTRL1: CHOP_EN (Bit 22)                     */
#define MDR_ADCUI_CTRL1_CHOP_EN_Msk       (0x400000UL)              /*!< MDR_ADCUI CTRL1: CHOP_EN (Bitfield-Mask: 0x01)        */
#define MDR_ADCUI_CTRL1_CHOP_FREQ_Pos     (23UL)                    /*!< MDR_ADCUI CTRL1: CHOP_FREQ (Bit 23)                   */
#define MDR_ADCUI_CTRL1_CHOP_FREQ_Msk     (0x1800000UL)             /*!< MDR_ADCUI CTRL1: CHOP_FREQ (Bitfield-Mask: 0x03)      */
#define MDR_ADCUI_CTRL1_ZXRMS_Pos         (27UL)                    /*!< MDR_ADCUI CTRL1: ZXRMS (Bit 27)                       */
#define MDR_ADCUI_CTRL1_ZXRMS_Msk         (0x8000000UL)             /*!< MDR_ADCUI CTRL1: ZXRMS (Bitfield-Mask: 0x01)          */
#define MDR_ADCUI_CTRL1_RESET_DIG_Pos     (28UL)                    /*!< MDR_ADCUI CTRL1: RESET_DIG (Bit 28)                   */
#define MDR_ADCUI_CTRL1_RESET_DIG_Msk     (0x10000000UL)            /*!< MDR_ADCUI CTRL1: RESET_DIG (Bitfield-Mask: 0x01)      */
#define MDR_ADCUI_CTRL1_IBOOST_Pos        (29UL)                    /*!< MDR_ADCUI CTRL1: IBOOST (Bit 29)                      */
#define MDR_ADCUI_CTRL1_IBOOST_Msk        (0x20000000UL)            /*!< MDR_ADCUI CTRL1: IBOOST (Bitfield-Mask: 0x01)         */
#define MDR_ADCUI_CTRL1_OSR_CONF_Pos      (30UL)                    /*!< MDR_ADCUI CTRL1: OSR_CONF (Bit 30)                    */
#define MDR_ADCUI_CTRL1_OSR_CONF_Msk      (0xc0000000UL)            /*!< MDR_ADCUI CTRL1: OSR_CONF (Bitfield-Mask: 0x03)       */
/* =========================================================  CTRL2  ========================================================= */
#define MDR_ADCUI_CTRL2_SAGLVL_Pos        (0UL)                     /*!< MDR_ADCUI CTRL2: SAGLVL (Bit 0)                       */
#define MDR_ADCUI_CTRL2_SAGLVL_Msk        (0xffffUL)                /*!< MDR_ADCUI CTRL2: SAGLVL (Bitfield-Mask: 0xffff)       */
#define MDR_ADCUI_CTRL2_SAGCYC_Pos        (16UL)                    /*!< MDR_ADCUI CTRL2: SAGCYC (Bit 16)                      */
#define MDR_ADCUI_CTRL2_SAGCYC_Msk        (0xff0000UL)              /*!< MDR_ADCUI CTRL2: SAGCYC (Bitfield-Mask: 0xff)         */
/* =========================================================  CTRL3  ========================================================= */
#define MDR_ADCUI_CTRL3_ZTXOUT_Pos        (0UL)                     /*!< MDR_ADCUI CTRL3: ZTXOUT (Bit 0)                       */
#define MDR_ADCUI_CTRL3_ZTXOUT_Msk        (0xfffUL)                 /*!< MDR_ADCUI CTRL3: ZTXOUT (Bitfield-Mask: 0xfff)        */
/* =========================================================  F0CTR  ========================================================= */
#define MDR_ADCUI_F0CTR_I0NTEN_Pos        (0UL)                     /*!< MDR_ADCUI F0CTR: I0NTEN (Bit 0)                       */
#define MDR_ADCUI_F0CTR_I0NTEN_Msk        (0x1UL)                   /*!< MDR_ADCUI F0CTR: I0NTEN (Bitfield-Mask: 0x01)         */
#define MDR_ADCUI_F0CTR_I3NTEN_Pos        (1UL)                     /*!< MDR_ADCUI F0CTR: I3NTEN (Bit 1)                       */
#define MDR_ADCUI_F0CTR_I3NTEN_Msk        (0x2UL)                   /*!< MDR_ADCUI F0CTR: I3NTEN (Bitfield-Mask: 0x01)         */
#define MDR_ADCUI_F0CTR_VASEL_Pos         (2UL)                     /*!< MDR_ADCUI F0CTR: VASEL (Bit 2)                        */
#define MDR_ADCUI_F0CTR_VASEL_Msk         (0x4UL)                   /*!< MDR_ADCUI F0CTR: VASEL (Bitfield-Mask: 0x01)          */
#define MDR_ADCUI_F0CTR_RARS_Pos          (3UL)                     /*!< MDR_ADCUI F0CTR: RARS (Bit 3)                         */
#define MDR_ADCUI_F0CTR_RARS_Msk          (0x8UL)                   /*!< MDR_ADCUI F0CTR: RARS (Bitfield-Mask: 0x01)           */
#define MDR_ADCUI_F0CTR_RRRS_Pos          (4UL)                     /*!< MDR_ADCUI F0CTR: RRRS (Bit 4)                         */
#define MDR_ADCUI_F0CTR_RRRS_Msk          (0x10UL)                  /*!< MDR_ADCUI F0CTR: RRRS (Bitfield-Mask: 0x01)           */
#define MDR_ADCUI_F0CTR_RVRS_Pos          (5UL)                     /*!< MDR_ADCUI F0CTR: RVRS (Bit 5)                         */
#define MDR_ADCUI_F0CTR_RVRS_Msk          (0x20UL)                  /*!< MDR_ADCUI F0CTR: RVRS (Bitfield-Mask: 0x01)           */
#define MDR_ADCUI_F0CTR_I0GAIN_Pos        (6UL)                     /*!< MDR_ADCUI F0CTR: I0GAIN (Bit 6)                       */
#define MDR_ADCUI_F0CTR_I0GAIN_Msk        (0xc0UL)                  /*!< MDR_ADCUI F0CTR: I0GAIN (Bitfield-Mask: 0x03)         */
#define MDR_ADCUI_F0CTR_VGAIN_Pos         (8UL)                     /*!< MDR_ADCUI F0CTR: VGAIN (Bit 8)                        */
#define MDR_ADCUI_F0CTR_VGAIN_Msk         (0x300UL)                 /*!< MDR_ADCUI F0CTR: VGAIN (Bitfield-Mask: 0x03)          */
#define MDR_ADCUI_F0CTR_VPHASE_Pos        (10UL)                    /*!< MDR_ADCUI F0CTR: VPHASE (Bit 10)                      */
#define MDR_ADCUI_F0CTR_VPHASE_Msk        (0x3fc00UL)               /*!< MDR_ADCUI F0CTR: VPHASE (Bitfield-Mask: 0xff)         */
#define MDR_ADCUI_F0CTR_I3GAIN_Pos        (18UL)                    /*!< MDR_ADCUI F0CTR: I3GAIN (Bit 18)                      */
#define MDR_ADCUI_F0CTR_I3GAIN_Msk        (0xc0000UL)               /*!< MDR_ADCUI F0CTR: I3GAIN (Bitfield-Mask: 0x03)         */
#define MDR_ADCUI_F0CTR_IRMSOS_Pos        (20UL)                    /*!< MDR_ADCUI F0CTR: IRMSOS (Bit 20)                      */
#define MDR_ADCUI_F0CTR_IRMSOS_Msk        (0xfff00000UL)            /*!< MDR_ADCUI F0CTR: IRMSOS (Bitfield-Mask: 0xfff)        */
/* =========================================================  F0WC  ========================================================== */
#define MDR_ADCUI_F0WC_WATTOS_Pos         (0UL)                     /*!< MDR_ADCUI F0WC: WATTOS (Bit 0)                        */
#define MDR_ADCUI_F0WC_WATTOS_Msk         (0xffffUL)                /*!< MDR_ADCUI F0WC: WATTOS (Bitfield-Mask: 0xffff)        */
#define MDR_ADCUI_F0WC_WGAIN_Pos          (16UL)                    /*!< MDR_ADCUI F0WC: WGAIN (Bit 16)                        */
#define MDR_ADCUI_F0WC_WGAIN_Msk          (0xfff0000UL)             /*!< MDR_ADCUI F0WC: WGAIN (Bitfield-Mask: 0xfff)          */
/* ========================================================  F0WATTP  ======================================================== */
#define MDR_ADCUI_F0WATTP_WATTHRP_Pos     (0UL)                     /*!< MDR_ADCUI F0WATTP: WATTHRP (Bit 0)                    */
#define MDR_ADCUI_F0WATTP_WATTHRP_Msk     (0xffffffffUL)            /*!< MDR_ADCUI F0WATTP: WATTHRP (Bitfield-Mask: 0xffffffff) */
/* ========================================================  F0WATTN  ======================================================== */
#define MDR_ADCUI_F0WATTN_WATTHRN_Pos     (0UL)                     /*!< MDR_ADCUI F0WATTN: WATTHRN (Bit 0)                    */
#define MDR_ADCUI_F0WATTN_WATTHRN_Msk     (0xffffffffUL)            /*!< MDR_ADCUI F0WATTN: WATTHRN (Bitfield-Mask: 0xffffffff) */
/* =========================================================  F0VC  ========================================================== */
#define MDR_ADCUI_F0VC_VAROS_Pos          (0UL)                     /*!< MDR_ADCUI F0VC: VAROS (Bit 0)                         */
#define MDR_ADCUI_F0VC_VAROS_Msk          (0xffffUL)                /*!< MDR_ADCUI F0VC: VAROS (Bitfield-Mask: 0xffff)         */
#define MDR_ADCUI_F0VC_VARGAIN_Pos        (16UL)                    /*!< MDR_ADCUI F0VC: VARGAIN (Bit 16)                      */
#define MDR_ADCUI_F0VC_VARGAIN_Msk        (0xfff0000UL)             /*!< MDR_ADCUI F0VC: VARGAIN (Bitfield-Mask: 0xfff)        */
/* ========================================================  F0VARP  ========================================================= */
#define MDR_ADCUI_F0VARP_VARHRP_Pos       (0UL)                     /*!< MDR_ADCUI F0VARP: VARHRP (Bit 0)                      */
#define MDR_ADCUI_F0VARP_VARHRP_Msk       (0xffffffffUL)            /*!< MDR_ADCUI F0VARP: VARHRP (Bitfield-Mask: 0xffffffff)  */
/* ========================================================  F0VARN  ========================================================= */
#define MDR_ADCUI_F0VARN_VARHRN_Pos       (0UL)                     /*!< MDR_ADCUI F0VARN: VARHRN (Bit 0)                      */
#define MDR_ADCUI_F0VARN_VARHRN_Msk       (0xffffffffUL)            /*!< MDR_ADCUI F0VARN: VARHRN (Bitfield-Mask: 0xffffffff)  */
/* =========================================================  F0AC  ========================================================== */
#define MDR_ADCUI_F0AC_VRMSOS_Pos         (0UL)                     /*!< MDR_ADCUI F0AC: VRMSOS (Bit 0)                        */
#define MDR_ADCUI_F0AC_VRMSOS_Msk         (0xfffUL)                 /*!< MDR_ADCUI F0AC: VRMSOS (Bitfield-Mask: 0xfff)         */
#define MDR_ADCUI_F0AC_VAGAIN_Pos         (16UL)                    /*!< MDR_ADCUI F0AC: VAGAIN (Bit 16)                       */
#define MDR_ADCUI_F0AC_VAGAIN_Msk         (0xfff0000UL)             /*!< MDR_ADCUI F0AC: VAGAIN (Bitfield-Mask: 0xfff)         */
/* =========================================================  F0VR  ========================================================== */
#define MDR_ADCUI_F0VR_VAHR_Pos           (0UL)                     /*!< MDR_ADCUI F0VR: VAHR (Bit 0)                          */
#define MDR_ADCUI_F0VR_VAHR_Msk           (0xffffffffUL)            /*!< MDR_ADCUI F0VR: VAHR (Bitfield-Mask: 0xffffffff)      */
/* =========================================================  F0MD0  ========================================================= */
#define MDR_ADCUI_F0MD0_VSEL_Pos          (0UL)                     /*!< MDR_ADCUI F0MD0: VSEL (Bit 0)                         */
#define MDR_ADCUI_F0MD0_VSEL_Msk          (0x3UL)                   /*!< MDR_ADCUI F0MD0: VSEL (Bitfield-Mask: 0x03)           */
#define MDR_ADCUI_F0MD0_ISEL_Pos          (2UL)                     /*!< MDR_ADCUI F0MD0: ISEL (Bit 2)                         */
#define MDR_ADCUI_F0MD0_ISEL_Msk          (0xcUL)                   /*!< MDR_ADCUI F0MD0: ISEL (Bitfield-Mask: 0x03)           */
#define MDR_ADCUI_F0MD0_ACTS_Pos          (4UL)                     /*!< MDR_ADCUI F0MD0: ACTS (Bit 4)                         */
#define MDR_ADCUI_F0MD0_ACTS_Msk          (0x10UL)                  /*!< MDR_ADCUI F0MD0: ACTS (Bitfield-Mask: 0x01)           */
#define MDR_ADCUI_F0MD0_REACTS_Pos        (5UL)                     /*!< MDR_ADCUI F0MD0: REACTS (Bit 5)                       */
#define MDR_ADCUI_F0MD0_REACTS_Msk        (0x20UL)                  /*!< MDR_ADCUI F0MD0: REACTS (Bitfield-Mask: 0x01)         */
#define MDR_ADCUI_F0MD0_IOGAIN_Pos        (6UL)                     /*!< MDR_ADCUI F0MD0: IOGAIN (Bit 6)                       */
#define MDR_ADCUI_F0MD0_IOGAIN_Msk        (0x40UL)                  /*!< MDR_ADCUI F0MD0: IOGAIN (Bitfield-Mask: 0x01)         */
#define MDR_ADCUI_F0MD0_V0GAIN_Pos        (7UL)                     /*!< MDR_ADCUI F0MD0: V0GAIN (Bit 7)                       */
#define MDR_ADCUI_F0MD0_V0GAIN_Msk        (0x80UL)                  /*!< MDR_ADCUI F0MD0: V0GAIN (Bitfield-Mask: 0x01)         */
#define MDR_ADCUI_F0MD0_I3GAIN_Pos        (8UL)                     /*!< MDR_ADCUI F0MD0: I3GAIN (Bit 8)                       */
#define MDR_ADCUI_F0MD0_I3GAIN_Msk        (0x100UL)                 /*!< MDR_ADCUI F0MD0: I3GAIN (Bitfield-Mask: 0x01)         */
#define MDR_ADCUI_F0MD0_PER_FREQ_Pos      (12UL)                    /*!< MDR_ADCUI F0MD0: PER_FREQ (Bit 12)                    */
#define MDR_ADCUI_F0MD0_PER_FREQ_Msk      (0x1ffff000UL)            /*!< MDR_ADCUI F0MD0: PER_FREQ (Bitfield-Mask: 0x1ffff)    */
#define MDR_ADCUI_F0MD0_I3SEL_Pos         (29UL)                    /*!< MDR_ADCUI F0MD0: I3SEL (Bit 29)                       */
#define MDR_ADCUI_F0MD0_I3SEL_Msk         (0x20000000UL)            /*!< MDR_ADCUI F0MD0: I3SEL (Bitfield-Mask: 0x01)          */
#define MDR_ADCUI_F0MD0_SEL_I_CH_Pos      (30UL)                    /*!< MDR_ADCUI F0MD0: SEL_I_CH (Bit 30)                    */
#define MDR_ADCUI_F0MD0_SEL_I_CH_Msk      (0xc0000000UL)            /*!< MDR_ADCUI F0MD0: SEL_I_CH (Bitfield-Mask: 0x03)       */
/* =========================================================  F0MD1  ========================================================= */
#define MDR_ADCUI_F0MD1_IPKLVL_Pos        (0UL)                     /*!< MDR_ADCUI F0MD1: IPKLVL (Bit 0)                       */
#define MDR_ADCUI_F0MD1_IPKLVL_Msk        (0xffffUL)                /*!< MDR_ADCUI F0MD1: IPKLVL (Bitfield-Mask: 0xffff)       */
#define MDR_ADCUI_F0MD1_VPKLVL_Pos        (16UL)                    /*!< MDR_ADCUI F0MD1: VPKLVL (Bit 16)                      */
#define MDR_ADCUI_F0MD1_VPKLVL_Msk        (0xffff0000UL)            /*!< MDR_ADCUI F0MD1: VPKLVL (Bitfield-Mask: 0xffff)       */
/* ========================================================  F0VPEAK  ======================================================== */
#define MDR_ADCUI_F0VPEAK_IPEAK_Pos       (0UL)                     /*!< MDR_ADCUI F0VPEAK: IPEAK (Bit 0)                      */
#define MDR_ADCUI_F0VPEAK_IPEAK_Msk       (0xffffffUL)              /*!< MDR_ADCUI F0VPEAK: IPEAK (Bitfield-Mask: 0xffffff)    */
/* ========================================================  F0IPEAK  ======================================================== */
#define MDR_ADCUI_F0IPEAK_IPEAK_Pos       (0UL)                     /*!< MDR_ADCUI F0IPEAK: IPEAK (Bit 0)                      */
#define MDR_ADCUI_F0IPEAK_IPEAK_Msk       (0xffffffUL)              /*!< MDR_ADCUI F0IPEAK: IPEAK (Bitfield-Mask: 0xffffff)    */
/* ========================================================  F0VDAT  ========================================================= */
#define MDR_ADCUI_F0VDAT_VDAT_Pos         (0UL)                     /*!< MDR_ADCUI F0VDAT: VDAT (Bit 0)                        */
#define MDR_ADCUI_F0VDAT_VDAT_Msk         (0xffffffUL)              /*!< MDR_ADCUI F0VDAT: VDAT (Bitfield-Mask: 0xffffff)      */
/* ========================================================  F0I0DAT  ======================================================== */
#define MDR_ADCUI_F0I0DAT_I0DAT_Pos       (0UL)                     /*!< MDR_ADCUI F0I0DAT: I0DAT (Bit 0)                      */
#define MDR_ADCUI_F0I0DAT_I0DAT_Msk       (0xffffffUL)              /*!< MDR_ADCUI F0I0DAT: I0DAT (Bitfield-Mask: 0xffffff)    */
/* ========================================================  F0I3DAT  ======================================================== */
#define MDR_ADCUI_F0I3DAT_I3DAT_Pos       (0UL)                     /*!< MDR_ADCUI F0I3DAT: I3DAT (Bit 0)                      */
#define MDR_ADCUI_F0I3DAT_I3DAT_Msk       (0xffffffUL)              /*!< MDR_ADCUI F0I3DAT: I3DAT (Bitfield-Mask: 0xffffff)    */
/* ========================================================  F0VRMS  ========================================================= */
#define MDR_ADCUI_F0VRMS_VRMS_Pos         (0UL)                     /*!< MDR_ADCUI F0VRMS: VRMS (Bit 0)                        */
#define MDR_ADCUI_F0VRMS_VRMS_Msk         (0xffffffUL)              /*!< MDR_ADCUI F0VRMS: VRMS (Bitfield-Mask: 0xffffff)      */
/* ========================================================  F0VRMS2  ======================================================== */
#define MDR_ADCUI_F0VRMS2_VRMS2_Pos       (0UL)                     /*!< MDR_ADCUI F0VRMS2: VRMS2 (Bit 0)                      */
#define MDR_ADCUI_F0VRMS2_VRMS2_Msk       (0xffffffUL)              /*!< MDR_ADCUI F0VRMS2: VRMS2 (Bitfield-Mask: 0xffffff)    */
/* ========================================================  F0IRMS  ========================================================= */
#define MDR_ADCUI_F0IRMS_IRMS_Pos         (0UL)                     /*!< MDR_ADCUI F0IRMS: IRMS (Bit 0)                        */
#define MDR_ADCUI_F0IRMS_IRMS_Msk         (0xffffffUL)              /*!< MDR_ADCUI F0IRMS: IRMS (Bitfield-Mask: 0xffffff)      */
/* ========================================================  F0IRMS2  ======================================================== */
#define MDR_ADCUI_F0IRMS2_IRMS2_Pos       (0UL)                     /*!< MDR_ADCUI F0IRMS2: IRMS2 (Bit 0)                      */
#define MDR_ADCUI_F0IRMS2_IRMS2_Msk       (0xffffffUL)              /*!< MDR_ADCUI F0IRMS2: IRMS2 (Bitfield-Mask: 0xffffff)    */
/* ========================================================  F0STAT  ========================================================= */
#define MDR_ADCUI_F0STAT_VF_EMP_Pos       (0UL)                     /*!< MDR_ADCUI F0STAT: VF_EMP (Bit 0)                      */
#define MDR_ADCUI_F0STAT_VF_EMP_Msk       (0x1UL)                   /*!< MDR_ADCUI F0STAT: VF_EMP (Bitfield-Mask: 0x01)        */
#define MDR_ADCUI_F0STAT_VF_FLL_Pos       (1UL)                     /*!< MDR_ADCUI F0STAT: VF_FLL (Bit 1)                      */
#define MDR_ADCUI_F0STAT_VF_FLL_Msk       (0x2UL)                   /*!< MDR_ADCUI F0STAT: VF_FLL (Bitfield-Mask: 0x01)        */
#define MDR_ADCUI_F0STAT_VF_OVER_Pos      (2UL)                     /*!< MDR_ADCUI F0STAT: VF_OVER (Bit 2)                     */
#define MDR_ADCUI_F0STAT_VF_OVER_Msk      (0x4UL)                   /*!< MDR_ADCUI F0STAT: VF_OVER (Bitfield-Mask: 0x01)       */
#define MDR_ADCUI_F0STAT_IF_EMP_Pos       (3UL)                     /*!< MDR_ADCUI F0STAT: IF_EMP (Bit 3)                      */
#define MDR_ADCUI_F0STAT_IF_EMP_Msk       (0x8UL)                   /*!< MDR_ADCUI F0STAT: IF_EMP (Bitfield-Mask: 0x01)        */
#define MDR_ADCUI_F0STAT_IF_FLL_Pos       (4UL)                     /*!< MDR_ADCUI F0STAT: IF_FLL (Bit 4)                      */
#define MDR_ADCUI_F0STAT_IF_FLL_Msk       (0x10UL)                  /*!< MDR_ADCUI F0STAT: IF_FLL (Bitfield-Mask: 0x01)        */
#define MDR_ADCUI_F0STAT_IF_OVER_Pos      (5UL)                     /*!< MDR_ADCUI F0STAT: IF_OVER (Bit 5)                     */
#define MDR_ADCUI_F0STAT_IF_OVER_Msk      (0x20UL)                  /*!< MDR_ADCUI F0STAT: IF_OVER (Bitfield-Mask: 0x01)       */
#define MDR_ADCUI_F0STAT_SAGF_Pos         (6UL)                     /*!< MDR_ADCUI F0STAT: SAGF (Bit 6)                        */
#define MDR_ADCUI_F0STAT_SAGF_Msk         (0x40UL)                  /*!< MDR_ADCUI F0STAT: SAGF (Bitfield-Mask: 0x01)          */
#define MDR_ADCUI_F0STAT_PEAKVF_Pos       (7UL)                     /*!< MDR_ADCUI F0STAT: PEAKVF (Bit 7)                      */
#define MDR_ADCUI_F0STAT_PEAKVF_Msk       (0x80UL)                  /*!< MDR_ADCUI F0STAT: PEAKVF (Bitfield-Mask: 0x01)        */
#define MDR_ADCUI_F0STAT_PEAKIF_Pos       (8UL)                     /*!< MDR_ADCUI F0STAT: PEAKIF (Bit 8)                      */
#define MDR_ADCUI_F0STAT_PEAKIF_Msk       (0x100UL)                 /*!< MDR_ADCUI F0STAT: PEAKIF (Bitfield-Mask: 0x01)        */
#define MDR_ADCUI_F0STAT_WATTOVP_Pos      (9UL)                     /*!< MDR_ADCUI F0STAT: WATTOVP (Bit 9)                     */
#define MDR_ADCUI_F0STAT_WATTOVP_Msk      (0x200UL)                 /*!< MDR_ADCUI F0STAT: WATTOVP (Bitfield-Mask: 0x01)       */
#define MDR_ADCUI_F0STAT_VAROVP_Pos       (10UL)                    /*!< MDR_ADCUI F0STAT: VAROVP (Bit 10)                     */
#define MDR_ADCUI_F0STAT_VAROVP_Msk       (0x400UL)                 /*!< MDR_ADCUI F0STAT: VAROVP (Bitfield-Mask: 0x01)        */
#define MDR_ADCUI_F0STAT_VAOV_Pos         (11UL)                    /*!< MDR_ADCUI F0STAT: VAOV (Bit 11)                       */
#define MDR_ADCUI_F0STAT_VAOV_Msk         (0x800UL)                 /*!< MDR_ADCUI F0STAT: VAOV (Bitfield-Mask: 0x01)          */
