StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VK234.h
#define MDR_ADCUI_F0STAT_ZTXVF_Pos        (12UL)                    /*!< MDR_ADCUI F0STAT: ZTXVF (Bit 12)                      */
#define MDR_ADCUI_F0STAT_ZTXVF_Msk        (0x1000UL)                /*!< MDR_ADCUI F0STAT: ZTXVF (Bitfield-Mask: 0x01)         */
#define MDR_ADCUI_F0STAT_ICHANNEL_Pos     (13UL)                    /*!< MDR_ADCUI F0STAT: ICHANNEL (Bit 13)                   */
#define MDR_ADCUI_F0STAT_ICHANNEL_Msk     (0x2000UL)                /*!< MDR_ADCUI F0STAT: ICHANNEL (Bitfield-Mask: 0x01)      */
#define MDR_ADCUI_F0STAT_FAULTCON_Pos     (14UL)                    /*!< MDR_ADCUI F0STAT: FAULTCON (Bit 14)                   */
#define MDR_ADCUI_F0STAT_FAULTCON_Msk     (0x4000UL)                /*!< MDR_ADCUI F0STAT: FAULTCON (Bitfield-Mask: 0x01)      */
#define MDR_ADCUI_F0STAT_APSIGN_Pos       (15UL)                    /*!< MDR_ADCUI F0STAT: APSIGN (Bit 15)                     */
#define MDR_ADCUI_F0STAT_APSIGN_Msk       (0x8000UL)                /*!< MDR_ADCUI F0STAT: APSIGN (Bitfield-Mask: 0x01)        */
#define MDR_ADCUI_F0STAT_APNLDFL_Pos      (16UL)                    /*!< MDR_ADCUI F0STAT: APNLDFL (Bit 16)                    */
#define MDR_ADCUI_F0STAT_APNLDFL_Msk      (0x10000UL)               /*!< MDR_ADCUI F0STAT: APNLDFL (Bitfield-Mask: 0x01)       */
#define MDR_ADCUI_F0STAT_VARSIGN_Pos      (17UL)                    /*!< MDR_ADCUI F0STAT: VARSIGN (Bit 17)                    */
#define MDR_ADCUI_F0STAT_VARSIGN_Msk      (0x20000UL)               /*!< MDR_ADCUI F0STAT: VARSIGN (Bitfield-Mask: 0x01)       */
#define MDR_ADCUI_F0STAT_VARNLDFL_Pos     (18UL)                    /*!< MDR_ADCUI F0STAT: VARNLDFL (Bit 18)                   */
#define MDR_ADCUI_F0STAT_VARNLDFL_Msk     (0x40000UL)               /*!< MDR_ADCUI F0STAT: VARNLDFL (Bitfield-Mask: 0x01)      */
#define MDR_ADCUI_F0STAT_VANLDFL_Pos      (20UL)                    /*!< MDR_ADCUI F0STAT: VANLDFL (Bit 20)                    */
#define MDR_ADCUI_F0STAT_VANLDFL_Msk      (0x100000UL)              /*!< MDR_ADCUI F0STAT: VANLDFL (Bitfield-Mask: 0x01)       */
#define MDR_ADCUI_F0STAT_ZEROCRS_Pos      (21UL)                    /*!< MDR_ADCUI F0STAT: ZEROCRS (Bit 21)                    */
#define MDR_ADCUI_F0STAT_ZEROCRS_Msk      (0x200000UL)              /*!< MDR_ADCUI F0STAT: ZEROCRS (Bitfield-Mask: 0x01)       */
#define MDR_ADCUI_F0STAT_I3F_EMP_Pos      (22UL)                    /*!< MDR_ADCUI F0STAT: I3F_EMP (Bit 22)                    */
#define MDR_ADCUI_F0STAT_I3F_EMP_Msk      (0x400000UL)              /*!< MDR_ADCUI F0STAT: I3F_EMP (Bitfield-Mask: 0x01)       */
#define MDR_ADCUI_F0STAT_I3F_FLL_Pos      (23UL)                    /*!< MDR_ADCUI F0STAT: I3F_FLL (Bit 23)                    */
#define MDR_ADCUI_F0STAT_I3F_FLL_Msk      (0x800000UL)              /*!< MDR_ADCUI F0STAT: I3F_FLL (Bitfield-Mask: 0x01)       */
#define MDR_ADCUI_F0STAT_I3F_OVER_Pos     (24UL)                    /*!< MDR_ADCUI F0STAT: I3F_OVER (Bit 24)                   */
#define MDR_ADCUI_F0STAT_I3F_OVER_Msk     (0x1000000UL)             /*!< MDR_ADCUI F0STAT: I3F_OVER (Bitfield-Mask: 0x01)      */
#define MDR_ADCUI_F0STAT_WATTOVN_Pos      (25UL)                    /*!< MDR_ADCUI F0STAT: WATTOVN (Bit 25)                    */
#define MDR_ADCUI_F0STAT_WATTOVN_Msk      (0x2000000UL)             /*!< MDR_ADCUI F0STAT: WATTOVN (Bitfield-Mask: 0x01)       */
#define MDR_ADCUI_F0STAT_VAROVN_Pos       (26UL)                    /*!< MDR_ADCUI F0STAT: VAROVN (Bit 26)                     */
#define MDR_ADCUI_F0STAT_VAROVN_Msk       (0x4000000UL)             /*!< MDR_ADCUI F0STAT: VAROVN (Bitfield-Mask: 0x01)        */
/* ========================================================  F0MASK  ========================================================= */
#define MDR_ADCUI_F0MASK_VF_EMPM_Pos      (0UL)                     /*!< MDR_ADCUI F0MASK: VF_EMPM (Bit 0)                     */
#define MDR_ADCUI_F0MASK_VF_EMPM_Msk      (0x1UL)                   /*!< MDR_ADCUI F0MASK: VF_EMPM (Bitfield-Mask: 0x01)       */
#define MDR_ADCUI_F0MASK_VF_FLLM_Pos      (1UL)                     /*!< MDR_ADCUI F0MASK: VF_FLLM (Bit 1)                     */
#define MDR_ADCUI_F0MASK_VF_FLLM_Msk      (0x2UL)                   /*!< MDR_ADCUI F0MASK: VF_FLLM (Bitfield-Mask: 0x01)       */
#define MDR_ADCUI_F0MASK_VF_OVERM_Pos     (2UL)                     /*!< MDR_ADCUI F0MASK: VF_OVERM (Bit 2)                    */
#define MDR_ADCUI_F0MASK_VF_OVERM_Msk     (0x4UL)                   /*!< MDR_ADCUI F0MASK: VF_OVERM (Bitfield-Mask: 0x01)      */
#define MDR_ADCUI_F0MASK_IF_EMPM_Pos      (3UL)                     /*!< MDR_ADCUI F0MASK: IF_EMPM (Bit 3)                     */
#define MDR_ADCUI_F0MASK_IF_EMPM_Msk      (0x8UL)                   /*!< MDR_ADCUI F0MASK: IF_EMPM (Bitfield-Mask: 0x01)       */
#define MDR_ADCUI_F0MASK_IF_FLLM_Pos      (4UL)                     /*!< MDR_ADCUI F0MASK: IF_FLLM (Bit 4)                     */
#define MDR_ADCUI_F0MASK_IF_FLLM_Msk      (0x10UL)                  /*!< MDR_ADCUI F0MASK: IF_FLLM (Bitfield-Mask: 0x01)       */
#define MDR_ADCUI_F0MASK_IF_OVERM_Pos     (5UL)                     /*!< MDR_ADCUI F0MASK: IF_OVERM (Bit 5)                    */
#define MDR_ADCUI_F0MASK_IF_OVERM_Msk     (0x20UL)                  /*!< MDR_ADCUI F0MASK: IF_OVERM (Bitfield-Mask: 0x01)      */
#define MDR_ADCUI_F0MASK_SAGFM_Pos        (6UL)                     /*!< MDR_ADCUI F0MASK: SAGFM (Bit 6)                       */
#define MDR_ADCUI_F0MASK_SAGFM_Msk        (0x40UL)                  /*!< MDR_ADCUI F0MASK: SAGFM (Bitfield-Mask: 0x01)         */
#define MDR_ADCUI_F0MASK_PEAKVFM_Pos      (7UL)                     /*!< MDR_ADCUI F0MASK: PEAKVFM (Bit 7)                     */
#define MDR_ADCUI_F0MASK_PEAKVFM_Msk      (0x80UL)                  /*!< MDR_ADCUI F0MASK: PEAKVFM (Bitfield-Mask: 0x01)       */
#define MDR_ADCUI_F0MASK_PEAKIFM_Pos      (8UL)                     /*!< MDR_ADCUI F0MASK: PEAKIFM (Bit 8)                     */
#define MDR_ADCUI_F0MASK_PEAKIFM_Msk      (0x100UL)                 /*!< MDR_ADCUI F0MASK: PEAKIFM (Bitfield-Mask: 0x01)       */
#define MDR_ADCUI_F0MASK_WATTOVPM_Pos     (9UL)                     /*!< MDR_ADCUI F0MASK: WATTOVPM (Bit 9)                    */
#define MDR_ADCUI_F0MASK_WATTOVPM_Msk     (0x200UL)                 /*!< MDR_ADCUI F0MASK: WATTOVPM (Bitfield-Mask: 0x01)      */
#define MDR_ADCUI_F0MASK_VAROVPM_Pos      (10UL)                    /*!< MDR_ADCUI F0MASK: VAROVPM (Bit 10)                    */
#define MDR_ADCUI_F0MASK_VAROVPM_Msk      (0x400UL)                 /*!< MDR_ADCUI F0MASK: VAROVPM (Bitfield-Mask: 0x01)       */
#define MDR_ADCUI_F0MASK_VAOVM_Pos        (11UL)                    /*!< MDR_ADCUI F0MASK: VAOVM (Bit 11)                      */
#define MDR_ADCUI_F0MASK_VAOVM_Msk        (0x800UL)                 /*!< MDR_ADCUI F0MASK: VAOVM (Bitfield-Mask: 0x01)         */
#define MDR_ADCUI_F0MASK_ZTXVFM_Pos       (12UL)                    /*!< MDR_ADCUI F0MASK: ZTXVFM (Bit 12)                     */
#define MDR_ADCUI_F0MASK_ZTXVFM_Msk       (0x1000UL)                /*!< MDR_ADCUI F0MASK: ZTXVFM (Bitfield-Mask: 0x01)        */
#define MDR_ADCUI_F0MASK_FAULTCONM_Pos    (14UL)                    /*!< MDR_ADCUI F0MASK: FAULTCONM (Bit 14)                  */
#define MDR_ADCUI_F0MASK_FAULTCONM_Msk    (0x4000UL)                /*!< MDR_ADCUI F0MASK: FAULTCONM (Bitfield-Mask: 0x01)     */
#define MDR_ADCUI_F0MASK_APSIGNM_Pos      (15UL)                    /*!< MDR_ADCUI F0MASK: APSIGNM (Bit 15)                    */
#define MDR_ADCUI_F0MASK_APSIGNM_Msk      (0x8000UL)                /*!< MDR_ADCUI F0MASK: APSIGNM (Bitfield-Mask: 0x01)       */
#define MDR_ADCUI_F0MASK_APNLDFLM_Pos     (16UL)                    /*!< MDR_ADCUI F0MASK: APNLDFLM (Bit 16)                   */
#define MDR_ADCUI_F0MASK_APNLDFLM_Msk     (0x10000UL)               /*!< MDR_ADCUI F0MASK: APNLDFLM (Bitfield-Mask: 0x01)      */
#define MDR_ADCUI_F0MASK_VARSIGNM_Pos     (17UL)                    /*!< MDR_ADCUI F0MASK: VARSIGNM (Bit 17)                   */
#define MDR_ADCUI_F0MASK_VARSIGNM_Msk     (0x20000UL)               /*!< MDR_ADCUI F0MASK: VARSIGNM (Bitfield-Mask: 0x01)      */
#define MDR_ADCUI_F0MASK_VARNLDFLM_Pos    (18UL)                    /*!< MDR_ADCUI F0MASK: VARNLDFLM (Bit 18)                  */
#define MDR_ADCUI_F0MASK_VARNLDFLM_Msk    (0x40000UL)               /*!< MDR_ADCUI F0MASK: VARNLDFLM (Bitfield-Mask: 0x01)     */
#define MDR_ADCUI_F0MASK_VANLDFLM_Pos     (20UL)                    /*!< MDR_ADCUI F0MASK: VANLDFLM (Bit 20)                   */
#define MDR_ADCUI_F0MASK_VANLDFLM_Msk     (0x100000UL)              /*!< MDR_ADCUI F0MASK: VANLDFLM (Bitfield-Mask: 0x01)      */
#define MDR_ADCUI_F0MASK_ZEROCRSM_Pos     (21UL)                    /*!< MDR_ADCUI F0MASK: ZEROCRSM (Bit 21)                   */
#define MDR_ADCUI_F0MASK_ZEROCRSM_Msk     (0x200000UL)              /*!< MDR_ADCUI F0MASK: ZEROCRSM (Bitfield-Mask: 0x01)      */
#define MDR_ADCUI_F0MASK_I3F_EMPM_Pos     (22UL)                    /*!< MDR_ADCUI F0MASK: I3F_EMPM (Bit 22)                   */
#define MDR_ADCUI_F0MASK_I3F_EMPM_Msk     (0x400000UL)              /*!< MDR_ADCUI F0MASK: I3F_EMPM (Bitfield-Mask: 0x01)      */
#define MDR_ADCUI_F0MASK_I3F_FLLM_Pos     (23UL)                    /*!< MDR_ADCUI F0MASK: I3F_FLLM (Bit 23)                   */
#define MDR_ADCUI_F0MASK_I3F_FLLM_Msk     (0x800000UL)              /*!< MDR_ADCUI F0MASK: I3F_FLLM (Bitfield-Mask: 0x01)      */
#define MDR_ADCUI_F0MASK_I3F_OVERM_Pos    (24UL)                    /*!< MDR_ADCUI F0MASK: I3F_OVERM (Bit 24)                  */
#define MDR_ADCUI_F0MASK_I3F_OVERM_Msk    (0x1000000UL)             /*!< MDR_ADCUI F0MASK: I3F_OVERM (Bitfield-Mask: 0x01)     */
#define MDR_ADCUI_F0MASK_WATTOVNM_Pos     (25UL)                    /*!< MDR_ADCUI F0MASK: WATTOVNM (Bit 25)                   */
#define MDR_ADCUI_F0MASK_WATTOVNM_Msk     (0x2000000UL)             /*!< MDR_ADCUI F0MASK: WATTOVNM (Bitfield-Mask: 0x01)      */
#define MDR_ADCUI_F0MASK_VAROVNM_Pos      (26UL)                    /*!< MDR_ADCUI F0MASK: VAROVNM (Bit 26)                    */
#define MDR_ADCUI_F0MASK_VAROVNM_Msk      (0x4000000UL)             /*!< MDR_ADCUI F0MASK: VAROVNM (Bitfield-Mask: 0x01)       */
/* =========================================================  F1CTR  ========================================================= */
#define MDR_ADCUI_F1CTR_INTEN_Pos         (0UL)                     /*!< MDR_ADCUI F1CTR: INTEN (Bit 0)                        */
#define MDR_ADCUI_F1CTR_INTEN_Msk         (0x1UL)                   /*!< MDR_ADCUI F1CTR: INTEN (Bitfield-Mask: 0x01)          */
#define MDR_ADCUI_F1CTR_VASEL_Pos         (2UL)                     /*!< MDR_ADCUI F1CTR: VASEL (Bit 2)                        */
#define MDR_ADCUI_F1CTR_VASEL_Msk         (0x4UL)                   /*!< MDR_ADCUI F1CTR: VASEL (Bitfield-Mask: 0x01)          */
#define MDR_ADCUI_F1CTR_RARS_Pos          (3UL)                     /*!< MDR_ADCUI F1CTR: RARS (Bit 3)                         */
#define MDR_ADCUI_F1CTR_RARS_Msk          (0x8UL)                   /*!< MDR_ADCUI F1CTR: RARS (Bitfield-Mask: 0x01)           */
#define MDR_ADCUI_F1CTR_RRRS_Pos          (4UL)                     /*!< MDR_ADCUI F1CTR: RRRS (Bit 4)                         */
#define MDR_ADCUI_F1CTR_RRRS_Msk          (0x10UL)                  /*!< MDR_ADCUI F1CTR: RRRS (Bitfield-Mask: 0x01)           */
#define MDR_ADCUI_F1CTR_RVRS_Pos          (5UL)                     /*!< MDR_ADCUI F1CTR: RVRS (Bit 5)                         */
#define MDR_ADCUI_F1CTR_RVRS_Msk          (0x20UL)                  /*!< MDR_ADCUI F1CTR: RVRS (Bitfield-Mask: 0x01)           */
#define MDR_ADCUI_F1CTR_IGAIN_Pos         (6UL)                     /*!< MDR_ADCUI F1CTR: IGAIN (Bit 6)                        */
#define MDR_ADCUI_F1CTR_IGAIN_Msk         (0xc0UL)                  /*!< MDR_ADCUI F1CTR: IGAIN (Bitfield-Mask: 0x03)          */
#define MDR_ADCUI_F1CTR_VGAIN_Pos         (8UL)                     /*!< MDR_ADCUI F1CTR: VGAIN (Bit 8)                        */
#define MDR_ADCUI_F1CTR_VGAIN_Msk         (0x300UL)                 /*!< MDR_ADCUI F1CTR: VGAIN (Bitfield-Mask: 0x03)          */
#define MDR_ADCUI_F1CTR_VPHASE_Pos        (10UL)                    /*!< MDR_ADCUI F1CTR: VPHASE (Bit 10)                      */
#define MDR_ADCUI_F1CTR_VPHASE_Msk        (0x3fc00UL)               /*!< MDR_ADCUI F1CTR: VPHASE (Bitfield-Mask: 0xff)         */
#define MDR_ADCUI_F1CTR_IRMSOS_Pos        (20UL)                    /*!< MDR_ADCUI F1CTR: IRMSOS (Bit 20)                      */
#define MDR_ADCUI_F1CTR_IRMSOS_Msk        (0xfff00000UL)            /*!< MDR_ADCUI F1CTR: IRMSOS (Bitfield-Mask: 0xfff)        */
/* =========================================================  F1WC  ========================================================== */
#define MDR_ADCUI_F1WC_WATTOS_Pos         (0UL)                     /*!< MDR_ADCUI F1WC: WATTOS (Bit 0)                        */
#define MDR_ADCUI_F1WC_WATTOS_Msk         (0xffffUL)                /*!< MDR_ADCUI F1WC: WATTOS (Bitfield-Mask: 0xffff)        */
#define MDR_ADCUI_F1WC_WGAIN_Pos          (16UL)                    /*!< MDR_ADCUI F1WC: WGAIN (Bit 16)                        */
#define MDR_ADCUI_F1WC_WGAIN_Msk          (0xfff0000UL)             /*!< MDR_ADCUI F1WC: WGAIN (Bitfield-Mask: 0xfff)          */
/* ========================================================  F1WATTP  ======================================================== */
#define MDR_ADCUI_F1WATTP_WATTHRP_Pos     (0UL)                     /*!< MDR_ADCUI F1WATTP: WATTHRP (Bit 0)                    */
#define MDR_ADCUI_F1WATTP_WATTHRP_Msk     (0xffffffffUL)            /*!< MDR_ADCUI F1WATTP: WATTHRP (Bitfield-Mask: 0xffffffff) */
/* ========================================================  F1WATTN  ======================================================== */
#define MDR_ADCUI_F1WATTN_WATTHRN_Pos     (0UL)                     /*!< MDR_ADCUI F1WATTN: WATTHRN (Bit 0)                    */
#define MDR_ADCUI_F1WATTN_WATTHRN_Msk     (0xffffffffUL)            /*!< MDR_ADCUI F1WATTN: WATTHRN (Bitfield-Mask: 0xffffffff) */
/* =========================================================  F1VC  ========================================================== */
#define MDR_ADCUI_F1VC_VAROS_Pos          (0UL)                     /*!< MDR_ADCUI F1VC: VAROS (Bit 0)                         */
#define MDR_ADCUI_F1VC_VAROS_Msk          (0xffffUL)                /*!< MDR_ADCUI F1VC: VAROS (Bitfield-Mask: 0xffff)         */
#define MDR_ADCUI_F1VC_VARGAIN_Pos        (16UL)                    /*!< MDR_ADCUI F1VC: VARGAIN (Bit 16)                      */
#define MDR_ADCUI_F1VC_VARGAIN_Msk        (0xfff0000UL)             /*!< MDR_ADCUI F1VC: VARGAIN (Bitfield-Mask: 0xfff)        */
/* ========================================================  F1VARP  ========================================================= */
#define MDR_ADCUI_F1VARP_VARHRP_Pos       (0UL)                     /*!< MDR_ADCUI F1VARP: VARHRP (Bit 0)                      */
#define MDR_ADCUI_F1VARP_VARHRP_Msk       (0xffffffffUL)            /*!< MDR_ADCUI F1VARP: VARHRP (Bitfield-Mask: 0xffffffff)  */
/* ========================================================  F1VARN  ========================================================= */
#define MDR_ADCUI_F1VARN_VARHRN_Pos       (0UL)                     /*!< MDR_ADCUI F1VARN: VARHRN (Bit 0)                      */
#define MDR_ADCUI_F1VARN_VARHRN_Msk       (0xffffffffUL)            /*!< MDR_ADCUI F1VARN: VARHRN (Bitfield-Mask: 0xffffffff)  */
/* =========================================================  F1AC  ========================================================== */
#define MDR_ADCUI_F1AC_VRMSOS_Pos         (0UL)                     /*!< MDR_ADCUI F1AC: VRMSOS (Bit 0)                        */
#define MDR_ADCUI_F1AC_VRMSOS_Msk         (0xfffUL)                 /*!< MDR_ADCUI F1AC: VRMSOS (Bitfield-Mask: 0xfff)         */
#define MDR_ADCUI_F1AC_VAGAIN_Pos         (16UL)                    /*!< MDR_ADCUI F1AC: VAGAIN (Bit 16)                       */
#define MDR_ADCUI_F1AC_VAGAIN_Msk         (0xfff0000UL)             /*!< MDR_ADCUI F1AC: VAGAIN (Bitfield-Mask: 0xfff)         */
/* =========================================================  F1VR  ========================================================== */
#define MDR_ADCUI_F1VR_VAHR_Pos           (0UL)                     /*!< MDR_ADCUI F1VR: VAHR (Bit 0)                          */
#define MDR_ADCUI_F1VR_VAHR_Msk           (0xffffffffUL)            /*!< MDR_ADCUI F1VR: VAHR (Bitfield-Mask: 0xffffffff)      */
/* =========================================================  F1MD0  ========================================================= */
#define MDR_ADCUI_F1MD0_VSEL_Pos          (0UL)                     /*!< MDR_ADCUI F1MD0: VSEL (Bit 0)                         */
#define MDR_ADCUI_F1MD0_VSEL_Msk          (0x3UL)                   /*!< MDR_ADCUI F1MD0: VSEL (Bitfield-Mask: 0x03)           */
#define MDR_ADCUI_F1MD0_ISEL_Pos          (2UL)                     /*!< MDR_ADCUI F1MD0: ISEL (Bit 2)                         */
#define MDR_ADCUI_F1MD0_ISEL_Msk          (0xcUL)                   /*!< MDR_ADCUI F1MD0: ISEL (Bitfield-Mask: 0x03)           */
#define MDR_ADCUI_F1MD0_ACTS_Pos          (4UL)                     /*!< MDR_ADCUI F1MD0: ACTS (Bit 4)                         */
#define MDR_ADCUI_F1MD0_ACTS_Msk          (0x10UL)                  /*!< MDR_ADCUI F1MD0: ACTS (Bitfield-Mask: 0x01)           */
#define MDR_ADCUI_F1MD0_REACTS_Pos        (5UL)                     /*!< MDR_ADCUI F1MD0: REACTS (Bit 5)                       */
#define MDR_ADCUI_F1MD0_REACTS_Msk        (0x20UL)                  /*!< MDR_ADCUI F1MD0: REACTS (Bitfield-Mask: 0x01)         */
#define MDR_ADCUI_F1MD0_IGAIN_Pos         (6UL)                     /*!< MDR_ADCUI F1MD0: IGAIN (Bit 6)                        */
#define MDR_ADCUI_F1MD0_IGAIN_Msk         (0x40UL)                  /*!< MDR_ADCUI F1MD0: IGAIN (Bitfield-Mask: 0x01)          */
#define MDR_ADCUI_F1MD0_VGAIN_Pos         (7UL)                     /*!< MDR_ADCUI F1MD0: VGAIN (Bit 7)                        */
#define MDR_ADCUI_F1MD0_VGAIN_Msk         (0x80UL)                  /*!< MDR_ADCUI F1MD0: VGAIN (Bitfield-Mask: 0x01)          */
#define MDR_ADCUI_F1MD0_PER_FREQ_Pos      (12UL)                    /*!< MDR_ADCUI F1MD0: PER_FREQ (Bit 12)                    */
#define MDR_ADCUI_F1MD0_PER_FREQ_Msk      (0x1ffff000UL)            /*!< MDR_ADCUI F1MD0: PER_FREQ (Bitfield-Mask: 0x1ffff)    */
/* =========================================================  F1MD1  ========================================================= */
#define MDR_ADCUI_F1MD1_IPKLVL_Pos        (0UL)                     /*!< MDR_ADCUI F1MD1: IPKLVL (Bit 0)                       */
#define MDR_ADCUI_F1MD1_IPKLVL_Msk        (0xffffUL)                /*!< MDR_ADCUI F1MD1: IPKLVL (Bitfield-Mask: 0xffff)       */
#define MDR_ADCUI_F1MD1_VPKLVL_Pos        (16UL)                    /*!< MDR_ADCUI F1MD1: VPKLVL (Bit 16)                      */
#define MDR_ADCUI_F1MD1_VPKLVL_Msk        (0xffff0000UL)            /*!< MDR_ADCUI F1MD1: VPKLVL (Bitfield-Mask: 0xffff)       */
/* =========================================================  F1MD2  ========================================================= */
#define MDR_ADCUI_F1MD2_PhaseV_toV0_Pos   (0UL)                     /*!< MDR_ADCUI F1MD2: PhaseV_toV0 (Bit 0)                  */
#define MDR_ADCUI_F1MD2_PhaseV_toV0_Msk   (0x1ffffUL)               /*!< MDR_ADCUI F1MD2: PhaseV_toV0 (Bitfield-Mask: 0x1ffff) */
/* ========================================================  F1VPEAK  ======================================================== */
#define MDR_ADCUI_F1VPEAK_IPEAK_Pos       (0UL)                     /*!< MDR_ADCUI F1VPEAK: IPEAK (Bit 0)                      */
#define MDR_ADCUI_F1VPEAK_IPEAK_Msk       (0xffffffUL)              /*!< MDR_ADCUI F1VPEAK: IPEAK (Bitfield-Mask: 0xffffff)    */
/* ========================================================  F1IPEAK  ======================================================== */
#define MDR_ADCUI_F1IPEAK_IPEAK_Pos       (0UL)                     /*!< MDR_ADCUI F1IPEAK: IPEAK (Bit 0)                      */
#define MDR_ADCUI_F1IPEAK_IPEAK_Msk       (0xffffffUL)              /*!< MDR_ADCUI F1IPEAK: IPEAK (Bitfield-Mask: 0xffffff)    */
/* ========================================================  F1VDAT  ========================================================= */
#define MDR_ADCUI_F1VDAT_VDAT_Pos         (0UL)                     /*!< MDR_ADCUI F1VDAT: VDAT (Bit 0)                        */
#define MDR_ADCUI_F1VDAT_VDAT_Msk         (0xffffffUL)              /*!< MDR_ADCUI F1VDAT: VDAT (Bitfield-Mask: 0xffffff)      */
/* ========================================================  F1IDAT  ========================================================= */
#define MDR_ADCUI_F1IDAT_IDAT_Pos         (0UL)                     /*!< MDR_ADCUI F1IDAT: IDAT (Bit 0)                        */
#define MDR_ADCUI_F1IDAT_IDAT_Msk         (0xffffffUL)              /*!< MDR_ADCUI F1IDAT: IDAT (Bitfield-Mask: 0xffffff)      */
/* ========================================================  F1VRMS  ========================================================= */
#define MDR_ADCUI_F1VRMS_VRMS_Pos         (0UL)                     /*!< MDR_ADCUI F1VRMS: VRMS (Bit 0)                        */
#define MDR_ADCUI_F1VRMS_VRMS_Msk         (0xffffffUL)              /*!< MDR_ADCUI F1VRMS: VRMS (Bitfield-Mask: 0xffffff)      */
/* ========================================================  F1VRMS2  ======================================================== */
#define MDR_ADCUI_F1VRMS2_VRMS2_Pos       (0UL)                     /*!< MDR_ADCUI F1VRMS2: VRMS2 (Bit 0)                      */
#define MDR_ADCUI_F1VRMS2_VRMS2_Msk       (0xffffffUL)              /*!< MDR_ADCUI F1VRMS2: VRMS2 (Bitfield-Mask: 0xffffff)    */
/* ========================================================  F1IRMS  ========================================================= */
#define MDR_ADCUI_F1IRMS_IRMS_Pos         (0UL)                     /*!< MDR_ADCUI F1IRMS: IRMS (Bit 0)                        */
#define MDR_ADCUI_F1IRMS_IRMS_Msk         (0xffffffUL)              /*!< MDR_ADCUI F1IRMS: IRMS (Bitfield-Mask: 0xffffff)      */
/* ========================================================  F1IRMS2  ======================================================== */
#define MDR_ADCUI_F1IRMS2_IRMS2_Pos       (0UL)                     /*!< MDR_ADCUI F1IRMS2: IRMS2 (Bit 0)                      */
#define MDR_ADCUI_F1IRMS2_IRMS2_Msk       (0xffffffUL)              /*!< MDR_ADCUI F1IRMS2: IRMS2 (Bitfield-Mask: 0xffffff)    */
/* ========================================================  F1STAT  ========================================================= */
#define MDR_ADCUI_F1STAT_VF_EMP_Pos       (0UL)                     /*!< MDR_ADCUI F1STAT: VF_EMP (Bit 0)                      */
#define MDR_ADCUI_F1STAT_VF_EMP_Msk       (0x1UL)                   /*!< MDR_ADCUI F1STAT: VF_EMP (Bitfield-Mask: 0x01)        */
#define MDR_ADCUI_F1STAT_VF_FLL_Pos       (1UL)                     /*!< MDR_ADCUI F1STAT: VF_FLL (Bit 1)                      */
#define MDR_ADCUI_F1STAT_VF_FLL_Msk       (0x2UL)                   /*!< MDR_ADCUI F1STAT: VF_FLL (Bitfield-Mask: 0x01)        */
#define MDR_ADCUI_F1STAT_VF_OVER_Pos      (2UL)                     /*!< MDR_ADCUI F1STAT: VF_OVER (Bit 2)                     */
#define MDR_ADCUI_F1STAT_VF_OVER_Msk      (0x4UL)                   /*!< MDR_ADCUI F1STAT: VF_OVER (Bitfield-Mask: 0x01)       */
#define MDR_ADCUI_F1STAT_IF_EMP_Pos       (3UL)                     /*!< MDR_ADCUI F1STAT: IF_EMP (Bit 3)                      */
#define MDR_ADCUI_F1STAT_IF_EMP_Msk       (0x8UL)                   /*!< MDR_ADCUI F1STAT: IF_EMP (Bitfield-Mask: 0x01)        */
