StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VK234.h
#define MDR_ADCUI_F1STAT_IF_FLL_Pos       (4UL)                     /*!< MDR_ADCUI F1STAT: IF_FLL (Bit 4)                      */
#define MDR_ADCUI_F1STAT_IF_FLL_Msk       (0x10UL)                  /*!< MDR_ADCUI F1STAT: IF_FLL (Bitfield-Mask: 0x01)        */
#define MDR_ADCUI_F1STAT_IF_OVER_Pos      (5UL)                     /*!< MDR_ADCUI F1STAT: IF_OVER (Bit 5)                     */
#define MDR_ADCUI_F1STAT_IF_OVER_Msk      (0x20UL)                  /*!< MDR_ADCUI F1STAT: IF_OVER (Bitfield-Mask: 0x01)       */
#define MDR_ADCUI_F1STAT_SAGF_Pos         (6UL)                     /*!< MDR_ADCUI F1STAT: SAGF (Bit 6)                        */
#define MDR_ADCUI_F1STAT_SAGF_Msk         (0x40UL)                  /*!< MDR_ADCUI F1STAT: SAGF (Bitfield-Mask: 0x01)          */
#define MDR_ADCUI_F1STAT_PEAKVF_Pos       (7UL)                     /*!< MDR_ADCUI F1STAT: PEAKVF (Bit 7)                      */
#define MDR_ADCUI_F1STAT_PEAKVF_Msk       (0x80UL)                  /*!< MDR_ADCUI F1STAT: PEAKVF (Bitfield-Mask: 0x01)        */
#define MDR_ADCUI_F1STAT_PEAKIF_Pos       (8UL)                     /*!< MDR_ADCUI F1STAT: PEAKIF (Bit 8)                      */
#define MDR_ADCUI_F1STAT_PEAKIF_Msk       (0x100UL)                 /*!< MDR_ADCUI F1STAT: PEAKIF (Bitfield-Mask: 0x01)        */
#define MDR_ADCUI_F1STAT_WATTOVP_Pos      (9UL)                     /*!< MDR_ADCUI F1STAT: WATTOVP (Bit 9)                     */
#define MDR_ADCUI_F1STAT_WATTOVP_Msk      (0x200UL)                 /*!< MDR_ADCUI F1STAT: WATTOVP (Bitfield-Mask: 0x01)       */
#define MDR_ADCUI_F1STAT_VAROVP_Pos       (10UL)                    /*!< MDR_ADCUI F1STAT: VAROVP (Bit 10)                     */
#define MDR_ADCUI_F1STAT_VAROVP_Msk       (0x400UL)                 /*!< MDR_ADCUI F1STAT: VAROVP (Bitfield-Mask: 0x01)        */
#define MDR_ADCUI_F1STAT_VAOV_Pos         (11UL)                    /*!< MDR_ADCUI F1STAT: VAOV (Bit 11)                       */
#define MDR_ADCUI_F1STAT_VAOV_Msk         (0x800UL)                 /*!< MDR_ADCUI F1STAT: VAOV (Bitfield-Mask: 0x01)          */
#define MDR_ADCUI_F1STAT_ZTXVF_Pos        (12UL)                    /*!< MDR_ADCUI F1STAT: ZTXVF (Bit 12)                      */
#define MDR_ADCUI_F1STAT_ZTXVF_Msk        (0x1000UL)                /*!< MDR_ADCUI F1STAT: ZTXVF (Bitfield-Mask: 0x01)         */
#define MDR_ADCUI_F1STAT_APSIGN_Pos       (15UL)                    /*!< MDR_ADCUI F1STAT: APSIGN (Bit 15)                     */
#define MDR_ADCUI_F1STAT_APSIGN_Msk       (0x8000UL)                /*!< MDR_ADCUI F1STAT: APSIGN (Bitfield-Mask: 0x01)        */
#define MDR_ADCUI_F1STAT_APNLDFL_Pos      (16UL)                    /*!< MDR_ADCUI F1STAT: APNLDFL (Bit 16)                    */
#define MDR_ADCUI_F1STAT_APNLDFL_Msk      (0x10000UL)               /*!< MDR_ADCUI F1STAT: APNLDFL (Bitfield-Mask: 0x01)       */
#define MDR_ADCUI_F1STAT_VARSIGN_Pos      (17UL)                    /*!< MDR_ADCUI F1STAT: VARSIGN (Bit 17)                    */
#define MDR_ADCUI_F1STAT_VARSIGN_Msk      (0x20000UL)               /*!< MDR_ADCUI F1STAT: VARSIGN (Bitfield-Mask: 0x01)       */
#define MDR_ADCUI_F1STAT_VARNLDFL_Pos     (18UL)                    /*!< MDR_ADCUI F1STAT: VARNLDFL (Bit 18)                   */
#define MDR_ADCUI_F1STAT_VARNLDFL_Msk     (0x40000UL)               /*!< MDR_ADCUI F1STAT: VARNLDFL (Bitfield-Mask: 0x01)      */
#define MDR_ADCUI_F1STAT_VANLDFL_Pos      (20UL)                    /*!< MDR_ADCUI F1STAT: VANLDFL (Bit 20)                    */
#define MDR_ADCUI_F1STAT_VANLDFL_Msk      (0x100000UL)              /*!< MDR_ADCUI F1STAT: VANLDFL (Bitfield-Mask: 0x01)       */
#define MDR_ADCUI_F1STAT_ZEROCRS_Pos      (21UL)                    /*!< MDR_ADCUI F1STAT: ZEROCRS (Bit 21)                    */
#define MDR_ADCUI_F1STAT_ZEROCRS_Msk      (0x200000UL)              /*!< MDR_ADCUI F1STAT: ZEROCRS (Bitfield-Mask: 0x01)       */
#define MDR_ADCUI_F1STAT_WATTOVN_Pos      (25UL)                    /*!< MDR_ADCUI F1STAT: WATTOVN (Bit 25)                    */
#define MDR_ADCUI_F1STAT_WATTOVN_Msk      (0x2000000UL)             /*!< MDR_ADCUI F1STAT: WATTOVN (Bitfield-Mask: 0x01)       */
#define MDR_ADCUI_F1STAT_VAROVN_Pos       (26UL)                    /*!< MDR_ADCUI F1STAT: VAROVN (Bit 26)                     */
#define MDR_ADCUI_F1STAT_VAROVN_Msk       (0x4000000UL)             /*!< MDR_ADCUI F1STAT: VAROVN (Bitfield-Mask: 0x01)        */
/* ========================================================  F1MASK  ========================================================= */
#define MDR_ADCUI_F1MASK_VF_EMPM_Pos      (0UL)                     /*!< MDR_ADCUI F1MASK: VF_EMPM (Bit 0)                     */
#define MDR_ADCUI_F1MASK_VF_EMPM_Msk      (0x1UL)                   /*!< MDR_ADCUI F1MASK: VF_EMPM (Bitfield-Mask: 0x01)       */
#define MDR_ADCUI_F1MASK_VF_FLLM_Pos      (1UL)                     /*!< MDR_ADCUI F1MASK: VF_FLLM (Bit 1)                     */
#define MDR_ADCUI_F1MASK_VF_FLLM_Msk      (0x2UL)                   /*!< MDR_ADCUI F1MASK: VF_FLLM (Bitfield-Mask: 0x01)       */
#define MDR_ADCUI_F1MASK_VF_OVERM_Pos     (2UL)                     /*!< MDR_ADCUI F1MASK: VF_OVERM (Bit 2)                    */
#define MDR_ADCUI_F1MASK_VF_OVERM_Msk     (0x4UL)                   /*!< MDR_ADCUI F1MASK: VF_OVERM (Bitfield-Mask: 0x01)      */
#define MDR_ADCUI_F1MASK_IF_EMPM_Pos      (3UL)                     /*!< MDR_ADCUI F1MASK: IF_EMPM (Bit 3)                     */
#define MDR_ADCUI_F1MASK_IF_EMPM_Msk      (0x8UL)                   /*!< MDR_ADCUI F1MASK: IF_EMPM (Bitfield-Mask: 0x01)       */
#define MDR_ADCUI_F1MASK_IF_FLLM_Pos      (4UL)                     /*!< MDR_ADCUI F1MASK: IF_FLLM (Bit 4)                     */
#define MDR_ADCUI_F1MASK_IF_FLLM_Msk      (0x10UL)                  /*!< MDR_ADCUI F1MASK: IF_FLLM (Bitfield-Mask: 0x01)       */
#define MDR_ADCUI_F1MASK_IF_OVERM_Pos     (5UL)                     /*!< MDR_ADCUI F1MASK: IF_OVERM (Bit 5)                    */
#define MDR_ADCUI_F1MASK_IF_OVERM_Msk     (0x20UL)                  /*!< MDR_ADCUI F1MASK: IF_OVERM (Bitfield-Mask: 0x01)      */
#define MDR_ADCUI_F1MASK_SAGFM_Pos        (6UL)                     /*!< MDR_ADCUI F1MASK: SAGFM (Bit 6)                       */
#define MDR_ADCUI_F1MASK_SAGFM_Msk        (0x40UL)                  /*!< MDR_ADCUI F1MASK: SAGFM (Bitfield-Mask: 0x01)         */
#define MDR_ADCUI_F1MASK_PEAKVFM_Pos      (7UL)                     /*!< MDR_ADCUI F1MASK: PEAKVFM (Bit 7)                     */
#define MDR_ADCUI_F1MASK_PEAKVFM_Msk      (0x80UL)                  /*!< MDR_ADCUI F1MASK: PEAKVFM (Bitfield-Mask: 0x01)       */
#define MDR_ADCUI_F1MASK_PEAKIFM_Pos      (8UL)                     /*!< MDR_ADCUI F1MASK: PEAKIFM (Bit 8)                     */
#define MDR_ADCUI_F1MASK_PEAKIFM_Msk      (0x100UL)                 /*!< MDR_ADCUI F1MASK: PEAKIFM (Bitfield-Mask: 0x01)       */
#define MDR_ADCUI_F1MASK_WATTOVPM_Pos     (9UL)                     /*!< MDR_ADCUI F1MASK: WATTOVPM (Bit 9)                    */
#define MDR_ADCUI_F1MASK_WATTOVPM_Msk     (0x200UL)                 /*!< MDR_ADCUI F1MASK: WATTOVPM (Bitfield-Mask: 0x01)      */
#define MDR_ADCUI_F1MASK_VAROVPM_Pos      (10UL)                    /*!< MDR_ADCUI F1MASK: VAROVPM (Bit 10)                    */
#define MDR_ADCUI_F1MASK_VAROVPM_Msk      (0x400UL)                 /*!< MDR_ADCUI F1MASK: VAROVPM (Bitfield-Mask: 0x01)       */
#define MDR_ADCUI_F1MASK_VAOVM_Pos        (11UL)                    /*!< MDR_ADCUI F1MASK: VAOVM (Bit 11)                      */
#define MDR_ADCUI_F1MASK_VAOVM_Msk        (0x800UL)                 /*!< MDR_ADCUI F1MASK: VAOVM (Bitfield-Mask: 0x01)         */
#define MDR_ADCUI_F1MASK_ZTXVFM_Pos       (12UL)                    /*!< MDR_ADCUI F1MASK: ZTXVFM (Bit 12)                     */
#define MDR_ADCUI_F1MASK_ZTXVFM_Msk       (0x1000UL)                /*!< MDR_ADCUI F1MASK: ZTXVFM (Bitfield-Mask: 0x01)        */
#define MDR_ADCUI_F1MASK_APSIGNM_Pos      (15UL)                    /*!< MDR_ADCUI F1MASK: APSIGNM (Bit 15)                    */
#define MDR_ADCUI_F1MASK_APSIGNM_Msk      (0x8000UL)                /*!< MDR_ADCUI F1MASK: APSIGNM (Bitfield-Mask: 0x01)       */
#define MDR_ADCUI_F1MASK_APNLDFLM_Pos     (16UL)                    /*!< MDR_ADCUI F1MASK: APNLDFLM (Bit 16)                   */
#define MDR_ADCUI_F1MASK_APNLDFLM_Msk     (0x10000UL)               /*!< MDR_ADCUI F1MASK: APNLDFLM (Bitfield-Mask: 0x01)      */
#define MDR_ADCUI_F1MASK_VARSIGNM_Pos     (17UL)                    /*!< MDR_ADCUI F1MASK: VARSIGNM (Bit 17)                   */
#define MDR_ADCUI_F1MASK_VARSIGNM_Msk     (0x20000UL)               /*!< MDR_ADCUI F1MASK: VARSIGNM (Bitfield-Mask: 0x01)      */
#define MDR_ADCUI_F1MASK_VARNLDFLM_Pos    (18UL)                    /*!< MDR_ADCUI F1MASK: VARNLDFLM (Bit 18)                  */
#define MDR_ADCUI_F1MASK_VARNLDFLM_Msk    (0x40000UL)               /*!< MDR_ADCUI F1MASK: VARNLDFLM (Bitfield-Mask: 0x01)     */
#define MDR_ADCUI_F1MASK_VANLDFLM_Pos     (20UL)                    /*!< MDR_ADCUI F1MASK: VANLDFLM (Bit 20)                   */
#define MDR_ADCUI_F1MASK_VANLDFLM_Msk     (0x100000UL)              /*!< MDR_ADCUI F1MASK: VANLDFLM (Bitfield-Mask: 0x01)      */
#define MDR_ADCUI_F1MASK_ZEROCRSM_Pos     (21UL)                    /*!< MDR_ADCUI F1MASK: ZEROCRSM (Bit 21)                   */
#define MDR_ADCUI_F1MASK_ZEROCRSM_Msk     (0x200000UL)              /*!< MDR_ADCUI F1MASK: ZEROCRSM (Bitfield-Mask: 0x01)      */
#define MDR_ADCUI_F1MASK_WATTOVNM_Pos     (25UL)                    /*!< MDR_ADCUI F1MASK: WATTOVNM (Bit 25)                   */
#define MDR_ADCUI_F1MASK_WATTOVNM_Msk     (0x2000000UL)             /*!< MDR_ADCUI F1MASK: WATTOVNM (Bitfield-Mask: 0x01)      */
#define MDR_ADCUI_F1MASK_VAROVNM_Pos      (26UL)                    /*!< MDR_ADCUI F1MASK: VAROVNM (Bit 26)                    */
#define MDR_ADCUI_F1MASK_VAROVNM_Msk      (0x4000000UL)             /*!< MDR_ADCUI F1MASK: VAROVNM (Bitfield-Mask: 0x01)       */
/* =========================================================  F2CTR  ========================================================= */
#define MDR_ADCUI_F2CTR_INTEN_Pos         (0UL)                     /*!< MDR_ADCUI F2CTR: INTEN (Bit 0)                        */
#define MDR_ADCUI_F2CTR_INTEN_Msk         (0x1UL)                   /*!< MDR_ADCUI F2CTR: INTEN (Bitfield-Mask: 0x01)          */
#define MDR_ADCUI_F2CTR_VASEL_Pos         (2UL)                     /*!< MDR_ADCUI F2CTR: VASEL (Bit 2)                        */
#define MDR_ADCUI_F2CTR_VASEL_Msk         (0x4UL)                   /*!< MDR_ADCUI F2CTR: VASEL (Bitfield-Mask: 0x01)          */
#define MDR_ADCUI_F2CTR_RARS_Pos          (3UL)                     /*!< MDR_ADCUI F2CTR: RARS (Bit 3)                         */
#define MDR_ADCUI_F2CTR_RARS_Msk          (0x8UL)                   /*!< MDR_ADCUI F2CTR: RARS (Bitfield-Mask: 0x01)           */
#define MDR_ADCUI_F2CTR_RRRS_Pos          (4UL)                     /*!< MDR_ADCUI F2CTR: RRRS (Bit 4)                         */
#define MDR_ADCUI_F2CTR_RRRS_Msk          (0x10UL)                  /*!< MDR_ADCUI F2CTR: RRRS (Bitfield-Mask: 0x01)           */
#define MDR_ADCUI_F2CTR_RVRS_Pos          (5UL)                     /*!< MDR_ADCUI F2CTR: RVRS (Bit 5)                         */
#define MDR_ADCUI_F2CTR_RVRS_Msk          (0x20UL)                  /*!< MDR_ADCUI F2CTR: RVRS (Bitfield-Mask: 0x01)           */
#define MDR_ADCUI_F2CTR_IGAIN_Pos         (6UL)                     /*!< MDR_ADCUI F2CTR: IGAIN (Bit 6)                        */
#define MDR_ADCUI_F2CTR_IGAIN_Msk         (0xc0UL)                  /*!< MDR_ADCUI F2CTR: IGAIN (Bitfield-Mask: 0x03)          */
#define MDR_ADCUI_F2CTR_VGAIN_Pos         (8UL)                     /*!< MDR_ADCUI F2CTR: VGAIN (Bit 8)                        */
#define MDR_ADCUI_F2CTR_VGAIN_Msk         (0x300UL)                 /*!< MDR_ADCUI F2CTR: VGAIN (Bitfield-Mask: 0x03)          */
#define MDR_ADCUI_F2CTR_VPHASE_Pos        (10UL)                    /*!< MDR_ADCUI F2CTR: VPHASE (Bit 10)                      */
#define MDR_ADCUI_F2CTR_VPHASE_Msk        (0x3fc00UL)               /*!< MDR_ADCUI F2CTR: VPHASE (Bitfield-Mask: 0xff)         */
#define MDR_ADCUI_F2CTR_IRMSOS_Pos        (20UL)                    /*!< MDR_ADCUI F2CTR: IRMSOS (Bit 20)                      */
#define MDR_ADCUI_F2CTR_IRMSOS_Msk        (0xfff00000UL)            /*!< MDR_ADCUI F2CTR: IRMSOS (Bitfield-Mask: 0xfff)        */
/* =========================================================  F2WC  ========================================================== */
#define MDR_ADCUI_F2WC_WATTOS_Pos         (0UL)                     /*!< MDR_ADCUI F2WC: WATTOS (Bit 0)                        */
#define MDR_ADCUI_F2WC_WATTOS_Msk         (0xffffUL)                /*!< MDR_ADCUI F2WC: WATTOS (Bitfield-Mask: 0xffff)        */
#define MDR_ADCUI_F2WC_WGAIN_Pos          (16UL)                    /*!< MDR_ADCUI F2WC: WGAIN (Bit 16)                        */
#define MDR_ADCUI_F2WC_WGAIN_Msk          (0xfff0000UL)             /*!< MDR_ADCUI F2WC: WGAIN (Bitfield-Mask: 0xfff)          */
/* ========================================================  F2WATTP  ======================================================== */
#define MDR_ADCUI_F2WATTP_WATTHRP_Pos     (0UL)                     /*!< MDR_ADCUI F2WATTP: WATTHRP (Bit 0)                    */
#define MDR_ADCUI_F2WATTP_WATTHRP_Msk     (0xffffffffUL)            /*!< MDR_ADCUI F2WATTP: WATTHRP (Bitfield-Mask: 0xffffffff) */
/* ========================================================  F2WATTN  ======================================================== */
#define MDR_ADCUI_F2WATTN_WATTHRN_Pos     (0UL)                     /*!< MDR_ADCUI F2WATTN: WATTHRN (Bit 0)                    */
#define MDR_ADCUI_F2WATTN_WATTHRN_Msk     (0xffffffffUL)            /*!< MDR_ADCUI F2WATTN: WATTHRN (Bitfield-Mask: 0xffffffff) */
/* =========================================================  F2VC  ========================================================== */
#define MDR_ADCUI_F2VC_VAROS_Pos          (0UL)                     /*!< MDR_ADCUI F2VC: VAROS (Bit 0)                         */
#define MDR_ADCUI_F2VC_VAROS_Msk          (0xffffUL)                /*!< MDR_ADCUI F2VC: VAROS (Bitfield-Mask: 0xffff)         */
#define MDR_ADCUI_F2VC_VARGAIN_Pos        (16UL)                    /*!< MDR_ADCUI F2VC: VARGAIN (Bit 16)                      */
#define MDR_ADCUI_F2VC_VARGAIN_Msk        (0xfff0000UL)             /*!< MDR_ADCUI F2VC: VARGAIN (Bitfield-Mask: 0xfff)        */
/* ========================================================  F2VARP  ========================================================= */
#define MDR_ADCUI_F2VARP_VARHRP_Pos       (0UL)                     /*!< MDR_ADCUI F2VARP: VARHRP (Bit 0)                      */
#define MDR_ADCUI_F2VARP_VARHRP_Msk       (0xffffffffUL)            /*!< MDR_ADCUI F2VARP: VARHRP (Bitfield-Mask: 0xffffffff)  */
/* ========================================================  F2VARN  ========================================================= */
#define MDR_ADCUI_F2VARN_VARHRN_Pos       (0UL)                     /*!< MDR_ADCUI F2VARN: VARHRN (Bit 0)                      */
#define MDR_ADCUI_F2VARN_VARHRN_Msk       (0xffffffffUL)            /*!< MDR_ADCUI F2VARN: VARHRN (Bitfield-Mask: 0xffffffff)  */
/* =========================================================  F2AC  ========================================================== */
#define MDR_ADCUI_F2AC_VRMSOS_Pos         (0UL)                     /*!< MDR_ADCUI F2AC: VRMSOS (Bit 0)                        */
#define MDR_ADCUI_F2AC_VRMSOS_Msk         (0xfffUL)                 /*!< MDR_ADCUI F2AC: VRMSOS (Bitfield-Mask: 0xfff)         */
#define MDR_ADCUI_F2AC_VAGAIN_Pos         (16UL)                    /*!< MDR_ADCUI F2AC: VAGAIN (Bit 16)                       */
#define MDR_ADCUI_F2AC_VAGAIN_Msk         (0xfff0000UL)             /*!< MDR_ADCUI F2AC: VAGAIN (Bitfield-Mask: 0xfff)         */
/* =========================================================  F2VR  ========================================================== */
#define MDR_ADCUI_F2VR_VAHR_Pos           (0UL)                     /*!< MDR_ADCUI F2VR: VAHR (Bit 0)                          */
#define MDR_ADCUI_F2VR_VAHR_Msk           (0xffffffffUL)            /*!< MDR_ADCUI F2VR: VAHR (Bitfield-Mask: 0xffffffff)      */
/* =========================================================  F2MD0  ========================================================= */
#define MDR_ADCUI_F2MD0_VSEL_Pos          (0UL)                     /*!< MDR_ADCUI F2MD0: VSEL (Bit 0)                         */
#define MDR_ADCUI_F2MD0_VSEL_Msk          (0x3UL)                   /*!< MDR_ADCUI F2MD0: VSEL (Bitfield-Mask: 0x03)           */
#define MDR_ADCUI_F2MD0_ISEL_Pos          (2UL)                     /*!< MDR_ADCUI F2MD0: ISEL (Bit 2)                         */
#define MDR_ADCUI_F2MD0_ISEL_Msk          (0xcUL)                   /*!< MDR_ADCUI F2MD0: ISEL (Bitfield-Mask: 0x03)           */
#define MDR_ADCUI_F2MD0_ACTS_Pos          (4UL)                     /*!< MDR_ADCUI F2MD0: ACTS (Bit 4)                         */
#define MDR_ADCUI_F2MD0_ACTS_Msk          (0x10UL)                  /*!< MDR_ADCUI F2MD0: ACTS (Bitfield-Mask: 0x01)           */
#define MDR_ADCUI_F2MD0_REACTS_Pos        (5UL)                     /*!< MDR_ADCUI F2MD0: REACTS (Bit 5)                       */
#define MDR_ADCUI_F2MD0_REACTS_Msk        (0x20UL)                  /*!< MDR_ADCUI F2MD0: REACTS (Bitfield-Mask: 0x01)         */
#define MDR_ADCUI_F2MD0_IGAIN_Pos         (6UL)                     /*!< MDR_ADCUI F2MD0: IGAIN (Bit 6)                        */
#define MDR_ADCUI_F2MD0_IGAIN_Msk         (0x40UL)                  /*!< MDR_ADCUI F2MD0: IGAIN (Bitfield-Mask: 0x01)          */
#define MDR_ADCUI_F2MD0_VGAIN_Pos         (7UL)                     /*!< MDR_ADCUI F2MD0: VGAIN (Bit 7)                        */
#define MDR_ADCUI_F2MD0_VGAIN_Msk         (0x80UL)                  /*!< MDR_ADCUI F2MD0: VGAIN (Bitfield-Mask: 0x01)          */
#define MDR_ADCUI_F2MD0_PER_FREQ_Pos      (12UL)                    /*!< MDR_ADCUI F2MD0: PER_FREQ (Bit 12)                    */
#define MDR_ADCUI_F2MD0_PER_FREQ_Msk      (0x1ffff000UL)            /*!< MDR_ADCUI F2MD0: PER_FREQ (Bitfield-Mask: 0x1ffff)    */
/* =========================================================  F2MD1  ========================================================= */
#define MDR_ADCUI_F2MD1_IPKLVL_Pos        (0UL)                     /*!< MDR_ADCUI F2MD1: IPKLVL (Bit 0)                       */
#define MDR_ADCUI_F2MD1_IPKLVL_Msk        (0xffffUL)                /*!< MDR_ADCUI F2MD1: IPKLVL (Bitfield-Mask: 0xffff)       */
#define MDR_ADCUI_F2MD1_VPKLVL_Pos        (16UL)                    /*!< MDR_ADCUI F2MD1: VPKLVL (Bit 16)                      */
#define MDR_ADCUI_F2MD1_VPKLVL_Msk        (0xffff0000UL)            /*!< MDR_ADCUI F2MD1: VPKLVL (Bitfield-Mask: 0xffff)       */
/* =========================================================  F2MD2  ========================================================= */
#define MDR_ADCUI_F2MD2_PhaseV_toV0_Pos   (0UL)                     /*!< MDR_ADCUI F2MD2: PhaseV_toV0 (Bit 0)                  */
#define MDR_ADCUI_F2MD2_PhaseV_toV0_Msk   (0x1ffffUL)               /*!< MDR_ADCUI F2MD2: PhaseV_toV0 (Bitfield-Mask: 0x1ffff) */
/* ========================================================  F2VPEAK  ======================================================== */
#define MDR_ADCUI_F2VPEAK_IPEAK_Pos       (0UL)                     /*!< MDR_ADCUI F2VPEAK: IPEAK (Bit 0)                      */
#define MDR_ADCUI_F2VPEAK_IPEAK_Msk       (0xffffffUL)              /*!< MDR_ADCUI F2VPEAK: IPEAK (Bitfield-Mask: 0xffffff)    */
/* ========================================================  F2IPEAK  ======================================================== */
#define MDR_ADCUI_F2IPEAK_IPEAK_Pos       (0UL)                     /*!< MDR_ADCUI F2IPEAK: IPEAK (Bit 0)                      */
#define MDR_ADCUI_F2IPEAK_IPEAK_Msk       (0xffffffUL)              /*!< MDR_ADCUI F2IPEAK: IPEAK (Bitfield-Mask: 0xffffff)    */
/* ========================================================  F2VDAT  ========================================================= */
#define MDR_ADCUI_F2VDAT_VDAT_Pos         (0UL)                     /*!< MDR_ADCUI F2VDAT: VDAT (Bit 0)                        */
#define MDR_ADCUI_F2VDAT_VDAT_Msk         (0xffffffUL)              /*!< MDR_ADCUI F2VDAT: VDAT (Bitfield-Mask: 0xffffff)      */
/* ========================================================  F2IDAT  ========================================================= */
#define MDR_ADCUI_F2IDAT_IDAT_Pos         (0UL)                     /*!< MDR_ADCUI F2IDAT: IDAT (Bit 0)                        */
#define MDR_ADCUI_F2IDAT_IDAT_Msk         (0xffffffUL)              /*!< MDR_ADCUI F2IDAT: IDAT (Bitfield-Mask: 0xffffff)      */
/* ========================================================  F2VRMS  ========================================================= */
#define MDR_ADCUI_F2VRMS_VRMS_Pos         (0UL)                     /*!< MDR_ADCUI F2VRMS: VRMS (Bit 0)                        */
#define MDR_ADCUI_F2VRMS_VRMS_Msk         (0xffffffUL)              /*!< MDR_ADCUI F2VRMS: VRMS (Bitfield-Mask: 0xffffff)      */
/* ========================================================  F2VRMS2  ======================================================== */
#define MDR_ADCUI_F2VRMS2_VRMS2_Pos       (0UL)                     /*!< MDR_ADCUI F2VRMS2: VRMS2 (Bit 0)                      */
#define MDR_ADCUI_F2VRMS2_VRMS2_Msk       (0xffffffUL)              /*!< MDR_ADCUI F2VRMS2: VRMS2 (Bitfield-Mask: 0xffffff)    */
/* ========================================================  F2IRMS  ========================================================= */
#define MDR_ADCUI_F2IRMS_IRMS_Pos         (0UL)                     /*!< MDR_ADCUI F2IRMS: IRMS (Bit 0)                        */
#define MDR_ADCUI_F2IRMS_IRMS_Msk         (0xffffffUL)              /*!< MDR_ADCUI F2IRMS: IRMS (Bitfield-Mask: 0xffffff)      */
/* ========================================================  F2IRMS2  ======================================================== */
#define MDR_ADCUI_F2IRMS2_IRMS2_Pos       (0UL)                     /*!< MDR_ADCUI F2IRMS2: IRMS2 (Bit 0)                      */
#define MDR_ADCUI_F2IRMS2_IRMS2_Msk       (0xffffffUL)              /*!< MDR_ADCUI F2IRMS2: IRMS2 (Bitfield-Mask: 0xffffff)    */
/* ========================================================  F2STAT  ========================================================= */
#define MDR_ADCUI_F2STAT_VF_EMP_Pos       (0UL)                     /*!< MDR_ADCUI F2STAT: VF_EMP (Bit 0)                      */
#define MDR_ADCUI_F2STAT_VF_EMP_Msk       (0x1UL)                   /*!< MDR_ADCUI F2STAT: VF_EMP (Bitfield-Mask: 0x01)        */
#define MDR_ADCUI_F2STAT_VF_FLL_Pos       (1UL)                     /*!< MDR_ADCUI F2STAT: VF_FLL (Bit 1)                      */
#define MDR_ADCUI_F2STAT_VF_FLL_Msk       (0x2UL)                   /*!< MDR_ADCUI F2STAT: VF_FLL (Bitfield-Mask: 0x01)        */
#define MDR_ADCUI_F2STAT_VF_OVER_Pos      (2UL)                     /*!< MDR_ADCUI F2STAT: VF_OVER (Bit 2)                     */
#define MDR_ADCUI_F2STAT_VF_OVER_Msk      (0x4UL)                   /*!< MDR_ADCUI F2STAT: VF_OVER (Bitfield-Mask: 0x01)       */
#define MDR_ADCUI_F2STAT_IF_EMP_Pos       (3UL)                     /*!< MDR_ADCUI F2STAT: IF_EMP (Bit 3)                      */
#define MDR_ADCUI_F2STAT_IF_EMP_Msk       (0x8UL)                   /*!< MDR_ADCUI F2STAT: IF_EMP (Bitfield-Mask: 0x01)        */
#define MDR_ADCUI_F2STAT_IF_FLL_Pos       (4UL)                     /*!< MDR_ADCUI F2STAT: IF_FLL (Bit 4)                      */
#define MDR_ADCUI_F2STAT_IF_FLL_Msk       (0x10UL)                  /*!< MDR_ADCUI F2STAT: IF_FLL (Bitfield-Mask: 0x01)        */
