StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VK234.h
#define MDR_ADCUI_F2STAT_IF_OVER_Pos      (5UL)                     /*!< MDR_ADCUI F2STAT: IF_OVER (Bit 5)                     */
#define MDR_ADCUI_F2STAT_IF_OVER_Msk      (0x20UL)                  /*!< MDR_ADCUI F2STAT: IF_OVER (Bitfield-Mask: 0x01)       */
#define MDR_ADCUI_F2STAT_SAGF_Pos         (6UL)                     /*!< MDR_ADCUI F2STAT: SAGF (Bit 6)                        */
#define MDR_ADCUI_F2STAT_SAGF_Msk         (0x40UL)                  /*!< MDR_ADCUI F2STAT: SAGF (Bitfield-Mask: 0x01)          */
#define MDR_ADCUI_F2STAT_PEAKVF_Pos       (7UL)                     /*!< MDR_ADCUI F2STAT: PEAKVF (Bit 7)                      */
#define MDR_ADCUI_F2STAT_PEAKVF_Msk       (0x80UL)                  /*!< MDR_ADCUI F2STAT: PEAKVF (Bitfield-Mask: 0x01)        */
#define MDR_ADCUI_F2STAT_PEAKIF_Pos       (8UL)                     /*!< MDR_ADCUI F2STAT: PEAKIF (Bit 8)                      */
#define MDR_ADCUI_F2STAT_PEAKIF_Msk       (0x100UL)                 /*!< MDR_ADCUI F2STAT: PEAKIF (Bitfield-Mask: 0x01)        */
#define MDR_ADCUI_F2STAT_WATTOVP_Pos      (9UL)                     /*!< MDR_ADCUI F2STAT: WATTOVP (Bit 9)                     */
#define MDR_ADCUI_F2STAT_WATTOVP_Msk      (0x200UL)                 /*!< MDR_ADCUI F2STAT: WATTOVP (Bitfield-Mask: 0x01)       */
#define MDR_ADCUI_F2STAT_VAROVP_Pos       (10UL)                    /*!< MDR_ADCUI F2STAT: VAROVP (Bit 10)                     */
#define MDR_ADCUI_F2STAT_VAROVP_Msk       (0x400UL)                 /*!< MDR_ADCUI F2STAT: VAROVP (Bitfield-Mask: 0x01)        */
#define MDR_ADCUI_F2STAT_VAOV_Pos         (11UL)                    /*!< MDR_ADCUI F2STAT: VAOV (Bit 11)                       */
#define MDR_ADCUI_F2STAT_VAOV_Msk         (0x800UL)                 /*!< MDR_ADCUI F2STAT: VAOV (Bitfield-Mask: 0x01)          */
#define MDR_ADCUI_F2STAT_ZTXVF_Pos        (12UL)                    /*!< MDR_ADCUI F2STAT: ZTXVF (Bit 12)                      */
#define MDR_ADCUI_F2STAT_ZTXVF_Msk        (0x1000UL)                /*!< MDR_ADCUI F2STAT: ZTXVF (Bitfield-Mask: 0x01)         */
#define MDR_ADCUI_F2STAT_APSIGN_Pos       (15UL)                    /*!< MDR_ADCUI F2STAT: APSIGN (Bit 15)                     */
#define MDR_ADCUI_F2STAT_APSIGN_Msk       (0x8000UL)                /*!< MDR_ADCUI F2STAT: APSIGN (Bitfield-Mask: 0x01)        */
#define MDR_ADCUI_F2STAT_APNLDFL_Pos      (16UL)                    /*!< MDR_ADCUI F2STAT: APNLDFL (Bit 16)                    */
#define MDR_ADCUI_F2STAT_APNLDFL_Msk      (0x10000UL)               /*!< MDR_ADCUI F2STAT: APNLDFL (Bitfield-Mask: 0x01)       */
#define MDR_ADCUI_F2STAT_VARSIGN_Pos      (17UL)                    /*!< MDR_ADCUI F2STAT: VARSIGN (Bit 17)                    */
#define MDR_ADCUI_F2STAT_VARSIGN_Msk      (0x20000UL)               /*!< MDR_ADCUI F2STAT: VARSIGN (Bitfield-Mask: 0x01)       */
#define MDR_ADCUI_F2STAT_VARNLDFL_Pos     (18UL)                    /*!< MDR_ADCUI F2STAT: VARNLDFL (Bit 18)                   */
#define MDR_ADCUI_F2STAT_VARNLDFL_Msk     (0x40000UL)               /*!< MDR_ADCUI F2STAT: VARNLDFL (Bitfield-Mask: 0x01)      */
#define MDR_ADCUI_F2STAT_VANLDFL_Pos      (20UL)                    /*!< MDR_ADCUI F2STAT: VANLDFL (Bit 20)                    */
#define MDR_ADCUI_F2STAT_VANLDFL_Msk      (0x100000UL)              /*!< MDR_ADCUI F2STAT: VANLDFL (Bitfield-Mask: 0x01)       */
#define MDR_ADCUI_F2STAT_ZEROCRS_Pos      (21UL)                    /*!< MDR_ADCUI F2STAT: ZEROCRS (Bit 21)                    */
#define MDR_ADCUI_F2STAT_ZEROCRS_Msk      (0x200000UL)              /*!< MDR_ADCUI F2STAT: ZEROCRS (Bitfield-Mask: 0x01)       */
#define MDR_ADCUI_F2STAT_WATTOVN_Pos      (25UL)                    /*!< MDR_ADCUI F2STAT: WATTOVN (Bit 25)                    */
#define MDR_ADCUI_F2STAT_WATTOVN_Msk      (0x2000000UL)             /*!< MDR_ADCUI F2STAT: WATTOVN (Bitfield-Mask: 0x01)       */
#define MDR_ADCUI_F2STAT_VAROVN_Pos       (26UL)                    /*!< MDR_ADCUI F2STAT: VAROVN (Bit 26)                     */
#define MDR_ADCUI_F2STAT_VAROVN_Msk       (0x4000000UL)             /*!< MDR_ADCUI F2STAT: VAROVN (Bitfield-Mask: 0x01)        */
/* ========================================================  F2MASK  ========================================================= */
#define MDR_ADCUI_F2MASK_VF_EMPM_Pos      (0UL)                     /*!< MDR_ADCUI F2MASK: VF_EMPM (Bit 0)                     */
#define MDR_ADCUI_F2MASK_VF_EMPM_Msk      (0x1UL)                   /*!< MDR_ADCUI F2MASK: VF_EMPM (Bitfield-Mask: 0x01)       */
#define MDR_ADCUI_F2MASK_VF_FLLM_Pos      (1UL)                     /*!< MDR_ADCUI F2MASK: VF_FLLM (Bit 1)                     */
#define MDR_ADCUI_F2MASK_VF_FLLM_Msk      (0x2UL)                   /*!< MDR_ADCUI F2MASK: VF_FLLM (Bitfield-Mask: 0x01)       */
#define MDR_ADCUI_F2MASK_VF_OVERM_Pos     (2UL)                     /*!< MDR_ADCUI F2MASK: VF_OVERM (Bit 2)                    */
#define MDR_ADCUI_F2MASK_VF_OVERM_Msk     (0x4UL)                   /*!< MDR_ADCUI F2MASK: VF_OVERM (Bitfield-Mask: 0x01)      */
#define MDR_ADCUI_F2MASK_IF_EMPM_Pos      (3UL)                     /*!< MDR_ADCUI F2MASK: IF_EMPM (Bit 3)                     */
#define MDR_ADCUI_F2MASK_IF_EMPM_Msk      (0x8UL)                   /*!< MDR_ADCUI F2MASK: IF_EMPM (Bitfield-Mask: 0x01)       */
#define MDR_ADCUI_F2MASK_IF_FLLM_Pos      (4UL)                     /*!< MDR_ADCUI F2MASK: IF_FLLM (Bit 4)                     */
#define MDR_ADCUI_F2MASK_IF_FLLM_Msk      (0x10UL)                  /*!< MDR_ADCUI F2MASK: IF_FLLM (Bitfield-Mask: 0x01)       */
#define MDR_ADCUI_F2MASK_IF_OVERM_Pos     (5UL)                     /*!< MDR_ADCUI F2MASK: IF_OVERM (Bit 5)                    */
#define MDR_ADCUI_F2MASK_IF_OVERM_Msk     (0x20UL)                  /*!< MDR_ADCUI F2MASK: IF_OVERM (Bitfield-Mask: 0x01)      */
#define MDR_ADCUI_F2MASK_SAGFM_Pos        (6UL)                     /*!< MDR_ADCUI F2MASK: SAGFM (Bit 6)                       */
#define MDR_ADCUI_F2MASK_SAGFM_Msk        (0x40UL)                  /*!< MDR_ADCUI F2MASK: SAGFM (Bitfield-Mask: 0x01)         */
#define MDR_ADCUI_F2MASK_PEAKVFM_Pos      (7UL)                     /*!< MDR_ADCUI F2MASK: PEAKVFM (Bit 7)                     */
#define MDR_ADCUI_F2MASK_PEAKVFM_Msk      (0x80UL)                  /*!< MDR_ADCUI F2MASK: PEAKVFM (Bitfield-Mask: 0x01)       */
#define MDR_ADCUI_F2MASK_PEAKIFM_Pos      (8UL)                     /*!< MDR_ADCUI F2MASK: PEAKIFM (Bit 8)                     */
#define MDR_ADCUI_F2MASK_PEAKIFM_Msk      (0x100UL)                 /*!< MDR_ADCUI F2MASK: PEAKIFM (Bitfield-Mask: 0x01)       */
#define MDR_ADCUI_F2MASK_WATTOVPM_Pos     (9UL)                     /*!< MDR_ADCUI F2MASK: WATTOVPM (Bit 9)                    */
#define MDR_ADCUI_F2MASK_WATTOVPM_Msk     (0x200UL)                 /*!< MDR_ADCUI F2MASK: WATTOVPM (Bitfield-Mask: 0x01)      */
#define MDR_ADCUI_F2MASK_VAROVPM_Pos      (10UL)                    /*!< MDR_ADCUI F2MASK: VAROVPM (Bit 10)                    */
#define MDR_ADCUI_F2MASK_VAROVPM_Msk      (0x400UL)                 /*!< MDR_ADCUI F2MASK: VAROVPM (Bitfield-Mask: 0x01)       */
#define MDR_ADCUI_F2MASK_VAOVM_Pos        (11UL)                    /*!< MDR_ADCUI F2MASK: VAOVM (Bit 11)                      */
#define MDR_ADCUI_F2MASK_VAOVM_Msk        (0x800UL)                 /*!< MDR_ADCUI F2MASK: VAOVM (Bitfield-Mask: 0x01)         */
#define MDR_ADCUI_F2MASK_ZTXVFM_Pos       (12UL)                    /*!< MDR_ADCUI F2MASK: ZTXVFM (Bit 12)                     */
#define MDR_ADCUI_F2MASK_ZTXVFM_Msk       (0x1000UL)                /*!< MDR_ADCUI F2MASK: ZTXVFM (Bitfield-Mask: 0x01)        */
#define MDR_ADCUI_F2MASK_APSIGNM_Pos      (15UL)                    /*!< MDR_ADCUI F2MASK: APSIGNM (Bit 15)                    */
#define MDR_ADCUI_F2MASK_APSIGNM_Msk      (0x8000UL)                /*!< MDR_ADCUI F2MASK: APSIGNM (Bitfield-Mask: 0x01)       */
#define MDR_ADCUI_F2MASK_APNLDFLM_Pos     (16UL)                    /*!< MDR_ADCUI F2MASK: APNLDFLM (Bit 16)                   */
#define MDR_ADCUI_F2MASK_APNLDFLM_Msk     (0x10000UL)               /*!< MDR_ADCUI F2MASK: APNLDFLM (Bitfield-Mask: 0x01)      */
#define MDR_ADCUI_F2MASK_VARSIGNM_Pos     (17UL)                    /*!< MDR_ADCUI F2MASK: VARSIGNM (Bit 17)                   */
#define MDR_ADCUI_F2MASK_VARSIGNM_Msk     (0x20000UL)               /*!< MDR_ADCUI F2MASK: VARSIGNM (Bitfield-Mask: 0x01)      */
#define MDR_ADCUI_F2MASK_VARNLDFLM_Pos    (18UL)                    /*!< MDR_ADCUI F2MASK: VARNLDFLM (Bit 18)                  */
#define MDR_ADCUI_F2MASK_VARNLDFLM_Msk    (0x40000UL)               /*!< MDR_ADCUI F2MASK: VARNLDFLM (Bitfield-Mask: 0x01)     */
#define MDR_ADCUI_F2MASK_VANLDFLM_Pos     (20UL)                    /*!< MDR_ADCUI F2MASK: VANLDFLM (Bit 20)                   */
#define MDR_ADCUI_F2MASK_VANLDFLM_Msk     (0x100000UL)              /*!< MDR_ADCUI F2MASK: VANLDFLM (Bitfield-Mask: 0x01)      */
#define MDR_ADCUI_F2MASK_ZEROCRSM_Pos     (21UL)                    /*!< MDR_ADCUI F2MASK: ZEROCRSM (Bit 21)                   */
#define MDR_ADCUI_F2MASK_ZEROCRSM_Msk     (0x200000UL)              /*!< MDR_ADCUI F2MASK: ZEROCRSM (Bitfield-Mask: 0x01)      */
#define MDR_ADCUI_F2MASK_WATTOVNM_Pos     (25UL)                    /*!< MDR_ADCUI F2MASK: WATTOVNM (Bit 25)                   */
#define MDR_ADCUI_F2MASK_WATTOVNM_Msk     (0x2000000UL)             /*!< MDR_ADCUI F2MASK: WATTOVNM (Bitfield-Mask: 0x01)      */
#define MDR_ADCUI_F2MASK_VAROVNM_Pos      (26UL)                    /*!< MDR_ADCUI F2MASK: VAROVNM (Bit 26)                    */
#define MDR_ADCUI_F2MASK_VAROVNM_Msk      (0x4000000UL)             /*!< MDR_ADCUI F2MASK: VAROVNM (Bitfield-Mask: 0x01)       */
/* =========================================================  CCAL1  ========================================================= */
#define MDR_ADCUI_CCAL1_V0BGAIN_Pos       (0UL)                     /*!< MDR_ADCUI CCAL1: V0BGAIN (Bit 0)                      */
#define MDR_ADCUI_CCAL1_V0BGAIN_Msk       (0xfffUL)                 /*!< MDR_ADCUI CCAL1: V0BGAIN (Bitfield-Mask: 0xfff)       */
#define MDR_ADCUI_CCAL1_I0BGAIN_Pos       (12UL)                    /*!< MDR_ADCUI CCAL1: I0BGAIN (Bit 12)                     */
#define MDR_ADCUI_CCAL1_I0BGAIN_Msk       (0xfff000UL)              /*!< MDR_ADCUI CCAL1: I0BGAIN (Bitfield-Mask: 0xfff)       */
/* =========================================================  CCAL2  ========================================================= */
#define MDR_ADCUI_CCAL2_V1BGAIN_Pos       (0UL)                     /*!< MDR_ADCUI CCAL2: V1BGAIN (Bit 0)                      */
#define MDR_ADCUI_CCAL2_V1BGAIN_Msk       (0xfffUL)                 /*!< MDR_ADCUI CCAL2: V1BGAIN (Bitfield-Mask: 0xfff)       */
#define MDR_ADCUI_CCAL2_I1BGAIN_Pos       (12UL)                    /*!< MDR_ADCUI CCAL2: I1BGAIN (Bit 12)                     */
#define MDR_ADCUI_CCAL2_I1BGAIN_Msk       (0xfff000UL)              /*!< MDR_ADCUI CCAL2: I1BGAIN (Bitfield-Mask: 0xfff)       */
/* =========================================================  CCAL3  ========================================================= */
#define MDR_ADCUI_CCAL3_V2BGAIN_Pos       (0UL)                     /*!< MDR_ADCUI CCAL3: V2BGAIN (Bit 0)                      */
#define MDR_ADCUI_CCAL3_V2BGAIN_Msk       (0xfffUL)                 /*!< MDR_ADCUI CCAL3: V2BGAIN (Bitfield-Mask: 0xfff)       */
#define MDR_ADCUI_CCAL3_I2BGAIN_Pos       (12UL)                    /*!< MDR_ADCUI CCAL3: I2BGAIN (Bit 12)                     */
#define MDR_ADCUI_CCAL3_I2BGAIN_Msk       (0xfff000UL)              /*!< MDR_ADCUI CCAL3: I2BGAIN (Bitfield-Mask: 0xfff)       */
/* =========================================================  CCAL4  ========================================================= */
#define MDR_ADCUI_CCAL4_I3BGAIN_Pos       (0UL)                     /*!< MDR_ADCUI CCAL4: I3BGAIN (Bit 0)                      */
#define MDR_ADCUI_CCAL4_I3BGAIN_Msk       (0xfffUL)                 /*!< MDR_ADCUI CCAL4: I3BGAIN (Bitfield-Mask: 0xfff)       */


/* =========================================================================================================================== */
/* ================                                         MDR_UART1                                         ================ */
/* =========================================================================================================================== */

