StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VK234.h
#define MDR_UART1_ICR_OE_IC_Msk           (0x400UL)                 /*!< MDR_UART1 ICR: OE_IC (Bitfield-Mask: 0x01)            */
/* =========================================================  DMACR  ========================================================= */
#define MDR_UART1_DMACR_RXDMAE_Pos        (0UL)                     /*!< MDR_UART1 DMACR: RXDMAE (Bit 0)                       */
#define MDR_UART1_DMACR_RXDMAE_Msk        (0x1UL)                   /*!< MDR_UART1 DMACR: RXDMAE (Bitfield-Mask: 0x01)         */
#define MDR_UART1_DMACR_TXDMAE_Pos        (1UL)                     /*!< MDR_UART1 DMACR: TXDMAE (Bit 1)                       */
#define MDR_UART1_DMACR_TXDMAE_Msk        (0x2UL)                   /*!< MDR_UART1 DMACR: TXDMAE (Bitfield-Mask: 0x01)         */
#define MDR_UART1_DMACR_DMAonErr_Pos      (2UL)                     /*!< MDR_UART1 DMACR: DMAonErr (Bit 2)                     */
#define MDR_UART1_DMACR_DMAonErr_Msk      (0x4UL)                   /*!< MDR_UART1 DMACR: DMAonErr (Bitfield-Mask: 0x01)       */
/* ==========================================================  TCR  ========================================================== */
#define MDR_UART1_TCR_ITEN_Pos            (0UL)                     /*!< MDR_UART1 TCR: ITEN (Bit 0)                           */
#define MDR_UART1_TCR_ITEN_Msk            (0x1UL)                   /*!< MDR_UART1 TCR: ITEN (Bitfield-Mask: 0x01)             */
#define MDR_UART1_TCR_TestFIFO_Pos        (1UL)                     /*!< MDR_UART1 TCR: TestFIFO (Bit 1)                       */
#define MDR_UART1_TCR_TestFIFO_Msk        (0x2UL)                   /*!< MDR_UART1 TCR: TestFIFO (Bitfield-Mask: 0x01)         */
#define MDR_UART1_TCR_SIRTest_Pos         (2UL)                     /*!< MDR_UART1 TCR: SIRTest (Bit 2)                        */
#define MDR_UART1_TCR_SIRTest_Msk         (0x4UL)                   /*!< MDR_UART1 TCR: SIRTest (Bitfield-Mask: 0x01)          */


/* =========================================================================================================================== */
/* ================                                         MDR_PORTA                                         ================ */
/* =========================================================================================================================== */

/* =========================================================  RXTX  ========================================================== */
#define MDR_PORTA_RXTX_Pin__Pos           (0UL)                     /*!< MDR_PORTA RXTX: Pin_ (Bit 0)                          */
#define MDR_PORTA_RXTX_Pin__Msk           (0x1UL)                   /*!< MDR_PORTA RXTX: Pin_ (Bitfield-Mask: 0x01)            */
/* ==========================================================  OE  =========================================================== */
#define MDR_PORTA_OE_Pin__Pos             (0UL)                     /*!< MDR_PORTA OE: Pin_ (Bit 0)                            */
#define MDR_PORTA_OE_Pin__Msk             (0x1UL)                   /*!< MDR_PORTA OE: Pin_ (Bitfield-Mask: 0x01)              */
/* =========================================================  FUNC  ========================================================== */
#define MDR_PORTA_FUNC_Pin__Pos           (0UL)                     /*!< MDR_PORTA FUNC: Pin_ (Bit 0)                          */
#define MDR_PORTA_FUNC_Pin__Msk           (0x3UL)                   /*!< MDR_PORTA FUNC: Pin_ (Bitfield-Mask: 0x03)            */
/* ========================================================  ANALOG  ========================================================= */
#define MDR_PORTA_ANALOG_Pin__Pos         (0UL)                     /*!< MDR_PORTA ANALOG: Pin_ (Bit 0)                        */
#define MDR_PORTA_ANALOG_Pin__Msk         (0x1UL)                   /*!< MDR_PORTA ANALOG: Pin_ (Bitfield-Mask: 0x01)          */
/* =========================================================  PULL  ========================================================== */
#define MDR_PORTA_PULL_Down_Pin_0_Pos     (0UL)                     /*!< MDR_PORTA PULL: Down_Pin_0 (Bit 0)                    */
#define MDR_PORTA_PULL_Down_Pin_0_Msk     (0x1UL)                   /*!< MDR_PORTA PULL: Down_Pin_0 (Bitfield-Mask: 0x01)      */
#define MDR_PORTA_PULL_Down_Pin_1_Pos     (1UL)                     /*!< MDR_PORTA PULL: Down_Pin_1 (Bit 1)                    */
#define MDR_PORTA_PULL_Down_Pin_1_Msk     (0x2UL)                   /*!< MDR_PORTA PULL: Down_Pin_1 (Bitfield-Mask: 0x01)      */
#define MDR_PORTA_PULL_Down_Pin_2_Pos     (2UL)                     /*!< MDR_PORTA PULL: Down_Pin_2 (Bit 2)                    */
#define MDR_PORTA_PULL_Down_Pin_2_Msk     (0x4UL)                   /*!< MDR_PORTA PULL: Down_Pin_2 (Bitfield-Mask: 0x01)      */
#define MDR_PORTA_PULL_Down_Pin_3_Pos     (3UL)                     /*!< MDR_PORTA PULL: Down_Pin_3 (Bit 3)                    */
#define MDR_PORTA_PULL_Down_Pin_3_Msk     (0x8UL)                   /*!< MDR_PORTA PULL: Down_Pin_3 (Bitfield-Mask: 0x01)      */
#define MDR_PORTA_PULL_Down_Pin_4_Pos     (4UL)                     /*!< MDR_PORTA PULL: Down_Pin_4 (Bit 4)                    */
#define MDR_PORTA_PULL_Down_Pin_4_Msk     (0x10UL)                  /*!< MDR_PORTA PULL: Down_Pin_4 (Bitfield-Mask: 0x01)      */
#define MDR_PORTA_PULL_Down_Pin_5_Pos     (5UL)                     /*!< MDR_PORTA PULL: Down_Pin_5 (Bit 5)                    */
#define MDR_PORTA_PULL_Down_Pin_5_Msk     (0x20UL)                  /*!< MDR_PORTA PULL: Down_Pin_5 (Bitfield-Mask: 0x01)      */
#define MDR_PORTA_PULL_Down_Pin_6_Pos     (6UL)                     /*!< MDR_PORTA PULL: Down_Pin_6 (Bit 6)                    */
#define MDR_PORTA_PULL_Down_Pin_6_Msk     (0x40UL)                  /*!< MDR_PORTA PULL: Down_Pin_6 (Bitfield-Mask: 0x01)      */
#define MDR_PORTA_PULL_Down_Pin_7_Pos     (7UL)                     /*!< MDR_PORTA PULL: Down_Pin_7 (Bit 7)                    */
#define MDR_PORTA_PULL_Down_Pin_7_Msk     (0x80UL)                  /*!< MDR_PORTA PULL: Down_Pin_7 (Bitfield-Mask: 0x01)      */
#define MDR_PORTA_PULL_Down_Pin_8_Pos     (8UL)                     /*!< MDR_PORTA PULL: Down_Pin_8 (Bit 8)                    */
#define MDR_PORTA_PULL_Down_Pin_8_Msk     (0x100UL)                 /*!< MDR_PORTA PULL: Down_Pin_8 (Bitfield-Mask: 0x01)      */
#define MDR_PORTA_PULL_Down_Pin_9_Pos     (9UL)                     /*!< MDR_PORTA PULL: Down_Pin_9 (Bit 9)                    */
#define MDR_PORTA_PULL_Down_Pin_9_Msk     (0x200UL)                 /*!< MDR_PORTA PULL: Down_Pin_9 (Bitfield-Mask: 0x01)      */
#define MDR_PORTA_PULL_Down_Pin_10_Pos    (10UL)                    /*!< MDR_PORTA PULL: Down_Pin_10 (Bit 10)                  */
#define MDR_PORTA_PULL_Down_Pin_10_Msk    (0x400UL)                 /*!< MDR_PORTA PULL: Down_Pin_10 (Bitfield-Mask: 0x01)     */
#define MDR_PORTA_PULL_Down_Pin_11_Pos    (11UL)                    /*!< MDR_PORTA PULL: Down_Pin_11 (Bit 11)                  */
#define MDR_PORTA_PULL_Down_Pin_11_Msk    (0x800UL)                 /*!< MDR_PORTA PULL: Down_Pin_11 (Bitfield-Mask: 0x01)     */
#define MDR_PORTA_PULL_Down_Pin_12_Pos    (12UL)                    /*!< MDR_PORTA PULL: Down_Pin_12 (Bit 12)                  */
#define MDR_PORTA_PULL_Down_Pin_12_Msk    (0x1000UL)                /*!< MDR_PORTA PULL: Down_Pin_12 (Bitfield-Mask: 0x01)     */
#define MDR_PORTA_PULL_Down_Pin_13_Pos    (13UL)                    /*!< MDR_PORTA PULL: Down_Pin_13 (Bit 13)                  */
#define MDR_PORTA_PULL_Down_Pin_13_Msk    (0x2000UL)                /*!< MDR_PORTA PULL: Down_Pin_13 (Bitfield-Mask: 0x01)     */
#define MDR_PORTA_PULL_Down_Pin_14_Pos    (14UL)                    /*!< MDR_PORTA PULL: Down_Pin_14 (Bit 14)                  */
#define MDR_PORTA_PULL_Down_Pin_14_Msk    (0x4000UL)                /*!< MDR_PORTA PULL: Down_Pin_14 (Bitfield-Mask: 0x01)     */
#define MDR_PORTA_PULL_Down_Pin_15_Pos    (15UL)                    /*!< MDR_PORTA PULL: Down_Pin_15 (Bit 15)                  */
#define MDR_PORTA_PULL_Down_Pin_15_Msk    (0x8000UL)                /*!< MDR_PORTA PULL: Down_Pin_15 (Bitfield-Mask: 0x01)     */
#define MDR_PORTA_PULL_UP_Pin__Pos        (16UL)                    /*!< MDR_PORTA PULL: UP_Pin_ (Bit 16)                      */
#define MDR_PORTA_PULL_UP_Pin__Msk        (0x10000UL)               /*!< MDR_PORTA PULL: UP_Pin_ (Bitfield-Mask: 0x01)         */
/* ==========================================================  PD  =========================================================== */
#define MDR_PORTA_PD_Driver_Pin_0_Pos     (0UL)                     /*!< MDR_PORTA PD: Driver_Pin_0 (Bit 0)                    */
#define MDR_PORTA_PD_Driver_Pin_0_Msk     (0x1UL)                   /*!< MDR_PORTA PD: Driver_Pin_0 (Bitfield-Mask: 0x01)      */
#define MDR_PORTA_PD_Driver_Pin_1_Pos     (1UL)                     /*!< MDR_PORTA PD: Driver_Pin_1 (Bit 1)                    */
#define MDR_PORTA_PD_Driver_Pin_1_Msk     (0x2UL)                   /*!< MDR_PORTA PD: Driver_Pin_1 (Bitfield-Mask: 0x01)      */
#define MDR_PORTA_PD_Driver_Pin_2_Pos     (2UL)                     /*!< MDR_PORTA PD: Driver_Pin_2 (Bit 2)                    */
#define MDR_PORTA_PD_Driver_Pin_2_Msk     (0x4UL)                   /*!< MDR_PORTA PD: Driver_Pin_2 (Bitfield-Mask: 0x01)      */
#define MDR_PORTA_PD_Driver_Pin_3_Pos     (3UL)                     /*!< MDR_PORTA PD: Driver_Pin_3 (Bit 3)                    */
#define MDR_PORTA_PD_Driver_Pin_3_Msk     (0x8UL)                   /*!< MDR_PORTA PD: Driver_Pin_3 (Bitfield-Mask: 0x01)      */
#define MDR_PORTA_PD_Driver_Pin_4_Pos     (4UL)                     /*!< MDR_PORTA PD: Driver_Pin_4 (Bit 4)                    */
#define MDR_PORTA_PD_Driver_Pin_4_Msk     (0x10UL)                  /*!< MDR_PORTA PD: Driver_Pin_4 (Bitfield-Mask: 0x01)      */
#define MDR_PORTA_PD_Driver_Pin_5_Pos     (5UL)                     /*!< MDR_PORTA PD: Driver_Pin_5 (Bit 5)                    */
#define MDR_PORTA_PD_Driver_Pin_5_Msk     (0x20UL)                  /*!< MDR_PORTA PD: Driver_Pin_5 (Bitfield-Mask: 0x01)      */
#define MDR_PORTA_PD_Driver_Pin_6_Pos     (6UL)                     /*!< MDR_PORTA PD: Driver_Pin_6 (Bit 6)                    */
#define MDR_PORTA_PD_Driver_Pin_6_Msk     (0x40UL)                  /*!< MDR_PORTA PD: Driver_Pin_6 (Bitfield-Mask: 0x01)      */
#define MDR_PORTA_PD_Driver_Pin_7_Pos     (7UL)                     /*!< MDR_PORTA PD: Driver_Pin_7 (Bit 7)                    */
#define MDR_PORTA_PD_Driver_Pin_7_Msk     (0x80UL)                  /*!< MDR_PORTA PD: Driver_Pin_7 (Bitfield-Mask: 0x01)      */
#define MDR_PORTA_PD_Driver_Pin_8_Pos     (8UL)                     /*!< MDR_PORTA PD: Driver_Pin_8 (Bit 8)                    */
#define MDR_PORTA_PD_Driver_Pin_8_Msk     (0x100UL)                 /*!< MDR_PORTA PD: Driver_Pin_8 (Bitfield-Mask: 0x01)      */
#define MDR_PORTA_PD_Driver_Pin_9_Pos     (9UL)                     /*!< MDR_PORTA PD: Driver_Pin_9 (Bit 9)                    */
#define MDR_PORTA_PD_Driver_Pin_9_Msk     (0x200UL)                 /*!< MDR_PORTA PD: Driver_Pin_9 (Bitfield-Mask: 0x01)      */
#define MDR_PORTA_PD_Driver_Pin_10_Pos    (10UL)                    /*!< MDR_PORTA PD: Driver_Pin_10 (Bit 10)                  */
#define MDR_PORTA_PD_Driver_Pin_10_Msk    (0x400UL)                 /*!< MDR_PORTA PD: Driver_Pin_10 (Bitfield-Mask: 0x01)     */
#define MDR_PORTA_PD_Driver_Pin_11_Pos    (11UL)                    /*!< MDR_PORTA PD: Driver_Pin_11 (Bit 11)                  */
#define MDR_PORTA_PD_Driver_Pin_11_Msk    (0x800UL)                 /*!< MDR_PORTA PD: Driver_Pin_11 (Bitfield-Mask: 0x01)     */
#define MDR_PORTA_PD_Driver_Pin_12_Pos    (12UL)                    /*!< MDR_PORTA PD: Driver_Pin_12 (Bit 12)                  */
#define MDR_PORTA_PD_Driver_Pin_12_Msk    (0x1000UL)                /*!< MDR_PORTA PD: Driver_Pin_12 (Bitfield-Mask: 0x01)     */
#define MDR_PORTA_PD_Driver_Pin_13_Pos    (13UL)                    /*!< MDR_PORTA PD: Driver_Pin_13 (Bit 13)                  */
#define MDR_PORTA_PD_Driver_Pin_13_Msk    (0x2000UL)                /*!< MDR_PORTA PD: Driver_Pin_13 (Bitfield-Mask: 0x01)     */
#define MDR_PORTA_PD_Driver_Pin_14_Pos    (14UL)                    /*!< MDR_PORTA PD: Driver_Pin_14 (Bit 14)                  */
#define MDR_PORTA_PD_Driver_Pin_14_Msk    (0x4000UL)                /*!< MDR_PORTA PD: Driver_Pin_14 (Bitfield-Mask: 0x01)     */
#define MDR_PORTA_PD_Driver_Pin_15_Pos    (15UL)                    /*!< MDR_PORTA PD: Driver_Pin_15 (Bit 15)                  */
#define MDR_PORTA_PD_Driver_Pin_15_Msk    (0x8000UL)                /*!< MDR_PORTA PD: Driver_Pin_15 (Bitfield-Mask: 0x01)     */
#define MDR_PORTA_PD_Schmitt_Pin__Pos     (16UL)                    /*!< MDR_PORTA PD: Schmitt_Pin_ (Bit 16)                   */
#define MDR_PORTA_PD_Schmitt_Pin__Msk     (0x10000UL)               /*!< MDR_PORTA PD: Schmitt_Pin_ (Bitfield-Mask: 0x01)      */
/* ==========================================================  PWR  ========================================================== */
#define MDR_PORTA_PWR_Pin__Pos            (0UL)                     /*!< MDR_PORTA PWR: Pin_ (Bit 0)                           */
#define MDR_PORTA_PWR_Pin__Msk            (0x3UL)                   /*!< MDR_PORTA PWR: Pin_ (Bitfield-Mask: 0x03)             */
/* =========================================================  GFEN  ========================================================== */
#define MDR_PORTA_GFEN_Pin__Pos           (0UL)                     /*!< MDR_PORTA GFEN: Pin_ (Bit 0)                          */
#define MDR_PORTA_GFEN_Pin__Msk           (0x1UL)                   /*!< MDR_PORTA GFEN: Pin_ (Bitfield-Mask: 0x01)            */

/** @} */ /* End of group PosMask_peripherals */


/* =========================================================================================================================== */
/* ================                           Enumerated Values Peripheral Section                            ================ */
/* =========================================================================================================================== */


/** @addtogroup EnumValue_peripherals
  * @{
  */



/* =========================================================================================================================== */
/* ================                                        MDR_EEPROM                                         ================ */
/* =========================================================================================================================== */

/* ==========================================================  CMD  ========================================================== */
/* ===============================================  MDR_EEPROM CMD CON [0..0]  =============================================== */
typedef enum {                                  /*!< MDR_EEPROM_CMD_CON                                                        */
  MDR_EEPROM_CMD__CON__Normal Access   = 0,     /*!< Normal Access : Normal access to memory                                   */
  MDR_EEPROM_CMD__CON__Controller Access = 1,   /*!< Controller Access : Access to memory though registers                     */
} MDR_EEPROM_CMD__CON__Enum;

/* ===============================================  MDR_EEPROM CMD WR [1..1]  ================================================ */
typedef enum {                                  /*!< MDR_EEPROM_CMD_WR                                                         */
  MDR_EEPROM_CMD__WR__Inactive         = 0,     /*!< Inactive : No write operation                                             */
  MDR_EEPROM_CMD__WR__Active           = 1,     /*!< Active : Write operation                                                  */
} MDR_EEPROM_CMD__WR__Enum;

/* ===============================================  MDR_EEPROM CMD RD [2..2]  ================================================ */
typedef enum {                                  /*!< MDR_EEPROM_CMD_RD                                                         */
  MDR_EEPROM_CMD__RD__Inactive         = 0,     /*!< Inactive : No read operation                                              */
  MDR_EEPROM_CMD__RD__Active           = 1,     /*!< Active : Read operation                                                   */
} MDR_EEPROM_CMD__RD__Enum;

/* ==============================================  MDR_EEPROM CMD DELAY [3..3]  ============================================== */
typedef enum {                                  /*!< MDR_EEPROM_CMD_DELAY                                                      */
  MDR_EEPROM_CMD__DELAY__le18MHz       = 0,     /*!< le18MHz : CPU freq is up to 18MHz                                         */
  MDR_EEPROM_CMD__DELAY__le36MHz       = 1,     /*!< le36MHz : CPU freq is up to 36MHz                                         */
} MDR_EEPROM_CMD__DELAY__Enum;

/* ===============================================  MDR_EEPROM CMD XE [6..6]  ================================================ */
typedef enum {                                  /*!< MDR_EEPROM_CMD_XE                                                         */
  MDR_EEPROM_CMD__XE__Off              = 0,     /*!< Off : Disable                                                             */
  MDR_EEPROM_CMD__XE__On               = 1,     /*!< On : Enable                                                               */
} MDR_EEPROM_CMD__XE__Enum;

/* ===============================================  MDR_EEPROM CMD YE [7..7]  ================================================ */
typedef enum {                                  /*!< MDR_EEPROM_CMD_YE                                                         */
  MDR_EEPROM_CMD_YE_Off                = 0,     /*!< Off : Disable                                                             */
  MDR_EEPROM_CMD_YE_On                 = 1,     /*!< On : Enable                                                               */
} MDR_EEPROM_CMD_YE_Enum;

/* ===============================================  MDR_EEPROM CMD SE [8..8]  ================================================ */
typedef enum {                                  /*!< MDR_EEPROM_CMD_SE                                                         */
  MDR_EEPROM_CMD_SE_Off                = 0,     /*!< Off : Disable                                                             */
  MDR_EEPROM_CMD_SE_On                 = 1,     /*!< On : Enable                                                               */
} MDR_EEPROM_CMD_SE_Enum;

/* ==============================================  MDR_EEPROM CMD IFREN [9..9]  ============================================== */
typedef enum {                                  /*!< MDR_EEPROM_CMD_IFREN                                                      */
  MDR_EEPROM_CMD__IFREN__Main          = 0,     /*!< Main : Main memory                                                        */
  MDR_EEPROM_CMD__IFREN__Info          = 1,     /*!< Info : Info memory                                                        */
} MDR_EEPROM_CMD__IFREN__Enum;

/* =============================================  MDR_EEPROM CMD ERASE [10..10]  ============================================= */
typedef enum {                                  /*!< MDR_EEPROM_CMD_ERASE                                                      */
  MDR_EEPROM_CMD__ERASE__Inactive      = 0,     /*!< Inactive : No erase operation                                             */
  MDR_EEPROM_CMD__ERASE__Active        = 1,     /*!< Active : Erase operation                                                  */
} MDR_EEPROM_CMD__ERASE__Enum;

/* =============================================  MDR_EEPROM CMD MAS1 [11..11]  ============================================== */
typedef enum {                                  /*!< MDR_EEPROM_CMD_MAS1                                                       */
  MDR_EEPROM_CMD_MAS1_Off              = 0,     /*!< Off : Disable                                                             */
  MDR_EEPROM_CMD_MAS1_On               = 1,     /*!< On : Enable                                                               */
} MDR_EEPROM_CMD_MAS1_Enum;

