StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VK234.h
/* ========================================  MDR_RST_CLOCK HS_CONTROL HSE_BYP [1..1]  ======================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_HS_CONTROL_HSE_BYP                                          */
  MDR_RST__HS__HSE_BYP__Off            = 0,     /*!< Off : HSE forms Clock from external oscillator                            */
  MDR_RST__HS__HSE_BYP__On             = 1,     /*!< On : HSE passes Clock from external generator                             */
} MDR_RST__HS__HSE_BYP__Enum;

/* =======================================================  CPU_CLOCK  ======================================================= */
/* =======================================  MDR_RST_CLOCK CPU_CLOCK CPU_C1_SEL [0..1]  ======================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_CPU_CLOCK_CPU_C1_SEL                                        */
  MDR_RST__CPU__C1__HSI                = 0,     /*!< HSI : CPU_C1 output is HSI                                                */
  MDR_RST__CPU__C1__HSI/2              = 1,     /*!< HSI/2 : CPU_C1 output is HSI/2                                            */
  MDR_RST__CPU__C1__HSE                = 2,     /*!< HSE : CPU_C1 output is HSE                                                */
  MDR_RST__CPU__C1__HSE/2              = 3,     /*!< HSE/2 : CPU_C1 output is HSE/2                                            */
} MDR_RST__CPU__C1__Enum;

/* =======================================  MDR_RST_CLOCK CPU_CLOCK CPU_C2_SEL [2..2]  ======================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_CPU_CLOCK_CPU_C2_SEL                                        */
  MDR_RST__CPU__C2__CPU_C1             = 0,     /*!< CPU_C1 : Freq from CPU_C1 mux direct                                      */
  MDR_RST__CPU__C2__PLLCPUo            = 1,     /*!< PLLCPUo : Freq from CPU_C1 mux through PLL                                */
} MDR_RST__CPU__C2__Enum;

/* =======================================  MDR_RST_CLOCK CPU_CLOCK CPU_C3_SEL [4..7]  ======================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_CPU_CLOCK_CPU_C3_SEL                                        */
  MDR_RST__CPU__C3__div1_0             = 0,     /*!< div1_0 : div by 1                                                         */
  MDR_RST__CPU__C3__div1_1             = 1,     /*!< div1_1 : div by 1                                                         */
  MDR_RST__CPU__C3__div1_2             = 2,     /*!< div1_2 : div by 1                                                         */
  MDR_RST__CPU__C3__div1_3             = 3,     /*!< div1_3 : div by 1                                                         */
  MDR_RST__CPU__C3__div1_4             = 4,     /*!< div1_4 : div by 1                                                         */
  MDR_RST__CPU__C3__div1_5             = 5,     /*!< div1_5 : div by 1                                                         */
  MDR_RST__CPU__C3__div1_6             = 6,     /*!< div1_6 : div by 1                                                         */
  MDR_RST__CPU__C3__div1_7             = 7,     /*!< div1_7 : div by 1                                                         */
  MDR_RST__CPU__C3__div2               = 8,     /*!< div2 : div by 2                                                           */
  MDR_RST__CPU__C3__div4               = 9,     /*!< div4 : div by 4                                                           */
  MDR_RST__CPU__C3__div8               = 10,    /*!< div8 : div by 8                                                           */
  MDR_RST__CPU__C3__div16              = 11,    /*!< div16 : div by 16                                                         */
  MDR_RST__CPU__C3__div32              = 12,    /*!< div32 : div by 32                                                         */
  MDR_RST__CPU__C3__div64              = 13,    /*!< div64 : div by 64                                                         */
  MDR_RST__CPU__C3__div128             = 14,    /*!< div128 : div by 128                                                       */
  MDR_RST__CPU__C3__div256             = 15,    /*!< div256 : div by 256                                                       */
} MDR_RST__CPU__C3__Enum;

/* ========================================  MDR_RST_CLOCK CPU_CLOCK HCLK_SEL [8..9]  ======================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_CPU_CLOCK_HCLK_SEL                                          */
  MDR_RST__CPU__HCLK__HSI              = 0,     /*!< HSI : CPU clock is HSI                                                    */
  MDR_RST__CPU__HCLK__CPU_C3           = 1,     /*!< CPU_C3 : CPU clock is CPU_C3 output                                       */
  MDR_RST__CPU__HCLK__LSE              = 2,     /*!< LSE : CPU clock is LSE                                                    */
  MDR_RST__CPU__HCLK__LSI              = 3,     /*!< LSI : CPU clock is LSI                                                    */
} MDR_RST__CPU__HCLK__Enum;

/* ======================================================  PER1_CLOCK  ======================================================= */
/* ======================================  MDR_RST_CLOCK PER1_CLOCK PER1_C1_SEL [0..1]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER1_CLOCK_PER1_C1_SEL                                      */
  MDR_RST__PER1__C1__LSI               = 0,     /*!< LSI : PER1_C1 output is LSI                                               */
  MDR_RST__PER1__C1__LSI/2             = 1,     /*!< LSI/2 : PER1_C1 output is LSI/2                                           */
  MDR_RST__PER1__C1__LSE               = 2,     /*!< LSE : PER1_C1 output is LSE                                               */
  MDR_RST__PER1__C1__LSE/2             = 3,     /*!< LSE/2 : PER1_C1 output is LSE/2                                           */
} MDR_RST__PER1__C1__Enum;

/* ======================================  MDR_RST_CLOCK PER1_CLOCK PER1_C2_SEL [2..3]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER1_CLOCK_PER1_C2_SEL                                      */
  MDR_RST__PER1__C2__CPU_C1            = 0,     /*!< CPU_C1 : PER1_C2 output is CPU_C1                                         */
  MDR_RST__PER1__C2__PER1_C1           = 1,     /*!< PER1_C1 : PER1_C2 output is PER1_C1                                       */
  MDR_RST__PER1__C2__PLLCPUo           = 2,     /*!< PLLCPUo : PER1_C2 output is PLLCPUo                                       */
  MDR_RST__PER1__C2__HSI_C1            = 3,     /*!< HSI_C1 : PER1_C2 output is HSI_C1                                         */
} MDR_RST__PER1__C2__Enum;

/* =======================================  MDR_RST_CLOCK PER1_CLOCK DEBUG_EN [4..4]  ======================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER1_CLOCK_DEBUG_EN                                         */
  MDR_RST__PER1__DEBUG_CLK_Off         = 0,     /*!< Off : Debug disabled                                                      */
  MDR_RST__PER1__DEBUG_CLK_On          = 1,     /*!< On : Debug enabled                                                        */
} MDR_RST__PER1__DEBUG_CLK_Enum;

