StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VK234.h
/* ========================================  MDR_RST_CLOCK PER1_CLOCK DMA_EN [5..5]  ========================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER1_CLOCK_DMA_EN                                           */
  MDR_RST__PER1__DMA_CLK__Off          = 0,     /*!< Off : DMA clock disabled                                                  */
  MDR_RST__PER1__DMA_CLK__On           = 1,     /*!< On : DMA clock enabled                                                    */
} MDR_RST__PER1__DMA_CLK__Enum;

/* =======================================================  ADC_CLOCK  ======================================================= */
/* =======================================  MDR_RST_CLOCK ADC_CLOCK ADC_C1_SEL [0..1]  ======================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_ADC_CLOCK_ADC_C1_SEL                                        */
  MDR_RST__ADC__C1__CPU_C1             = 0,     /*!< CPU_C1 : ADC_C1 output is CPU_C1                                          */
  MDR_RST__ADC__C1__PER1_C1            = 1,     /*!< PER1_C1 : ADC_C1 output is PER1_C1                                        */
  MDR_RST__ADC__C1__PLLCPUo            = 2,     /*!< PLLCPUo : ADC_C1 output is PLLCPUo                                        */
  MDR_RST__ADC__C1__HSI_C1             = 3,     /*!< HSI_C1 : ADC_C1 output is HSI_C1                                          */
} MDR_RST__ADC__C1__Enum;

/* ======================================  MDR_RST_CLOCK ADC_CLOCK ADCIU_C1_SEL [2..3]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_ADC_CLOCK_ADCIU_C1_SEL                                      */
  MDR_RST__ADCIU__C1__CPU_C1           = 0,     /*!< CPU_C1 : ADCIU_C1 output is CPU_C1                                        */
  MDR_RST__ADCIU__C1__PER1_C1          = 1,     /*!< PER1_C1 : ADCIU_C1 output is PER1_C1                                      */
  MDR_RST__ADCIU__C1__PLLCPUo          = 2,     /*!< PLLCPUo : ADCIU_C1 output is PLLCPUo                                      */
  MDR_RST__ADCIU__C1__HSI_C1           = 3,     /*!< HSI_C1 : ADCIU_C1 output is HSI_C1                                        */
} MDR_RST__ADCIU__C1__Enum;

/* =======================================  MDR_RST_CLOCK ADC_CLOCK ADC_C3_SEL [4..7]  ======================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_ADC_CLOCK_ADC_C3_SEL                                        */
  MDR_RST_CLOCK_ADC_CLOCK_ADC_C3_SEL_div1_0 = 0,/*!< div1_0 : div by 1                                                         */
  MDR_RST_CLOCK_ADC_CLOCK_ADC_C3_SEL_div1_1 = 1,/*!< div1_1 : div by 1                                                         */
  MDR_RST_CLOCK_ADC_CLOCK_ADC_C3_SEL_div1_2 = 2,/*!< div1_2 : div by 1                                                         */
  MDR_RST_CLOCK_ADC_CLOCK_ADC_C3_SEL_div1_3 = 3,/*!< div1_3 : div by 1                                                         */
  MDR_RST_CLOCK_ADC_CLOCK_ADC_C3_SEL_div1_4 = 4,/*!< div1_4 : div by 1                                                         */
  MDR_RST_CLOCK_ADC_CLOCK_ADC_C3_SEL_div1_5 = 5,/*!< div1_5 : div by 1                                                         */
  MDR_RST_CLOCK_ADC_CLOCK_ADC_C3_SEL_div1_6 = 6,/*!< div1_6 : div by 1                                                         */
  MDR_RST_CLOCK_ADC_CLOCK_ADC_C3_SEL_div1_7 = 7,/*!< div1_7 : div by 1                                                         */
  MDR_RST_CLOCK_ADC_CLOCK_ADC_C3_SEL_div2 = 8,  /*!< div2 : div by 2                                                           */
  MDR_RST_CLOCK_ADC_CLOCK_ADC_C3_SEL_div4 = 9,  /*!< div4 : div by 4                                                           */
  MDR_RST_CLOCK_ADC_CLOCK_ADC_C3_SEL_div8 = 10, /*!< div8 : div by 8                                                           */
  MDR_RST_CLOCK_ADC_CLOCK_ADC_C3_SEL_div16 = 11,/*!< div16 : div by 16                                                         */
  MDR_RST_CLOCK_ADC_CLOCK_ADC_C3_SEL_div32 = 12,/*!< div32 : div by 32                                                         */
  MDR_RST_CLOCK_ADC_CLOCK_ADC_C3_SEL_div64 = 13,/*!< div64 : div by 64                                                         */
  MDR_RST_CLOCK_ADC_CLOCK_ADC_C3_SEL_div128 = 14,/*!< div128 : div by 128                                                      */
  MDR_RST_CLOCK_ADC_CLOCK_ADC_C3_SEL_div256 = 15,/*!< div256 : div by 256                                                      */
} MDR_RST_CLOCK_ADC_CLOCK_ADC_C3_SEL_Enum;

/* =====================================  MDR_RST_CLOCK ADC_CLOCK ADCIU_C3_SEL [8..11]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_ADC_CLOCK_ADCIU_C3_SEL                                      */
  MDR_RST_CLOCK_ADC_CLOCK_ADCIU_C3_SEL_div1_0 = 0,/*!< div1_0 : div by 1                                                       */
  MDR_RST_CLOCK_ADC_CLOCK_ADCIU_C3_SEL_div1_1 = 1,/*!< div1_1 : div by 1                                                       */
  MDR_RST_CLOCK_ADC_CLOCK_ADCIU_C3_SEL_div1_2 = 2,/*!< div1_2 : div by 1                                                       */
  MDR_RST_CLOCK_ADC_CLOCK_ADCIU_C3_SEL_div1_3 = 3,/*!< div1_3 : div by 1                                                       */
  MDR_RST_CLOCK_ADC_CLOCK_ADCIU_C3_SEL_div1_4 = 4,/*!< div1_4 : div by 1                                                       */
  MDR_RST_CLOCK_ADC_CLOCK_ADCIU_C3_SEL_div1_5 = 5,/*!< div1_5 : div by 1                                                       */
  MDR_RST_CLOCK_ADC_CLOCK_ADCIU_C3_SEL_div1_6 = 6,/*!< div1_6 : div by 1                                                       */
  MDR_RST_CLOCK_ADC_CLOCK_ADCIU_C3_SEL_div1_7 = 7,/*!< div1_7 : div by 1                                                       */
  MDR_RST_CLOCK_ADC_CLOCK_ADCIU_C3_SEL_div2 = 8,/*!< div2 : div by 2                                                           */
  MDR_RST_CLOCK_ADC_CLOCK_ADCIU_C3_SEL_div4 = 9,/*!< div4 : div by 4                                                           */
  MDR_RST_CLOCK_ADC_CLOCK_ADCIU_C3_SEL_div8 = 10,/*!< div8 : div by 8                                                          */
  MDR_RST_CLOCK_ADC_CLOCK_ADCIU_C3_SEL_div16 = 11,/*!< div16 : div by 16                                                       */
  MDR_RST_CLOCK_ADC_CLOCK_ADCIU_C3_SEL_div32 = 12,/*!< div32 : div by 32                                                       */
  MDR_RST_CLOCK_ADC_CLOCK_ADCIU_C3_SEL_div64 = 13,/*!< div64 : div by 64                                                       */
  MDR_RST_CLOCK_ADC_CLOCK_ADCIU_C3_SEL_div128 = 14,/*!< div128 : div by 128                                                    */
  MDR_RST_CLOCK_ADC_CLOCK_ADCIU_C3_SEL_div256 = 15,/*!< div256 : div by 256                                                    */
} MDR_RST_CLOCK_ADC_CLOCK_ADCIU_C3_SEL_Enum;

