StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VK234.h
/* =====================================  MDR_RST_CLOCK ADC_CLOCK ADCIU_CLK_EN [12..12]  ===================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_ADC_CLOCK_ADCIU_CLK_EN                                      */
  MDR_RST__ADCIU__CLK_EN__Off          = 0,     /*!< Off : ADCIU clock disabled                                                */
  MDR_RST__ADCIU__CLK_EN__On           = 1,     /*!< On : ADCIU clock enabled                                                  */
} MDR_RST__ADCIU__CLK_EN__Enum;

/* ======================================  MDR_RST_CLOCK ADC_CLOCK ADC_CLK_EN [13..13]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_ADC_CLOCK_ADC_CLK_EN                                        */
  MDR_RST__ADC__CLK_EN__Off            = 0,     /*!< Off : ADC clock disabled                                                  */
  MDR_RST__ADC__CLK_EN__On             = 1,     /*!< On : ADC clock enabled                                                    */
} MDR_RST__ADC__CLK_EN__Enum;

/* =======================================================  RTC_CLOCK  ======================================================= */
/* ========================================  MDR_RST_CLOCK RTC_CLOCK HSE_SEL [0..3]  ========================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_RTC_CLOCK_HSE_SEL                                           */
  MDR_RST_CLOCK_RTC_CLOCK_HSE_SEL_div1_0 = 0,   /*!< div1_0 : div by 1                                                         */
  MDR_RST_CLOCK_RTC_CLOCK_HSE_SEL_div1_1 = 1,   /*!< div1_1 : div by 1                                                         */
  MDR_RST_CLOCK_RTC_CLOCK_HSE_SEL_div1_2 = 2,   /*!< div1_2 : div by 1                                                         */
  MDR_RST_CLOCK_RTC_CLOCK_HSE_SEL_div1_3 = 3,   /*!< div1_3 : div by 1                                                         */
  MDR_RST_CLOCK_RTC_CLOCK_HSE_SEL_div1_4 = 4,   /*!< div1_4 : div by 1                                                         */
  MDR_RST_CLOCK_RTC_CLOCK_HSE_SEL_div1_5 = 5,   /*!< div1_5 : div by 1                                                         */
  MDR_RST_CLOCK_RTC_CLOCK_HSE_SEL_div1_6 = 6,   /*!< div1_6 : div by 1                                                         */
  MDR_RST_CLOCK_RTC_CLOCK_HSE_SEL_div1_7 = 7,   /*!< div1_7 : div by 1                                                         */
  MDR_RST_CLOCK_RTC_CLOCK_HSE_SEL_div2 = 8,     /*!< div2 : div by 2                                                           */
  MDR_RST_CLOCK_RTC_CLOCK_HSE_SEL_div4 = 9,     /*!< div4 : div by 4                                                           */
  MDR_RST_CLOCK_RTC_CLOCK_HSE_SEL_div8 = 10,    /*!< div8 : div by 8                                                           */
  MDR_RST_CLOCK_RTC_CLOCK_HSE_SEL_div16 = 11,   /*!< div16 : div by 16                                                         */
  MDR_RST_CLOCK_RTC_CLOCK_HSE_SEL_div32 = 12,   /*!< div32 : div by 32                                                         */
  MDR_RST_CLOCK_RTC_CLOCK_HSE_SEL_div64 = 13,   /*!< div64 : div by 64                                                         */
  MDR_RST_CLOCK_RTC_CLOCK_HSE_SEL_div128 = 14,  /*!< div128 : div by 128                                                       */
  MDR_RST_CLOCK_RTC_CLOCK_HSE_SEL_div256 = 15,  /*!< div256 : div by 256                                                       */
} MDR_RST_CLOCK_RTC_CLOCK_HSE_SEL_Enum;

/* ========================================  MDR_RST_CLOCK RTC_CLOCK HSI_SEL [4..7]  ========================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_RTC_CLOCK_HSI_SEL                                           */
  MDR_RST_CLOCK_RTC_CLOCK_HSI_SEL_div1_0 = 0,   /*!< div1_0 : div by 1                                                         */
  MDR_RST_CLOCK_RTC_CLOCK_HSI_SEL_div1_1 = 1,   /*!< div1_1 : div by 1                                                         */
  MDR_RST_CLOCK_RTC_CLOCK_HSI_SEL_div1_2 = 2,   /*!< div1_2 : div by 1                                                         */
  MDR_RST_CLOCK_RTC_CLOCK_HSI_SEL_div1_3 = 3,   /*!< div1_3 : div by 1                                                         */
  MDR_RST_CLOCK_RTC_CLOCK_HSI_SEL_div1_4 = 4,   /*!< div1_4 : div by 1                                                         */
  MDR_RST_CLOCK_RTC_CLOCK_HSI_SEL_div1_5 = 5,   /*!< div1_5 : div by 1                                                         */
  MDR_RST_CLOCK_RTC_CLOCK_HSI_SEL_div1_6 = 6,   /*!< div1_6 : div by 1                                                         */
  MDR_RST_CLOCK_RTC_CLOCK_HSI_SEL_div1_7 = 7,   /*!< div1_7 : div by 1                                                         */
  MDR_RST_CLOCK_RTC_CLOCK_HSI_SEL_div2 = 8,     /*!< div2 : div by 2                                                           */
  MDR_RST_CLOCK_RTC_CLOCK_HSI_SEL_div4 = 9,     /*!< div4 : div by 4                                                           */
  MDR_RST_CLOCK_RTC_CLOCK_HSI_SEL_div8 = 10,    /*!< div8 : div by 8                                                           */
  MDR_RST_CLOCK_RTC_CLOCK_HSI_SEL_div16 = 11,   /*!< div16 : div by 16                                                         */
  MDR_RST_CLOCK_RTC_CLOCK_HSI_SEL_div32 = 12,   /*!< div32 : div by 32                                                         */
  MDR_RST_CLOCK_RTC_CLOCK_HSI_SEL_div64 = 13,   /*!< div64 : div by 64                                                         */
  MDR_RST_CLOCK_RTC_CLOCK_HSI_SEL_div128 = 14,  /*!< div128 : div by 128                                                       */
  MDR_RST_CLOCK_RTC_CLOCK_HSI_SEL_div256 = 15,  /*!< div256 : div by 256                                                       */
} MDR_RST_CLOCK_RTC_CLOCK_HSI_SEL_Enum;

/* =======================================  MDR_RST_CLOCK RTC_CLOCK HSE_RTC_EN [8..8]  ======================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_RTC_CLOCK_HSE_RTC_EN                                        */
  MDR_RST__RTC__HSE_RTC_CLOCK__Off     = 0,     /*!< Off : RTC HSE Clock Disabled                                              */
  MDR_RST__RTC__HSE_RTC_CLOCK__On      = 1,     /*!< On : RTC HSE Clock Enabled                                                */
} MDR_RST__RTC__HSE_RTC_CLOCK__Enum;

/* =======================================  MDR_RST_CLOCK RTC_CLOCK HSI_RTC_EN [9..9]  ======================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_RTC_CLOCK_HSI_RTC_EN                                        */
  MDR_RST__RTC__HSI_RTC_CLOCK__Off     = 0,     /*!< Off : RTC HSI Clock Disabled                                              */
  MDR_RST__RTC__HSI_RTC_CLOCK__On      = 1,     /*!< On : RTC HSI Clock Enabled                                                */
} MDR_RST__RTC__HSI_RTC_CLOCK__Enum;

/* ======================================================  PER2_CLOCK  ======================================================= */
/* ======================================  MDR_RST_CLOCK PER2_CLOCK SPI1_CLK_EN [0..0]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER2_CLOCK_SPI1_CLK_EN                                      */
  MDR_RST__PER2__SPI1_CLOCK__Off       = 0,     /*!< Off : Clock Disabled                                                      */
  MDR_RST__PER2__SPI1_CLOCK__On        = 1,     /*!< On : Clock Enabled                                                        */
} MDR_RST__PER2__SPI1_CLOCK__Enum;

/* =====================================  MDR_RST_CLOCK PER2_CLOCK UART1_CLK_EN [1..1]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER2_CLOCK_UART1_CLK_EN                                     */
  MDR_RST_CLOCK_PER2_CLOCK_UART1_CLK_EN_Off = 0,/*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER2_CLOCK_UART1_CLK_EN_On = 1, /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER2_CLOCK_UART1_CLK_EN_Enum;

/* =====================================  MDR_RST_CLOCK PER2_CLOCK UART2_CLK_EN [2..2]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER2_CLOCK_UART2_CLK_EN                                     */
  MDR_RST_CLOCK_PER2_CLOCK_UART2_CLK_EN_Off = 0,/*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER2_CLOCK_UART2_CLK_EN_On = 1, /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER2_CLOCK_UART2_CLK_EN_Enum;

/* =====================================  MDR_RST_CLOCK PER2_CLOCK EEPROM_CLK_EN [3..3]  ===================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER2_CLOCK_EEPROM_CLK_EN                                    */
  MDR_RST_CLOCK_PER2_CLOCK_EEPROM_CLK_EN_Off = 0,/*!< Off : Clock Disabled                                                     */
  MDR_RST_CLOCK_PER2_CLOCK_EEPROM_CLK_EN_On = 1,/*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER2_CLOCK_EEPROM_CLK_EN_Enum;

/* ======================================  MDR_RST_CLOCK PER2_CLOCK RST_CLK_EN [4..4]  ======================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER2_CLOCK_RST_CLK_EN                                       */
  MDR_RST_CLOCK_PER2_CLOCK_RST_CLK_EN_Off = 0,  /*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER2_CLOCK_RST_CLK_EN_On = 1,   /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER2_CLOCK_RST_CLK_EN_Enum;

/* ======================================  MDR_RST_CLOCK PER2_CLOCK DMA_CLK_EN [5..5]  ======================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER2_CLOCK_DMA_CLK_EN                                       */
  MDR_RST_CLOCK_PER2_CLOCK_DMA_CLK_EN_Off = 0,  /*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER2_CLOCK_DMA_CLK_EN_On = 1,   /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER2_CLOCK_DMA_CLK_EN_Enum;

/* ======================================  MDR_RST_CLOCK PER2_CLOCK ADC_CLK_EN [8..8]  ======================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER2_CLOCK_ADC_CLK_EN                                       */
  MDR_RST_CLOCK_PER2_CLOCK_ADC_CLK_EN_Off = 0,  /*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER2_CLOCK_ADC_CLK_EN_On = 1,   /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER2_CLOCK_ADC_CLK_EN_Enum;

/* ======================================  MDR_RST_CLOCK PER2_CLOCK WWDT_CLK_EN [9..9]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER2_CLOCK_WWDT_CLK_EN                                      */
  MDR_RST_CLOCK_PER2_CLOCK_WWDT_CLK_EN_Off = 0, /*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER2_CLOCK_WWDT_CLK_EN_On = 1,  /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER2_CLOCK_WWDT_CLK_EN_Enum;

/* =====================================  MDR_RST_CLOCK PER2_CLOCK IWDT_CLK_EN [10..10]  ===================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER2_CLOCK_IWDT_CLK_EN                                      */
  MDR_RST_CLOCK_PER2_CLOCK_IWDT_CLK_EN_Off = 0, /*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER2_CLOCK_IWDT_CLK_EN_On = 1,  /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER2_CLOCK_IWDT_CLK_EN_Enum;

/* =====================================  MDR_RST_CLOCK PER2_CLOCK PWR_CLK_EN [11..11]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER2_CLOCK_PWR_CLK_EN                                       */
  MDR_RST_CLOCK_PER2_CLOCK_PWR_CLK_EN_Off = 0,  /*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER2_CLOCK_PWR_CLK_EN_On = 1,   /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER2_CLOCK_PWR_CLK_EN_Enum;

/* =====================================  MDR_RST_CLOCK PER2_CLOCK BKP_CLK_EN [12..12]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER2_CLOCK_BKP_CLK_EN                                       */
  MDR_RST_CLOCK_PER2_CLOCK_BKP_CLK_EN_Off = 0,  /*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER2_CLOCK_BKP_CLK_EN_On = 1,   /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER2_CLOCK_BKP_CLK_EN_Enum;

/* ====================================  MDR_RST_CLOCK PER2_CLOCK ADCIU_CLK_EN [13..13]  ===================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER2_CLOCK_ADCIU_CLK_EN                                     */
  MDR_RST_CLOCK_PER2_CLOCK_ADCIU_CLK_EN_Off = 0,/*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER2_CLOCK_ADCIU_CLK_EN_On = 1, /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER2_CLOCK_ADCIU_CLK_EN_Enum;

/* ====================================  MDR_RST_CLOCK PER2_CLOCK TIMER1_CLK_EN [14..14]  ==================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER2_CLOCK_TIMER1_CLK_EN                                    */
  MDR_RST_CLOCK_PER2_CLOCK_TIMER1_CLK_EN_Off = 0,/*!< Off : Clock Disabled                                                     */
  MDR_RST_CLOCK_PER2_CLOCK_TIMER1_CLK_EN_On = 1,/*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER2_CLOCK_TIMER1_CLK_EN_Enum;

/* ====================================  MDR_RST_CLOCK PER2_CLOCK TIMER2_CLK_EN [15..15]  ==================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER2_CLOCK_TIMER2_CLK_EN                                    */
  MDR_RST_CLOCK_PER2_CLOCK_TIMER2_CLK_EN_Off = 0,/*!< Off : Clock Disabled                                                     */
  MDR_RST_CLOCK_PER2_CLOCK_TIMER2_CLK_EN_On = 1,/*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER2_CLOCK_TIMER2_CLK_EN_Enum;

/* ====================================  MDR_RST_CLOCK PER2_CLOCK PORTA_CLK_EN [16..16]  ===================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER2_CLOCK_PORTA_CLK_EN                                     */
  MDR_RST_CLOCK_PER2_CLOCK_PORTA_CLK_EN_Off = 0,/*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER2_CLOCK_PORTA_CLK_EN_On = 1, /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER2_CLOCK_PORTA_CLK_EN_Enum;

