StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VK234.h
/* ==========================================================  RLR  ========================================================== */
/* ==========================================================  SR  =========================================================== */
/* ================================================  MDR_IWDT SR PVU [0..0]  ================================================= */
typedef enum {                                  /*!< MDR_IWDT_SR_PVU                                                           */
  MDR_IWDT_PVU___Ready                 = 0,     /*!< Ready : PR ready for write                                                */
  MDR_IWDT_PVU___Busy                  = 1,     /*!< Busy : PR busy                                                            */
} MDR_IWDT_PVU___Enum;

/* ================================================  MDR_IWDT SR RVU [1..1]  ================================================= */
typedef enum {                                  /*!< MDR_IWDT_SR_RVU                                                           */
  MDR_IWDT_RVU___Ready                 = 0,     /*!< Ready : PRL ready for write                                               */
  MDR_IWDT_RVU___Busy                  = 1,     /*!< Busy : PRL busy                                                           */
} MDR_IWDT_RVU___Enum;



/* =========================================================================================================================== */
/* ================                                          MDR_ADC                                          ================ */
/* =========================================================================================================================== */

/* =======================================================  ADC1_Cfg  ======================================================== */
/* =============================================  MDR_ADC ADC1_Cfg ADON [0..0]  ============================================== */
typedef enum {                                  /*!< MDR_ADC_ADC1_Cfg_ADON                                                     */
  MDR_ADC_ADC1_Cfg_ADON_Off            = 0,     /*!< Off : Disabled                                                            */
  MDR_ADC_ADC1_Cfg_ADON_On             = 1,     /*!< On : Enabled                                                              */
} MDR_ADC_ADC1_Cfg_ADON_Enum;

/* ==============================================  MDR_ADC ADC1_Cfg GO [1..1]  =============================================== */
typedef enum {                                  /*!< MDR_ADC_ADC1_Cfg_GO                                                       */
  MDR_ADC_ADC1_Cfg_GO_Inactive         = 0,     /*!< Inactive : Autoclear to zero after start                                  */
  MDR_ADC_ADC1_Cfg_GO_Start            = 1,     /*!< Start : Start measurement                                                 */
} MDR_ADC_ADC1_Cfg_GO_Enum;

/* =============================================  MDR_ADC ADC1_Cfg CLKS [2..2]  ============================================== */
typedef enum {                                  /*!< MDR_ADC_ADC1_Cfg_CLKS                                                     */
  MDR_ADC_ADC1_Cfg_CLKS_CPU_Clock      = 0,     /*!< CPU_Clock : CPU_Clock used                                                */
  MDR_ADC_ADC1_Cfg_CLKS_ADC_Clock      = 1,     /*!< ADC_Clock : ADC_Clock used                                                */
} MDR_ADC_ADC1_Cfg_CLKS_Enum;

/* ============================================  MDR_ADC ADC1_Cfg SAMPLE [3..3]  ============================================= */
typedef enum {                                  /*!< MDR_ADC_ADC1_Cfg_SAMPLE                                                   */
  MDR_ADC_ADC1_Cfg_SAMPLE_Single       = 0,     /*!< Single : Single measurement by GO                                         */
  MDR_ADC_ADC1_Cfg_SAMPLE_Continuouse  = 1,     /*!< Continuouse : Continuous measurement, until stop by ADON                  */
} MDR_ADC_ADC1_Cfg_SAMPLE_Enum;

/* ==============================================  MDR_ADC ADC1_Cfg CHS [4..8]  ============================================== */
typedef enum {                                  /*!< MDR_ADC_ADC1_Cfg_CHS                                                      */
  MDR_ADC_ADC1_Cfg_CHS_Channel_0_RefN  = 0,     /*!< Channel_0_RefN : Signal on PC4, Ref-                                      */
  MDR_ADC_ADC1_Cfg_CHS_Channel_1_RefP  = 1,     /*!< Channel_1_RefP : Signal on PC3, Ref+                                      */
  MDR_ADC_ADC1_Cfg_CHS_Channel_2       = 2,     /*!< Channel_2 : Signal on PC2                                                 */
  MDR_ADC_ADC1_Cfg_CHS_Channel_3       = 3,     /*!< Channel_3 : Signal on PC1                                                 */
  MDR_ADC_ADC1_Cfg_CHS_Channel_4       = 4,     /*!< Channel_4 : Signal on PB9                                                 */
  MDR_ADC_ADC1_Cfg_CHS_Channel_5       = 5,     /*!< Channel_5 : Signal on PB8                                                 */
  MDR_ADC_ADC1_Cfg_CHS_Channel_6       = 6,     /*!< Channel_6 : Signal on PB7                                                 */
  MDR_ADC_ADC1_Cfg_CHS_Channel_7       = 7,     /*!< Channel_7 : Signal on PB6                                                 */
  MDR_ADC_ADC1_Cfg_CHS_TS_VRef_1.23    = 30,    /*!< TS_VRef_1.23 : Signal from Thermosensor                                   */
  MDR_ADC_ADC1_Cfg_CHS_TS_Temperature  = 31,    /*!< TS_Temperature : Signal from Thermosensor                                 */
} MDR_ADC_ADC1_Cfg_CHS_Enum;

/* =============================================  MDR_ADC ADC1_Cfg CHCH [9..9]  ============================================== */
typedef enum {                                  /*!< MDR_ADC_ADC1_Cfg_CHCH                                                     */
  MDR_ADC_ADC1_Cfg_CHCH_Disable        = 0,     /*!< Disable : Measure only CHS channel                                        */
  MDR_ADC_ADC1_Cfg_CHCH_Enable         = 1,     /*!< Enable : Measure channels selected in reg CHSEL                           */
} MDR_ADC_ADC1_Cfg_CHCH_Enum;

/* ============================================  MDR_ADC ADC1_Cfg RGNC [10..10]  ============================================= */
typedef enum {                                  /*!< MDR_ADC_ADC1_Cfg_RGNC                                                     */
  MDR_ADC_ADC1_Cfg_RGNC_Disable        = 0,     /*!< Disable : Flag STATUSx.AWOIFEN inactive                                   */
  MDR_ADC_ADC1_Cfg_RGNC_Enable         = 1,     /*!< Enable : Flag STATUSx.AWOIFEN enable                                      */
} MDR_ADC_ADC1_Cfg_RGNC_Enum;

