StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VK234.h
/* ==========================================  MDR_ADC ADC1_CHSEL Channel_5 [5..5]  ========================================== */
typedef enum {                                  /*!< MDR_ADC_ADC1_CHSEL_Channel_5                                              */
  MDR_ADC_ADC1_CHSEL_Channel_5_Off     = 0,     /*!< Off : Not used in channels switching                                      */
  MDR_ADC_ADC1_CHSEL_Channel_5_Selected = 1,    /*!< Selected : Using in channels switching                                    */
} MDR_ADC_ADC1_CHSEL_Channel_5_Enum;

/* ==========================================  MDR_ADC ADC1_CHSEL Channel_6 [6..6]  ========================================== */
typedef enum {                                  /*!< MDR_ADC_ADC1_CHSEL_Channel_6                                              */
  MDR_ADC_ADC1_CHSEL_Channel_6_Off     = 0,     /*!< Off : Not used in channels switching                                      */
  MDR_ADC_ADC1_CHSEL_Channel_6_Selected = 1,    /*!< Selected : Using in channels switching                                    */
} MDR_ADC_ADC1_CHSEL_Channel_6_Enum;

/* ==========================================  MDR_ADC ADC1_CHSEL Channel_7 [7..7]  ========================================== */
typedef enum {                                  /*!< MDR_ADC_ADC1_CHSEL_Channel_7                                              */
  MDR_ADC_ADC1_CHSEL_Channel_7_Off     = 0,     /*!< Off : Not used in channels switching                                      */
  MDR_ADC_ADC1_CHSEL_Channel_7_Selected = 1,    /*!< Selected : Using in channels switching                                    */
} MDR_ADC_ADC1_CHSEL_Channel_7_Enum;

/* ========================================  MDR_ADC ADC1_CHSEL Channel_30 [30..30]  ========================================= */
typedef enum {                                  /*!< MDR_ADC_ADC1_CHSEL_Channel_30                                             */
  MDR_ADC_ADC1_CHSEL_Channel_30_Off    = 0,     /*!< Off : Not used in channels switching                                      */
  MDR_ADC_ADC1_CHSEL_Channel_30_Selected = 1,   /*!< Selected : Using in channels switching                                    */
} MDR_ADC_ADC1_CHSEL_Channel_30_Enum;

/* ========================================  MDR_ADC ADC1_CHSEL Channel_31 [31..31]  ========================================= */
typedef enum {                                  /*!< MDR_ADC_ADC1_CHSEL_Channel_31                                             */
  MDR_ADC_ADC1_CHSEL_Channel_31_Off    = 0,     /*!< Off : Not used in channels switching                                      */
  MDR_ADC_ADC1_CHSEL_Channel_31_Selected = 1,   /*!< Selected : Using in channels switching                                    */
} MDR_ADC_ADC1_CHSEL_Channel_31_Enum;

/* =======================================================  ADC1_TRIM  ======================================================= */
/* ===========================================  MDR_ADC ADC1_TRIM TS_Trim [1..5]  ============================================ */
typedef enum {                                  /*!< MDR_ADC_ADC1_TRIM_TS_Trim                                                 */
  MDR_ADC_ADC1_TRIM_TS_Trim_Vref_1v23  = 0,     /*!< Vref_1v23 : 1.23V typically                                               */
  MDR_ADC_ADC1_TRIM_TS_Trim_Vref_1v213 = 1,     /*!< Vref_1v213 : 1.213V typically                                             */
  MDR_ADC_ADC1_TRIM_TS_Trim_Vref_1v211 = 2,     /*!< Vref_1v211 : 1.211V typically                                             */
  MDR_ADC_ADC1_TRIM_TS_Trim_Vref_1v208 = 3,     /*!< Vref_1v208 : 1.208V typically                                             */
  MDR_ADC_ADC1_TRIM_TS_Trim_Vref_1v206 = 4,     /*!< Vref_1v206 : 1.206V typically                                             */
  MDR_ADC_ADC1_TRIM_TS_Trim_Vref_1v203 = 5,     /*!< Vref_1v203 : 1.203V typically                                             */
  MDR_ADC_ADC1_TRIM_TS_Trim_Vref_1v200 = 6,     /*!< Vref_1v200 : 1.200V typically                                             */
  MDR_ADC_ADC1_TRIM_TS_Trim_Vref_1v197 = 7,     /*!< Vref_1v197 : 1.197V typically                                             */
  MDR_ADC_ADC1_TRIM_TS_Trim_Vref_1v193 = 8,     /*!< Vref_1v193 : 1.193V typically                                             */
} MDR_ADC_ADC1_TRIM_TS_Trim_Enum;

/* =========================================  MDR_ADC ADC1_TRIM SEL_VREF_BUF [6..6]  ========================================= */
typedef enum {                                  /*!< MDR_ADC_ADC1_TRIM_SEL_VREF_BUF                                            */
  MDR_ADC_ADC1_TRIM_SEL_VREF_BUF_Disable = 0,   /*!< Disable : Channel 30 signal is undefined                                  */
  MDR_ADC_ADC1_TRIM_SEL_VREF_BUF_Selected = 1,  /*!< Selected : Channel 30 signal is VRef_Buf                                  */
} MDR_ADC_ADC1_TRIM_SEL_VREF_BUF_Enum;



/* =========================================================================================================================== */
/* ================                                          MDR_BKP                                          ================ */
/* =========================================================================================================================== */

/* ========================================================  REG_00  ========================================================= */
/* ========================================================  REG_01  ========================================================= */
/* ========================================================  REG_02  ========================================================= */
/* ========================================================  REG_03  ========================================================= */
/* ========================================================  REG_04  ========================================================= */
/* ========================================================  REG_05  ========================================================= */
/* ========================================================  REG_06  ========================================================= */
/* ========================================================  REG_07  ========================================================= */
/* ========================================================  REG_08  ========================================================= */
/* ========================================================  REG_09  ========================================================= */
/* ========================================================  REG_0A  ========================================================= */
/* ========================================================  REG_0B  ========================================================= */
/* ========================================================  REG_0C  ========================================================= */
/* ========================================================  REG_0D  ========================================================= */
/* ========================================================  REG_0E  ========================================================= */
/* ===============================================  MDR_BKP REG_0E LOW [0..2]  =============================================== */
typedef enum {                                  /*!< MDR_BKP_REG_0E_LOW                                                        */
  MDR_BKP_0E__LOW__10MHz               = 0,     /*!< 10MHz : CPU Clock less then 10MHz                                         */
  MDR_BKP_0E__LOW__200KHz              = 1,     /*!< 200KHz : CPU Clock less then 200KHz                                       */
  MDR_BKP_0E__LOW__500KHz              = 2,     /*!< 500KHz : CPU Clock less then 500KHz                                       */
  MDR_BKP_0E__LOW__1MHz                = 3,     /*!< 1MHz : CPU Clock less then 1MHz                                           */
  MDR_BKP_0E__LOW__GensOffz            = 4,     /*!< GensOffz : Generators Off                                                 */
  MDR_BKP_0E__LOW__40MHz               = 5,     /*!< 40MHz : CPU Clock less then 40MHz                                         */
  MDR_BKP_0E__LOW__80MHz               = 6,     /*!< 80MHz : CPU Clock less then 80MHz                                         */
  MDR_BKP_0E__LOW__above_80MHz         = 7,     /*!< above_80MHz : CPU Clock above 10MHz                                       */
} MDR_BKP_0E__LOW__Enum;

/* ============================================  MDR_BKP REG_0E SelectRI [3..5]  ============================================= */
typedef enum {                                  /*!< MDR_BKP_REG_0E_SelectRI                                                   */
  MDR_BKP_0E__SelRI__10MHz             = 0,     /*!< 10MHz : Additional I ~ 300uA                                              */
  MDR_BKP_0E__SelRI__200KHz            = 1,     /*!< 200KHz : Additional I ~ 6.6uA                                             */
  MDR_BKP_0E__SelRI__500KHz            = 2,     /*!< 500KHz : Additional I ~ 20A                                               */
  MDR_BKP_0E__SelRI__1MHz              = 3,     /*!< 1MHz : Additional I ~ 80uA                                                */
  MDR_BKP_0E__SelRI__GensOffz          = 4,     /*!< GensOffz : Additional I ~ 2uA                                             */
  MDR_BKP_0E__SelRI__40MHz             = 5,     /*!< 40MHz : Additional I ~ 900uA                                              */
  MDR_BKP_0E__SelRI__80MHz             = 6,     /*!< 80MHz : Additional I ~ 4.4mA                                              */
  MDR_BKP_0E__SelRI__above_80MHz       = 7,     /*!< above_80MHz : Additional I ~ 19mA                                         */
} MDR_BKP_0E__SelRI__Enum;

/* =============================================  MDR_BKP REG_0E Jtag_A [6..6]  ============================================== */
typedef enum {                                  /*!< MDR_BKP_REG_0E_Jtag_A                                                     */
  MDR_BKP_0E__JtagA__Disable           = 0,     /*!< Disable : Disabled                                                        */
  MDR_BKP_0E__JtagA__Enable            = 1,     /*!< Enable : Enabled                                                          */
} MDR_BKP_0E__JtagA__Enum;

/* =============================================  MDR_BKP REG_0E Jtag_B [7..7]  ============================================== */
typedef enum {                                  /*!< MDR_BKP_REG_0E_Jtag_B                                                     */
  MDR_BKP_0E__JtagB__Disable           = 0,     /*!< Disable : Disabled                                                        */
  MDR_BKP_0E__JtagB__Enable            = 1,     /*!< Enable : Enabled                                                          */
} MDR_BKP_0E__JtagB__Enum;

/* ===========================================  MDR_BKP REG_0E Trim_dDUcc [8..10]  =========================================== */
typedef enum {                                  /*!< MDR_BKP_REG_0E_Trim_dDUcc                                                 */
  MDR_BKP_0E__dDUcc__+0.1              = 0,     /*!< +0.1 : DUcc += 0.1 V                                                      */
  MDR_BKP_0E__dDUcc__+0.06             = 1,     /*!< +0.06 : DUcc += 0.06 V                                                    */
  MDR_BKP_0E__dDUcc__+0.04             = 2,     /*!< +0.04 : DUcc += 0.04 V                                                    */
  MDR_BKP_0E__dDUcc__+0.01             = 3,     /*!< +0.01 : DUcc += 0.01 V                                                    */
  MDR_BKP_0E__dDUcc__-0.01             = 4,     /*!< -0.01 : DUcc -= 0.01 V                                                    */
  MDR_BKP_0E__dDUcc__-0.04             = 5,     /*!< -0.04 : DUcc -= 0.04 V                                                    */
  MDR_BKP_0E__dDUcc__-0.6              = 6,     /*!< -0.6 : DUcc -= 0.06 V                                                     */
  MDR_BKP_0E__dDUcc__-0.1              = 7,     /*!< -0.1 : DUcc -= 0.1 V                                                      */
} MDR_BKP_0E__dDUcc__Enum;

/* =============================================  MDR_BKP REG_0E FPOR [11..11]  ============================================== */
typedef enum {                                  /*!< MDR_BKP_REG_0E_FPOR                                                       */
  MDR_BKP_0E__FPOR__Low                = 0,     /*!< Low : No Bootloader                                                       */
  MDR_BKP_0E__FPOR__High               = 1,     /*!< High : Bootloader completed                                               */
} MDR_BKP_0E__FPOR__Enum;

/* ===========================================  MDR_BKP REG_0E Trim_DUcc [12..13]  =========================================== */
typedef enum {                                  /*!< MDR_BKP_REG_0E_Trim_DUcc                                                  */
  MDR_BKP_0E__DUcc__1.8                = 0,     /*!< 1.8 : DUcc = 1.8 V                                                        */
  MDR_BKP_0E__DUcc__1.6                = 1,     /*!< 1.6 : DUcc = 1.6 V                                                        */
  MDR_BKP_0E__DUcc__1.4                = 2,     /*!< 1.4 : DUcc = 1.4 V                                                        */
  MDR_BKP_0E__DUcc__1.2                = 3,     /*!< 1.2 : DUcc = 1.2 V                                                        */
} MDR_BKP_0E__DUcc__Enum;

/* ============================================  MDR_BKP REG_0E COVDET [14..14]  ============================================= */
typedef enum {                                  /*!< MDR_BKP_REG_0E_COVDET                                                     */
  MDR_BKP_0E__COVDET__Off              = 0,     /*!< Off : No dreaking access detected                                         */
  MDR_BKP_0E__COVDET__On               = 1,     /*!< On : Breaking access detected                                             */
} MDR_BKP_0E__COVDET__Enum;

