StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VK234.h
/* ==============================================  MDR_ADCUI CTRL1 V0EN [1..1]  ============================================== */
typedef enum {                                  /*!< MDR_ADCUI_CTRL1_V0EN                                                      */
  MDR_ADCUI_CTRL1_V0EN_Off             = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_CTRL1_V0EN_On              = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_CTRL1_V0EN_Enum;

/* ==============================================  MDR_ADCUI CTRL1 I1EN [2..2]  ============================================== */
typedef enum {                                  /*!< MDR_ADCUI_CTRL1_I1EN                                                      */
  MDR_ADCUI_CTRL1_I1EN_Off             = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_CTRL1_I1EN_On              = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_CTRL1_I1EN_Enum;

/* ==============================================  MDR_ADCUI CTRL1 V1EN [3..3]  ============================================== */
typedef enum {                                  /*!< MDR_ADCUI_CTRL1_V1EN                                                      */
  MDR_ADCUI_CTRL1_V1EN_Off             = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_CTRL1_V1EN_On              = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_CTRL1_V1EN_Enum;

/* ==============================================  MDR_ADCUI CTRL1 I2EN [4..4]  ============================================== */
typedef enum {                                  /*!< MDR_ADCUI_CTRL1_I2EN                                                      */
  MDR_ADCUI_CTRL1_I2EN_Off             = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_CTRL1_I2EN_On              = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_CTRL1_I2EN_Enum;

/* ==============================================  MDR_ADCUI CTRL1 V2EN [5..5]  ============================================== */
typedef enum {                                  /*!< MDR_ADCUI_CTRL1_V2EN                                                      */
  MDR_ADCUI_CTRL1_V2EN_Off             = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_CTRL1_V2EN_On              = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_CTRL1_V2EN_Enum;

/* ==============================================  MDR_ADCUI CTRL1 I3EN [6..6]  ============================================== */
typedef enum {                                  /*!< MDR_ADCUI_CTRL1_I3EN                                                      */
  MDR_ADCUI_CTRL1_I3EN_Off             = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_CTRL1_I3EN_On              = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_CTRL1_I3EN_Enum;

/* =============================================  MDR_ADCUI CTRL1 RESOL [7..7]  ============================================== */
typedef enum {                                  /*!< MDR_ADCUI_CTRL1_RESOL                                                     */
  MDR_ADCUI_CTRL1_RESOL_bit_16         = 0,     /*!< bit_16 : 16 bit data                                                      */
  MDR_ADCUI_CTRL1_RESOL_bit_24         = 1,     /*!< bit_24 : 24 bit data                                                      */
} MDR_ADCUI_CTRL1_RESOL_Enum;

/* =============================================  MDR_ADCUI CTRL1 ZXLPF [8..8]  ============================================== */
typedef enum {                                  /*!< MDR_ADCUI_CTRL1_ZXLPF                                                     */
  MDR_ADCUI_CTRL1_ZXLPF_On             = 0,     /*!< On : Enabled                                                              */
  MDR_ADCUI_CTRL1_ZXLPF_Off            = 1,     /*!< Off : Disable                                                             */
} MDR_ADCUI_CTRL1_ZXLPF_Enum;

/* ==========================================  MDR_ADCUI CTRL1 PER_Length [9..11]  =========================================== */
typedef enum {                                  /*!< MDR_ADCUI_CTRL1_PER_Length                                                */
  MDR_ADCUI_CTRL1_PER_Length_Period_1  = 0,     /*!< Period_1 : 1 period                                                       */
  MDR_ADCUI_CTRL1_PER_Length_Period_2  = 1,     /*!< Period_2 : 2 periods                                                      */
  MDR_ADCUI_CTRL1_PER_Length_Period_3  = 2,     /*!< Period_3 : 4 periods                                                      */
  MDR_ADCUI_CTRL1_PER_Length_Period_4  = 3,     /*!< Period_4 : 8 periods                                                      */
  MDR_ADCUI_CTRL1_PER_Length_Period_5  = 4,     /*!< Period_5 : 16 periods                                                     */
  MDR_ADCUI_CTRL1_PER_Length_Period_6  = 5,     /*!< Period_6 : 32 periods                                                     */
  MDR_ADCUI_CTRL1_PER_Length_Period_7  = 6,     /*!< Period_7 : 64 periods                                                     */
  MDR_ADCUI_CTRL1_PER_Length_Period_8  = 7,     /*!< Period_8 : 128 periods                                                    */
} MDR_ADCUI_CTRL1_PER_Length_Enum;

/* ===========================================  MDR_ADCUI CTRL1 APNOLOAD [12..13]  =========================================== */
typedef enum {                                  /*!< MDR_ADCUI_CTRL1_APNOLOAD                                                  */
  MDR_ADCUI_CTRL1_APNOLOAD_All         = 0,     /*!< All : Accunulate All Energy                                               */
  MDR_ADCUI_CTRL1_APNOLOAD_lv_012      = 1,     /*!< lv_012 : Pass E less than 0.012%                                          */
  MDR_ADCUI_CTRL1_APNOLOAD_lv_0061     = 2,     /*!< lv_0061 : Pass E less than 0.0061%                                        */
  MDR_ADCUI_CTRL1_APNOLOAD_lv_00305    = 3,     /*!< lv_00305 : Pass E less than 0.00305%                                      */
} MDR_ADCUI_CTRL1_APNOLOAD_Enum;

/* ==========================================  MDR_ADCUI CTRL1 VARNOLOAD [15..16]  =========================================== */
typedef enum {                                  /*!< MDR_ADCUI_CTRL1_VARNOLOAD                                                 */
  MDR_ADCUI_CTRL1_VARNOLOAD_All        = 0,     /*!< All : Accunulate All Energy                                               */
  MDR_ADCUI_CTRL1_VARNOLOAD_lv_012     = 1,     /*!< lv_012 : Pass E less than 0.012%                                          */
  MDR_ADCUI_CTRL1_VARNOLOAD_lv_0061    = 2,     /*!< lv_0061 : Pass E less than 0.0061%                                        */
  MDR_ADCUI_CTRL1_VARNOLOAD_lv_00305   = 3,     /*!< lv_00305 : Pass E less than 0.00305%                                      */
} MDR_ADCUI_CTRL1_VARNOLOAD_Enum;

/* ===========================================  MDR_ADCUI CTRL1 VANOLOAD [17..18]  =========================================== */
typedef enum {                                  /*!< MDR_ADCUI_CTRL1_VANOLOAD                                                  */
  MDR_ADCUI_CTRL1_VANOLOAD_All         = 0,     /*!< All : Accunulate All Energy                                               */
  MDR_ADCUI_CTRL1_VANOLOAD_lv_012      = 1,     /*!< lv_012 : Pass E less than 0.012%                                          */
  MDR_ADCUI_CTRL1_VANOLOAD_lv_0061     = 2,     /*!< lv_0061 : Pass E less than 0.0061%                                        */
  MDR_ADCUI_CTRL1_VANOLOAD_lv_00305    = 3,     /*!< lv_00305 : Pass E less than 0.00305%                                      */
} MDR_ADCUI_CTRL1_VANOLOAD_Enum;

/* ===========================================  MDR_ADCUI CTRL1 FREQSEL [19..19]  ============================================ */
typedef enum {                                  /*!< MDR_ADCUI_CTRL1_FREQSEL                                                   */
  MDR_ADCUI_CTRL1_FREQSEL_Off          = 0,     /*!< Off : Hold Last value                                                     */
  MDR_ADCUI_CTRL1_FREQSEL_On           = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_CTRL1_FREQSEL_Enum;

/* ===========================================  MDR_ADCUI CTRL1 VREF_SEL [20..20]  =========================================== */
typedef enum {                                  /*!< MDR_ADCUI_CTRL1_VREF_SEL                                                  */
  MDR_ADCUI_CTRL1_VREF_SEL_Internal    = 0,     /*!< Internal : Internal Vref source                                           */
  MDR_ADCUI_CTRL1_VREF_SEL_External    = 1,     /*!< External : External Vref source                                           */
} MDR_ADCUI_CTRL1_VREF_SEL_Enum;

/* ===========================================  MDR_ADCUI CTRL1 BUF_BYP [21..21]  ============================================ */
typedef enum {                                  /*!< MDR_ADCUI_CTRL1_BUF_BYP                                                   */
  MDR_ADCUI_CTRL1_BUF_BYP_Buffered     = 0,     /*!< Buffered : Vref through buffer                                            */
  MDR_ADCUI_CTRL1_BUF_BYP_NotBuffered  = 1,     /*!< NotBuffered : Vref bypass buffer                                          */
} MDR_ADCUI_CTRL1_BUF_BYP_Enum;

/* ===========================================  MDR_ADCUI CTRL1 CHOP_EN [22..22]  ============================================ */
typedef enum {                                  /*!< MDR_ADCUI_CTRL1_CHOP_EN                                                   */
  MDR_ADCUI_CTRL1_CHOP_EN_Normal       = 0,     /*!< Normal : Normal mode                                                      */
  MDR_ADCUI_CTRL1_CHOP_EN_Chopper      = 1,     /*!< Chopper : Chopper mode                                                    */
} MDR_ADCUI_CTRL1_CHOP_EN_Enum;

