StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VK234.h
/* ==========================================  MDR_ADCUI CTRL1 CHOP_FREQ [23..24]  =========================================== */
typedef enum {                                  /*!< MDR_ADCUI_CTRL1_CHOP_FREQ                                                 */
  MDR_ADCUI_CTRL1_CHOP_FREQ_fADC_div2  = 0,     /*!< fADC_div2 : ADC freq div 2                                                */
  MDR_ADCUI_CTRL1_CHOP_FREQ_fADC_div4  = 1,     /*!< fADC_div4 : ADC freq div 4                                                */
  MDR_ADCUI_CTRL1_CHOP_FREQ_fADC_div8  = 2,     /*!< fADC_div8 : ADC freq div 8                                                */
  MDR_ADCUI_CTRL1_CHOP_FREQ_fADC_div16 = 3,     /*!< fADC_div16 : ADC freq div 16                                              */
} MDR_ADCUI_CTRL1_CHOP_FREQ_Enum;

/* ============================================  MDR_ADCUI CTRL1 ZXRMS [27..27]  ============================================= */
typedef enum {                                  /*!< MDR_ADCUI_CTRL1_ZXRMS                                                     */
  MDR_ADCUI_CTRL1_ZXRMS_Continuous     = 0,     /*!< Continuous : Continuous RMS update                                        */
  MDR_ADCUI_CTRL1_ZXRMS_OnZeroV0       = 1,     /*!< OnZeroV0 : Update on V0 cross zero level                                  */
} MDR_ADCUI_CTRL1_ZXRMS_Enum;

/* ==========================================  MDR_ADCUI CTRL1 RESET_DIG [28..28]  =========================================== */
typedef enum {                                  /*!< MDR_ADCUI_CTRL1_RESET_DIG                                                 */
  MDR_ADCUI_CTRL1_RESET_DIG_Inactive   = 0,     /*!< Inactive : Working mode                                                   */
  MDR_ADCUI_CTRL1_RESET_DIG_Reset      = 1,     /*!< Reset : Logic in reset                                                    */
} MDR_ADCUI_CTRL1_RESET_DIG_Enum;

/* ============================================  MDR_ADCUI CTRL1 IBOOST [29..29]  ============================================ */
typedef enum {                                  /*!< MDR_ADCUI_CTRL1_IBOOST                                                    */
  MDR_ADCUI_CTRL1_IBOOST_Normal        = 0,     /*!< Normal : Working mode                                                     */
  MDR_ADCUI_CTRL1_IBOOST_Boost         = 1,     /*!< Boost : Boost I enabled                                                   */
} MDR_ADCUI_CTRL1_IBOOST_Enum;

/* ===========================================  MDR_ADCUI CTRL1 OSR_CONF [30..31]  =========================================== */
typedef enum {                                  /*!< MDR_ADCUI_CTRL1_OSR_CONF                                                  */
  MDR_ADCUI_CTRL1_OSR_CONF_4kHz        = 0,     /*!< 4kHz : Sampling at 4kHz                                                   */
  MDR_ADCUI_CTRL1_OSR_CONF_8kHz        = 1,     /*!< 8kHz : Sampling at 8kHz                                                   */
  MDR_ADCUI_CTRL1_OSR_CONF_16kHz       = 2,     /*!< 16kHz : Sampling at 16kHz                                                 */
} MDR_ADCUI_CTRL1_OSR_CONF_Enum;

/* =========================================================  CTRL2  ========================================================= */
/* =========================================================  CTRL3  ========================================================= */
/* =========================================================  F0CTR  ========================================================= */
/* =============================================  MDR_ADCUI F0CTR I0NTEN [0..0]  ============================================= */
typedef enum {                                  /*!< MDR_ADCUI_F0CTR_I0NTEN                                                    */
  MDR_ADCUI_F0CTR_I0NTEN_Off           = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F0CTR_I0NTEN_On            = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F0CTR_I0NTEN_Enum;

/* =============================================  MDR_ADCUI F0CTR I3NTEN [1..1]  ============================================= */
typedef enum {                                  /*!< MDR_ADCUI_F0CTR_I3NTEN                                                    */
  MDR_ADCUI_F0CTR_I3NTEN_Off           = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F0CTR_I3NTEN_On            = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F0CTR_I3NTEN_Enum;

/* =============================================  MDR_ADCUI F0CTR VASEL [2..2]  ============================================== */
typedef enum {                                  /*!< MDR_ADCUI_F0CTR_VASEL                                                     */
  MDR_ADCUI_F0CTR_VASEL_FullEnergy     = 0,     /*!< FullEnergy : I0DAT and VDAT can store FullEnergy                          */
  MDR_ADCUI_F0CTR_VASEL_I_RMS          = 1,     /*!< I_RMS : I0DAT and VDAT can store I_RMS                                    */
} MDR_ADCUI_F0CTR_VASEL_Enum;

/* ==============================================  MDR_ADCUI F0CTR RARS [3..3]  ============================================== */
typedef enum {                                  /*!< MDR_ADCUI_F0CTR_RARS                                                      */
  MDR_ADCUI_F0CTR_RARS_Inactive        = 0,     /*!< Inactive : Inactive state                                                 */
  MDR_ADCUI_F0CTR_RARS_Clear           = 1,     /*!< Clear : Accumulator sets to zero                                          */
} MDR_ADCUI_F0CTR_RARS_Enum;

/* ==============================================  MDR_ADCUI F0CTR RRRS [4..4]  ============================================== */
typedef enum {                                  /*!< MDR_ADCUI_F0CTR_RRRS                                                      */
  MDR_ADCUI_F0CTR_RRRS_Inactive        = 0,     /*!< Inactive : Inactive state                                                 */
  MDR_ADCUI_F0CTR_RRRS_Clear           = 1,     /*!< Clear : Accumulator sets to zero                                          */
} MDR_ADCUI_F0CTR_RRRS_Enum;

/* ==============================================  MDR_ADCUI F0CTR RVRS [5..5]  ============================================== */
typedef enum {                                  /*!< MDR_ADCUI_F0CTR_RVRS                                                      */
  MDR_ADCUI_F0CTR_RVRS_Inactive        = 0,     /*!< Inactive : Inactive state                                                 */
  MDR_ADCUI_F0CTR_RVRS_Clear           = 1,     /*!< Clear : Accumulator sets to zero                                          */
} MDR_ADCUI_F0CTR_RVRS_Enum;

