StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VK234.h
/* =============================================  MDR_ADCUI F0CTR I0GAIN [6..7]  ============================================= */
typedef enum {                                  /*!< MDR_ADCUI_F0CTR_I0GAIN                                                    */
  MDR_ADCUI_F0CTR_I0GAIN_x1            = 0,     /*!< x1 : Signal amplification 0dB                                             */
  MDR_ADCUI_F0CTR_I0GAIN_x2            = 1,     /*!< x2 : Signal amplification 6dB                                             */
  MDR_ADCUI_F0CTR_I0GAIN_x4            = 2,     /*!< x4 : Signal amplification 12dB                                            */
  MDR_ADCUI_F0CTR_I0GAIN_x8            = 3,     /*!< x8 : Signal amplification 18dB                                            */
} MDR_ADCUI_F0CTR_I0GAIN_Enum;

/* =============================================  MDR_ADCUI F0CTR VGAIN [8..9]  ============================================== */
typedef enum {                                  /*!< MDR_ADCUI_F0CTR_VGAIN                                                     */
  MDR_ADCUI_F0CTR_VGAIN_x1             = 0,     /*!< x1 : Signal amplification 0dB                                             */
  MDR_ADCUI_F0CTR_VGAIN_x2             = 1,     /*!< x2 : Signal amplification 6dB                                             */
  MDR_ADCUI_F0CTR_VGAIN_x4             = 2,     /*!< x4 : Signal amplification 12dB                                            */
  MDR_ADCUI_F0CTR_VGAIN_x8             = 3,     /*!< x8 : Signal amplification 18dB                                            */
} MDR_ADCUI_F0CTR_VGAIN_Enum;

/* ============================================  MDR_ADCUI F0CTR I3GAIN [18..19]  ============================================ */
typedef enum {                                  /*!< MDR_ADCUI_F0CTR_I3GAIN                                                    */
  MDR_ADCUI_F0CTR_I3GAIN_x1            = 0,     /*!< x1 : Signal amplification 0dB                                             */
  MDR_ADCUI_F0CTR_I3GAIN_x2            = 1,     /*!< x2 : Signal amplification 6dB                                             */
  MDR_ADCUI_F0CTR_I3GAIN_x4            = 2,     /*!< x4 : Signal amplification 12dB                                            */
  MDR_ADCUI_F0CTR_I3GAIN_x8            = 3,     /*!< x8 : Signal amplification 18dB                                            */
} MDR_ADCUI_F0CTR_I3GAIN_Enum;

/* =========================================================  F0WC  ========================================================== */
/* ========================================================  F0WATTP  ======================================================== */
/* ========================================================  F0WATTN  ======================================================== */
/* =========================================================  F0VC  ========================================================== */
/* ========================================================  F0VARP  ========================================================= */
/* ========================================================  F0VARN  ========================================================= */
/* =========================================================  F0AC  ========================================================== */
/* =========================================================  F0VR  ========================================================== */
/* =========================================================  F0MD0  ========================================================= */
/* ==============================================  MDR_ADCUI F0MD0 VSEL [0..1]  ============================================== */
typedef enum {                                  /*!< MDR_ADCUI_F0MD0_VSEL                                                      */
  MDR_ADCUI_F0MD0_VSEL_ADC_V           = 0,     /*!< ADC_V : ADC_V output                                                      */
  MDR_ADCUI_F0MD0_VSEL_ActivePower     = 1,     /*!< ActivePower : Active Power                                                */
  MDR_ADCUI_F0MD0_VSEL_ReactivePower   = 2,     /*!< ReactivePower : Reactive Power                                            */
  MDR_ADCUI_F0MD0_VSEL_FullPower       = 3,     /*!< FullPower : Full Power                                                    */
} MDR_ADCUI_F0MD0_VSEL_Enum;

/* ==============================================  MDR_ADCUI F0MD0 ISEL [2..3]  ============================================== */
typedef enum {                                  /*!< MDR_ADCUI_F0MD0_ISEL                                                      */
  MDR_ADCUI_F0MD0_ISEL_ADC_I0          = 0,     /*!< ADC_I0 : ADC_I0 output                                                    */
  MDR_ADCUI_F0MD0_ISEL_ActivePower     = 1,     /*!< ActivePower : Active Power                                                */
  MDR_ADCUI_F0MD0_ISEL_ReactivePower   = 2,     /*!< ReactivePower : Reactive Power                                            */
  MDR_ADCUI_F0MD0_ISEL_FullPower       = 3,     /*!< FullPower : Full Power                                                    */
} MDR_ADCUI_F0MD0_ISEL_Enum;

/* ==============================================  MDR_ADCUI F0MD0 ACTS [4..4]  ============================================== */
typedef enum {                                  /*!< MDR_ADCUI_F0MD0_ACTS                                                      */
  MDR_ADCUI_F0MD0_ACTS_Pos             = 0,     /*!< Pos : Positive sign                                                       */
  MDR_ADCUI_F0MD0_ACTS_Neg             = 1,     /*!< Neg : Negative sign                                                       */
} MDR_ADCUI_F0MD0_ACTS_Enum;

/* =============================================  MDR_ADCUI F0MD0 REACTS [5..5]  ============================================= */
typedef enum {                                  /*!< MDR_ADCUI_F0MD0_REACTS                                                    */
  MDR_ADCUI_F0MD0_REACTS_Pos           = 0,     /*!< Pos : Positive sign                                                       */
  MDR_ADCUI_F0MD0_REACTS_Neg           = 1,     /*!< Neg : Negative sign                                                       */
} MDR_ADCUI_F0MD0_REACTS_Enum;

/* =============================================  MDR_ADCUI F0MD0 IOGAIN [6..6]  ============================================= */
typedef enum {                                  /*!< MDR_ADCUI_F0MD0_IOGAIN                                                    */
  MDR_ADCUI_F0MD0_IOGAIN_x1            = 0,     /*!< x1 : No gain                                                              */
  MDR_ADCUI_F0MD0_IOGAIN_x2            = 1,     /*!< x2 : Gain by +6dB                                                         */
} MDR_ADCUI_F0MD0_IOGAIN_Enum;

/* =============================================  MDR_ADCUI F0MD0 V0GAIN [7..7]  ============================================= */
typedef enum {                                  /*!< MDR_ADCUI_F0MD0_V0GAIN                                                    */
  MDR_ADCUI_F0MD0_V0GAIN_x1            = 0,     /*!< x1 : No gain                                                              */
  MDR_ADCUI_F0MD0_V0GAIN_x2            = 1,     /*!< x2 : Gain by +6dB                                                         */
} MDR_ADCUI_F0MD0_V0GAIN_Enum;

