StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VK234.h
/* =============================================  MDR_ADCUI F0MD0 I3GAIN [8..8]  ============================================= */
typedef enum {                                  /*!< MDR_ADCUI_F0MD0_I3GAIN                                                    */
  MDR_ADCUI_F0MD0_I3GAIN_x1            = 0,     /*!< x1 : No gain                                                              */
  MDR_ADCUI_F0MD0_I3GAIN_x2            = 1,     /*!< x2 : Gain by +6dB                                                         */
} MDR_ADCUI_F0MD0_I3GAIN_Enum;

/* ============================================  MDR_ADCUI F0MD0 I3SEL [29..29]  ============================================= */
typedef enum {                                  /*!< MDR_ADCUI_F0MD0_I3SEL                                                     */
  MDR_ADCUI_F0MD0_I3SEL_I3_LPF         = 0,     /*!< I3_LPF : Signal after LPF                                                 */
  MDR_ADCUI_F0MD0_I3SEL_ADC_I3         = 1,     /*!< ADC_I3 : ADC_I3 output                                                    */
} MDR_ADCUI_F0MD0_I3SEL_Enum;

/* ===========================================  MDR_ADCUI F0MD0 SEL_I_CH [30..31]  =========================================== */
typedef enum {                                  /*!< MDR_ADCUI_F0MD0_SEL_I_CH                                                  */
  MDR_ADCUI_F0MD0_SEL_I_CH_Auto_max    = 0,     /*!< Auto_max : Select max of I0 and I3                                        */
  MDR_ADCUI_F0MD0_SEL_I_CH_I0          = 1,     /*!< I0 : Calc Power by I0                                                     */
  MDR_ADCUI_F0MD0_SEL_I_CH_I3          = 2,     /*!< I3 : Calc Power by I3                                                     */
} MDR_ADCUI_F0MD0_SEL_I_CH_Enum;

/* =========================================================  F0MD1  ========================================================= */
/* ========================================================  F0VPEAK  ======================================================== */
/* ========================================================  F0IPEAK  ======================================================== */
/* ========================================================  F0VDAT  ========================================================= */
/* ========================================================  F0I0DAT  ======================================================== */
/* ========================================================  F0I3DAT  ======================================================== */
/* ========================================================  F0VRMS  ========================================================= */
/* ========================================================  F0VRMS2  ======================================================== */
/* ========================================================  F0IRMS  ========================================================= */
/* ========================================================  F0IRMS2  ======================================================== */
/* ========================================================  F0STAT  ========================================================= */
/* ============================================  MDR_ADCUI F0STAT VF_EMP [0..0]  ============================================= */
typedef enum {                                  /*!< MDR_ADCUI_F0STAT_VF_EMP                                                   */
  MDR_ADCUI_F0STAT_VF_EMP_Off          = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F0STAT_VF_EMP_On           = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F0STAT_VF_EMP_Enum;

/* ============================================  MDR_ADCUI F0STAT VF_FLL [1..1]  ============================================= */
typedef enum {                                  /*!< MDR_ADCUI_F0STAT_VF_FLL                                                   */
  MDR_ADCUI_F0STAT_VF_FLL_Off          = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F0STAT_VF_FLL_On           = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F0STAT_VF_FLL_Enum;

/* ============================================  MDR_ADCUI F0STAT VF_OVER [2..2]  ============================================ */
typedef enum {                                  /*!< MDR_ADCUI_F0STAT_VF_OVER                                                  */
  MDR_ADCUI_F0STAT_VF_OVER_Off         = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F0STAT_VF_OVER_On          = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F0STAT_VF_OVER_Enum;

/* ============================================  MDR_ADCUI F0STAT IF_EMP [3..3]  ============================================= */
typedef enum {                                  /*!< MDR_ADCUI_F0STAT_IF_EMP                                                   */
  MDR_ADCUI_F0STAT_IF_EMP_Off          = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F0STAT_IF_EMP_On           = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F0STAT_IF_EMP_Enum;

/* ============================================  MDR_ADCUI F0STAT IF_FLL [4..4]  ============================================= */
typedef enum {                                  /*!< MDR_ADCUI_F0STAT_IF_FLL                                                   */
  MDR_ADCUI_F0STAT_IF_FLL_Off          = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F0STAT_IF_FLL_On           = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F0STAT_IF_FLL_Enum;

/* ============================================  MDR_ADCUI F0STAT IF_OVER [5..5]  ============================================ */
typedef enum {                                  /*!< MDR_ADCUI_F0STAT_IF_OVER                                                  */
  MDR_ADCUI_F0STAT_IF_OVER_Off         = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F0STAT_IF_OVER_On          = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F0STAT_IF_OVER_Enum;

/* =============================================  MDR_ADCUI F0STAT SAGF [6..6]  ============================================== */
typedef enum {                                  /*!< MDR_ADCUI_F0STAT_SAGF                                                     */
  MDR_ADCUI_F0STAT_SAGF_Off            = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F0STAT_SAGF_On             = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F0STAT_SAGF_Enum;

