StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VK234.h
/* ============================================  MDR_ADCUI F0STAT PEAKVF [7..7]  ============================================= */
typedef enum {                                  /*!< MDR_ADCUI_F0STAT_PEAKVF                                                   */
  MDR_ADCUI_F0STAT_PEAKVF_Off          = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F0STAT_PEAKVF_On           = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F0STAT_PEAKVF_Enum;

/* ============================================  MDR_ADCUI F0STAT PEAKIF [8..8]  ============================================= */
typedef enum {                                  /*!< MDR_ADCUI_F0STAT_PEAKIF                                                   */
  MDR_ADCUI_F0STAT_PEAKIF_Off          = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F0STAT_PEAKIF_On           = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F0STAT_PEAKIF_Enum;

/* ============================================  MDR_ADCUI F0STAT WATTOVP [9..9]  ============================================ */
typedef enum {                                  /*!< MDR_ADCUI_F0STAT_WATTOVP                                                  */
  MDR_ADCUI_F0STAT_WATTOVP_Off         = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F0STAT_WATTOVP_On          = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F0STAT_WATTOVP_Enum;

/* ===========================================  MDR_ADCUI F0STAT VAROVP [10..10]  ============================================ */
typedef enum {                                  /*!< MDR_ADCUI_F0STAT_VAROVP                                                   */
  MDR_ADCUI_F0STAT_VAROVP_Off          = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F0STAT_VAROVP_On           = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F0STAT_VAROVP_Enum;

/* ============================================  MDR_ADCUI F0STAT VAOV [11..11]  ============================================= */
typedef enum {                                  /*!< MDR_ADCUI_F0STAT_VAOV                                                     */
  MDR_ADCUI_F0STAT_VAOV_Off            = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F0STAT_VAOV_On             = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F0STAT_VAOV_Enum;

/* ============================================  MDR_ADCUI F0STAT ZTXVF [12..12]  ============================================ */
typedef enum {                                  /*!< MDR_ADCUI_F0STAT_ZTXVF                                                    */
  MDR_ADCUI_F0STAT_ZTXVF_Off           = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F0STAT_ZTXVF_On            = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F0STAT_ZTXVF_Enum;

/* ==========================================  MDR_ADCUI F0STAT ICHANNEL [13..13]  =========================================== */
typedef enum {                                  /*!< MDR_ADCUI_F0STAT_ICHANNEL                                                 */
  MDR_ADCUI_F0STAT_ICHANNEL_I0         = 0,     /*!< I0 : I0 is active                                                         */
  MDR_ADCUI_F0STAT_ICHANNEL_I3         = 1,     /*!< I3 : I3 is active                                                         */
} MDR_ADCUI_F0STAT_ICHANNEL_Enum;

/* ==========================================  MDR_ADCUI F0STAT FAULTCON [14..14]  =========================================== */
typedef enum {                                  /*!< MDR_ADCUI_F0STAT_FAULTCON                                                 */
  MDR_ADCUI_F0STAT_FAULTCON_Off        = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F0STAT_FAULTCON_On         = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F0STAT_FAULTCON_Enum;

/* ===========================================  MDR_ADCUI F0STAT APSIGN [15..15]  ============================================ */
typedef enum {                                  /*!< MDR_ADCUI_F0STAT_APSIGN                                                   */
  MDR_ADCUI_F0STAT_APSIGN_Off          = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F0STAT_APSIGN_On           = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F0STAT_APSIGN_Enum;

/* ===========================================  MDR_ADCUI F0STAT APNLDFL [16..16]  =========================================== */
typedef enum {                                  /*!< MDR_ADCUI_F0STAT_APNLDFL                                                  */
  MDR_ADCUI_F0STAT_APNLDFL_Off         = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F0STAT_APNLDFL_On          = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F0STAT_APNLDFL_Enum;

/* ===========================================  MDR_ADCUI F0STAT VARSIGN [17..17]  =========================================== */
typedef enum {                                  /*!< MDR_ADCUI_F0STAT_VARSIGN                                                  */
  MDR_ADCUI_F0STAT_VARSIGN_Off         = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F0STAT_VARSIGN_On          = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F0STAT_VARSIGN_Enum;

/* ==========================================  MDR_ADCUI F0STAT VARNLDFL [18..18]  =========================================== */
typedef enum {                                  /*!< MDR_ADCUI_F0STAT_VARNLDFL                                                 */
  MDR_ADCUI_F0STAT_VARNLDFL_Off        = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F0STAT_VARNLDFL_On         = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F0STAT_VARNLDFL_Enum;

/* ===========================================  MDR_ADCUI F0STAT VANLDFL [20..20]  =========================================== */
typedef enum {                                  /*!< MDR_ADCUI_F0STAT_VANLDFL                                                  */
  MDR_ADCUI_F0STAT_VANLDFL_Off         = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F0STAT_VANLDFL_On          = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F0STAT_VANLDFL_Enum;

/* ===========================================  MDR_ADCUI F0STAT ZEROCRS [21..21]  =========================================== */
typedef enum {                                  /*!< MDR_ADCUI_F0STAT_ZEROCRS                                                  */
  MDR_ADCUI_F0STAT_ZEROCRS_Off         = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F0STAT_ZEROCRS_On          = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F0STAT_ZEROCRS_Enum;

/* ===========================================  MDR_ADCUI F0STAT I3F_EMP [22..22]  =========================================== */
typedef enum {                                  /*!< MDR_ADCUI_F0STAT_I3F_EMP                                                  */
  MDR_ADCUI_F0STAT_I3F_EMP_Off         = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F0STAT_I3F_EMP_On          = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F0STAT_I3F_EMP_Enum;

/* ===========================================  MDR_ADCUI F0STAT I3F_FLL [23..23]  =========================================== */
typedef enum {                                  /*!< MDR_ADCUI_F0STAT_I3F_FLL                                                  */
  MDR_ADCUI_F0STAT_I3F_FLL_Off         = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F0STAT_I3F_FLL_On          = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F0STAT_I3F_FLL_Enum;

