StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VK234.h
/* ==========================================  MDR_ADCUI F0STAT I3F_OVER [24..24]  =========================================== */
typedef enum {                                  /*!< MDR_ADCUI_F0STAT_I3F_OVER                                                 */
  MDR_ADCUI_F0STAT_I3F_OVER_Off        = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F0STAT_I3F_OVER_On         = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F0STAT_I3F_OVER_Enum;

/* ===========================================  MDR_ADCUI F0STAT WATTOVN [25..25]  =========================================== */
typedef enum {                                  /*!< MDR_ADCUI_F0STAT_WATTOVN                                                  */
  MDR_ADCUI_F0STAT_WATTOVN_Off         = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F0STAT_WATTOVN_On          = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F0STAT_WATTOVN_Enum;

/* ===========================================  MDR_ADCUI F0STAT VAROVN [26..26]  ============================================ */
typedef enum {                                  /*!< MDR_ADCUI_F0STAT_VAROVN                                                   */
  MDR_ADCUI_F0STAT_VAROVN_Off          = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F0STAT_VAROVN_On           = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F0STAT_VAROVN_Enum;

/* ========================================================  F0MASK  ========================================================= */
/* ============================================  MDR_ADCUI F0MASK VF_EMPM [0..0]  ============================================ */
typedef enum {                                  /*!< MDR_ADCUI_F0MASK_VF_EMPM                                                  */
  MDR_ADCUI_F0MASK_VF_EMPM_Off         = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F0MASK_VF_EMPM_On          = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F0MASK_VF_EMPM_Enum;

/* ============================================  MDR_ADCUI F0MASK VF_FLLM [1..1]  ============================================ */
typedef enum {                                  /*!< MDR_ADCUI_F0MASK_VF_FLLM                                                  */
  MDR_ADCUI_F0MASK_VF_FLLM_Off         = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F0MASK_VF_FLLM_On          = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F0MASK_VF_FLLM_Enum;

/* ===========================================  MDR_ADCUI F0MASK VF_OVERM [2..2]  ============================================ */
typedef enum {                                  /*!< MDR_ADCUI_F0MASK_VF_OVERM                                                 */
  MDR_ADCUI_F0MASK_VF_OVERM_Off        = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F0MASK_VF_OVERM_On         = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F0MASK_VF_OVERM_Enum;

/* ============================================  MDR_ADCUI F0MASK IF_EMPM [3..3]  ============================================ */
typedef enum {                                  /*!< MDR_ADCUI_F0MASK_IF_EMPM                                                  */
  MDR_ADCUI_F0MASK_IF_EMPM_Off         = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F0MASK_IF_EMPM_On          = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F0MASK_IF_EMPM_Enum;

/* ============================================  MDR_ADCUI F0MASK IF_FLLM [4..4]  ============================================ */
typedef enum {                                  /*!< MDR_ADCUI_F0MASK_IF_FLLM                                                  */
  MDR_ADCUI_F0MASK_IF_FLLM_Off         = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F0MASK_IF_FLLM_On          = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F0MASK_IF_FLLM_Enum;

/* ===========================================  MDR_ADCUI F0MASK IF_OVERM [5..5]  ============================================ */
typedef enum {                                  /*!< MDR_ADCUI_F0MASK_IF_OVERM                                                 */
  MDR_ADCUI_F0MASK_IF_OVERM_Off        = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F0MASK_IF_OVERM_On         = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F0MASK_IF_OVERM_Enum;

/* =============================================  MDR_ADCUI F0MASK SAGFM [6..6]  ============================================= */
typedef enum {                                  /*!< MDR_ADCUI_F0MASK_SAGFM                                                    */
  MDR_ADCUI_F0MASK_SAGFM_Off           = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F0MASK_SAGFM_On            = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F0MASK_SAGFM_Enum;

/* ============================================  MDR_ADCUI F0MASK PEAKVFM [7..7]  ============================================ */
typedef enum {                                  /*!< MDR_ADCUI_F0MASK_PEAKVFM                                                  */
  MDR_ADCUI_F0MASK_PEAKVFM_Off         = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F0MASK_PEAKVFM_On          = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F0MASK_PEAKVFM_Enum;

