StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VK234.h
/* ============================================  MDR_ADCUI F0MASK PEAKIFM [8..8]  ============================================ */
typedef enum {                                  /*!< MDR_ADCUI_F0MASK_PEAKIFM                                                  */
  MDR_ADCUI_F0MASK_PEAKIFM_Off         = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F0MASK_PEAKIFM_On          = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F0MASK_PEAKIFM_Enum;

/* ===========================================  MDR_ADCUI F0MASK WATTOVPM [9..9]  ============================================ */
typedef enum {                                  /*!< MDR_ADCUI_F0MASK_WATTOVPM                                                 */
  MDR_ADCUI_F0MASK_WATTOVPM_Off        = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F0MASK_WATTOVPM_On         = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F0MASK_WATTOVPM_Enum;

/* ===========================================  MDR_ADCUI F0MASK VAROVPM [10..10]  =========================================== */
typedef enum {                                  /*!< MDR_ADCUI_F0MASK_VAROVPM                                                  */
  MDR_ADCUI_F0MASK_VAROVPM_Off         = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F0MASK_VAROVPM_On          = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F0MASK_VAROVPM_Enum;

/* ============================================  MDR_ADCUI F0MASK VAOVM [11..11]  ============================================ */
typedef enum {                                  /*!< MDR_ADCUI_F0MASK_VAOVM                                                    */
  MDR_ADCUI_F0MASK_VAOVM_Off           = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F0MASK_VAOVM_On            = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F0MASK_VAOVM_Enum;

/* ===========================================  MDR_ADCUI F0MASK ZTXVFM [12..12]  ============================================ */
typedef enum {                                  /*!< MDR_ADCUI_F0MASK_ZTXVFM                                                   */
  MDR_ADCUI_F0MASK_ZTXVFM_Off          = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F0MASK_ZTXVFM_On           = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F0MASK_ZTXVFM_Enum;

/* ==========================================  MDR_ADCUI F0MASK FAULTCONM [14..14]  ========================================== */
typedef enum {                                  /*!< MDR_ADCUI_F0MASK_FAULTCONM                                                */
  MDR_ADCUI_F0MASK_FAULTCONM_Off       = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F0MASK_FAULTCONM_On        = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F0MASK_FAULTCONM_Enum;

/* ===========================================  MDR_ADCUI F0MASK APSIGNM [15..15]  =========================================== */
typedef enum {                                  /*!< MDR_ADCUI_F0MASK_APSIGNM                                                  */
  MDR_ADCUI_F0MASK_APSIGNM_Off         = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F0MASK_APSIGNM_On          = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F0MASK_APSIGNM_Enum;

/* ==========================================  MDR_ADCUI F0MASK APNLDFLM [16..16]  =========================================== */
typedef enum {                                  /*!< MDR_ADCUI_F0MASK_APNLDFLM                                                 */
  MDR_ADCUI_F0MASK_APNLDFLM_Off        = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F0MASK_APNLDFLM_On         = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F0MASK_APNLDFLM_Enum;

/* ==========================================  MDR_ADCUI F0MASK VARSIGNM [17..17]  =========================================== */
typedef enum {                                  /*!< MDR_ADCUI_F0MASK_VARSIGNM                                                 */
  MDR_ADCUI_F0MASK_VARSIGNM_Off        = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F0MASK_VARSIGNM_On         = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F0MASK_VARSIGNM_Enum;

/* ==========================================  MDR_ADCUI F0MASK VARNLDFLM [18..18]  ========================================== */
typedef enum {                                  /*!< MDR_ADCUI_F0MASK_VARNLDFLM                                                */
  MDR_ADCUI_F0MASK_VARNLDFLM_Off       = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F0MASK_VARNLDFLM_On        = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F0MASK_VARNLDFLM_Enum;

/* ==========================================  MDR_ADCUI F0MASK VANLDFLM [20..20]  =========================================== */
typedef enum {                                  /*!< MDR_ADCUI_F0MASK_VANLDFLM                                                 */
  MDR_ADCUI_F0MASK_VANLDFLM_Off        = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F0MASK_VANLDFLM_On         = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F0MASK_VANLDFLM_Enum;

/* ==========================================  MDR_ADCUI F0MASK ZEROCRSM [21..21]  =========================================== */
typedef enum {                                  /*!< MDR_ADCUI_F0MASK_ZEROCRSM                                                 */
  MDR_ADCUI_F0MASK_ZEROCRSM_Off        = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F0MASK_ZEROCRSM_On         = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F0MASK_ZEROCRSM_Enum;

/* ==========================================  MDR_ADCUI F0MASK I3F_EMPM [22..22]  =========================================== */
typedef enum {                                  /*!< MDR_ADCUI_F0MASK_I3F_EMPM                                                 */
  MDR_ADCUI_F0MASK_I3F_EMPM_Off        = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F0MASK_I3F_EMPM_On         = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F0MASK_I3F_EMPM_Enum;

/* ==========================================  MDR_ADCUI F0MASK I3F_FLLM [23..23]  =========================================== */
typedef enum {                                  /*!< MDR_ADCUI_F0MASK_I3F_FLLM                                                 */
  MDR_ADCUI_F0MASK_I3F_FLLM_Off        = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F0MASK_I3F_FLLM_On         = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F0MASK_I3F_FLLM_Enum;

/* ==========================================  MDR_ADCUI F0MASK I3F_OVERM [24..24]  ========================================== */
typedef enum {                                  /*!< MDR_ADCUI_F0MASK_I3F_OVERM                                                */
  MDR_ADCUI_F0MASK_I3F_OVERM_Off       = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F0MASK_I3F_OVERM_On        = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F0MASK_I3F_OVERM_Enum;

/* ==========================================  MDR_ADCUI F0MASK WATTOVNM [25..25]  =========================================== */
typedef enum {                                  /*!< MDR_ADCUI_F0MASK_WATTOVNM                                                 */
  MDR_ADCUI_F0MASK_WATTOVNM_Off        = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F0MASK_WATTOVNM_On         = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F0MASK_WATTOVNM_Enum;

/* ===========================================  MDR_ADCUI F0MASK VAROVNM [26..26]  =========================================== */
typedef enum {                                  /*!< MDR_ADCUI_F0MASK_VAROVNM                                                  */
  MDR_ADCUI_F0MASK_VAROVNM_Off         = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F0MASK_VAROVNM_On          = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F0MASK_VAROVNM_Enum;

