StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VK234.h
/* =========================================================  F1CTR  ========================================================= */
/* =============================================  MDR_ADCUI F1CTR INTEN [0..0]  ============================================== */
typedef enum {                                  /*!< MDR_ADCUI_F1CTR_INTEN                                                     */
  MDR_ADCUI_F1CTR_INTEN_Off            = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F1CTR_INTEN_On             = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F1CTR_INTEN_Enum;

/* =============================================  MDR_ADCUI F1CTR VASEL [2..2]  ============================================== */
typedef enum {                                  /*!< MDR_ADCUI_F1CTR_VASEL                                                     */
  MDR_ADCUI_F1CTR_VASEL_FullEnergy     = 0,     /*!< FullEnergy : IDAT and VDAT can store FullEnergy                           */
  MDR_ADCUI_F1CTR_VASEL_I_RMS          = 1,     /*!< I_RMS : IDAT and VDAT can store I_RMS                                     */
} MDR_ADCUI_F1CTR_VASEL_Enum;

/* ==============================================  MDR_ADCUI F1CTR RARS [3..3]  ============================================== */
typedef enum {                                  /*!< MDR_ADCUI_F1CTR_RARS                                                      */
  MDR_ADCUI_F1CTR_RARS_Inactive        = 0,     /*!< Inactive : Inactive state                                                 */
  MDR_ADCUI_F1CTR_RARS_Clear           = 1,     /*!< Clear : Accumulator sets to zero                                          */
} MDR_ADCUI_F1CTR_RARS_Enum;

/* ==============================================  MDR_ADCUI F1CTR RRRS [4..4]  ============================================== */
typedef enum {                                  /*!< MDR_ADCUI_F1CTR_RRRS                                                      */
  MDR_ADCUI_F1CTR_RRRS_Inactive        = 0,     /*!< Inactive : Inactive state                                                 */
  MDR_ADCUI_F1CTR_RRRS_Clear           = 1,     /*!< Clear : Accumulator sets to zero                                          */
} MDR_ADCUI_F1CTR_RRRS_Enum;

/* ==============================================  MDR_ADCUI F1CTR RVRS [5..5]  ============================================== */
typedef enum {                                  /*!< MDR_ADCUI_F1CTR_RVRS                                                      */
  MDR_ADCUI_F1CTR_RVRS_Inactive        = 0,     /*!< Inactive : Inactive state                                                 */
  MDR_ADCUI_F1CTR_RVRS_Clear           = 1,     /*!< Clear : Accumulator sets to zero                                          */
} MDR_ADCUI_F1CTR_RVRS_Enum;

/* =============================================  MDR_ADCUI F1CTR IGAIN [6..7]  ============================================== */
typedef enum {                                  /*!< MDR_ADCUI_F1CTR_IGAIN                                                     */
  MDR_ADCUI_F1CTR_IGAIN_x1             = 0,     /*!< x1 : Signal amplification 0dB                                             */
  MDR_ADCUI_F1CTR_IGAIN_x2             = 1,     /*!< x2 : Signal amplification 6dB                                             */
  MDR_ADCUI_F1CTR_IGAIN_x4             = 2,     /*!< x4 : Signal amplification 12dB                                            */
  MDR_ADCUI_F1CTR_IGAIN_x8             = 3,     /*!< x8 : Signal amplification 18dB                                            */
} MDR_ADCUI_F1CTR_IGAIN_Enum;

/* =============================================  MDR_ADCUI F1CTR VGAIN [8..9]  ============================================== */
typedef enum {                                  /*!< MDR_ADCUI_F1CTR_VGAIN                                                     */
  MDR_ADCUI_F1CTR_VGAIN_x1             = 0,     /*!< x1 : Signal amplification 0dB                                             */
  MDR_ADCUI_F1CTR_VGAIN_x2             = 1,     /*!< x2 : Signal amplification 6dB                                             */
  MDR_ADCUI_F1CTR_VGAIN_x4             = 2,     /*!< x4 : Signal amplification 12dB                                            */
  MDR_ADCUI_F1CTR_VGAIN_x8             = 3,     /*!< x8 : Signal amplification 18dB                                            */
} MDR_ADCUI_F1CTR_VGAIN_Enum;

/* =========================================================  F1WC  ========================================================== */
/* ========================================================  F1WATTP  ======================================================== */
/* ========================================================  F1WATTN  ======================================================== */
/* =========================================================  F1VC  ========================================================== */
/* ========================================================  F1VARP  ========================================================= */
/* ========================================================  F1VARN  ========================================================= */
/* =========================================================  F1AC  ========================================================== */
/* =========================================================  F1VR  ========================================================== */
/* =========================================================  F1MD0  ========================================================= */
/* ==============================================  MDR_ADCUI F1MD0 VSEL [0..1]  ============================================== */
typedef enum {                                  /*!< MDR_ADCUI_F1MD0_VSEL                                                      */
  MDR_ADCUI_F1MD0_VSEL_ADC_V           = 0,     /*!< ADC_V : ADC_V output                                                      */
  MDR_ADCUI_F1MD0_VSEL_ActivePower     = 1,     /*!< ActivePower : Active Power                                                */
  MDR_ADCUI_F1MD0_VSEL_ReactivePower   = 2,     /*!< ReactivePower : Reactive Power                                            */
  MDR_ADCUI_F1MD0_VSEL_FullPower       = 3,     /*!< FullPower : Full Power                                                    */
} MDR_ADCUI_F1MD0_VSEL_Enum;

/* ==============================================  MDR_ADCUI F1MD0 ISEL [2..3]  ============================================== */
typedef enum {                                  /*!< MDR_ADCUI_F1MD0_ISEL                                                      */
  MDR_ADCUI_F1MD0_ISEL_ADC_I           = 0,     /*!< ADC_I : ADC_I output                                                      */
  MDR_ADCUI_F1MD0_ISEL_ActivePower     = 1,     /*!< ActivePower : Active Power                                                */
  MDR_ADCUI_F1MD0_ISEL_ReactivePower   = 2,     /*!< ReactivePower : Reactive Power                                            */
  MDR_ADCUI_F1MD0_ISEL_FullPower       = 3,     /*!< FullPower : Full Power                                                    */
} MDR_ADCUI_F1MD0_ISEL_Enum;

