StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VK234.h
/* ==============================================  MDR_ADCUI F1MD0 ACTS [4..4]  ============================================== */
typedef enum {                                  /*!< MDR_ADCUI_F1MD0_ACTS                                                      */
  MDR_ADCUI_F1MD0_ACTS_Pos             = 0,     /*!< Pos : Positive sign                                                       */
  MDR_ADCUI_F1MD0_ACTS_Neg             = 1,     /*!< Neg : Negative sign                                                       */
} MDR_ADCUI_F1MD0_ACTS_Enum;

/* =============================================  MDR_ADCUI F1MD0 REACTS [5..5]  ============================================= */
typedef enum {                                  /*!< MDR_ADCUI_F1MD0_REACTS                                                    */
  MDR_ADCUI_F1MD0_REACTS_Pos           = 0,     /*!< Pos : Positive sign                                                       */
  MDR_ADCUI_F1MD0_REACTS_Neg           = 1,     /*!< Neg : Negative sign                                                       */
} MDR_ADCUI_F1MD0_REACTS_Enum;

/* =============================================  MDR_ADCUI F1MD0 IGAIN [6..6]  ============================================== */
typedef enum {                                  /*!< MDR_ADCUI_F1MD0_IGAIN                                                     */
  MDR_ADCUI_F1MD0_IGAIN_x1             = 0,     /*!< x1 : No gain                                                              */
  MDR_ADCUI_F1MD0_IGAIN_x2             = 1,     /*!< x2 : Gain by +6dB                                                         */
} MDR_ADCUI_F1MD0_IGAIN_Enum;

/* =============================================  MDR_ADCUI F1MD0 VGAIN [7..7]  ============================================== */
typedef enum {                                  /*!< MDR_ADCUI_F1MD0_VGAIN                                                     */
  MDR_ADCUI_F1MD0_VGAIN_x1             = 0,     /*!< x1 : No gain                                                              */
  MDR_ADCUI_F1MD0_VGAIN_x2             = 1,     /*!< x2 : Gain by +6dB                                                         */
} MDR_ADCUI_F1MD0_VGAIN_Enum;

/* =========================================================  F1MD1  ========================================================= */
/* =========================================================  F1MD2  ========================================================= */
/* ========================================================  F1VPEAK  ======================================================== */
/* ========================================================  F1IPEAK  ======================================================== */
/* ========================================================  F1VDAT  ========================================================= */
/* ========================================================  F1IDAT  ========================================================= */
/* ========================================================  F1VRMS  ========================================================= */
/* ========================================================  F1VRMS2  ======================================================== */
/* ========================================================  F1IRMS  ========================================================= */
/* ========================================================  F1IRMS2  ======================================================== */
/* ========================================================  F1STAT  ========================================================= */
/* ============================================  MDR_ADCUI F1STAT VF_EMP [0..0]  ============================================= */
typedef enum {                                  /*!< MDR_ADCUI_F1STAT_VF_EMP                                                   */
  MDR_ADCUI_F1STAT_VF_EMP_Off          = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F1STAT_VF_EMP_On           = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F1STAT_VF_EMP_Enum;

/* ============================================  MDR_ADCUI F1STAT VF_FLL [1..1]  ============================================= */
typedef enum {                                  /*!< MDR_ADCUI_F1STAT_VF_FLL                                                   */
  MDR_ADCUI_F1STAT_VF_FLL_Off          = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F1STAT_VF_FLL_On           = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F1STAT_VF_FLL_Enum;

/* ============================================  MDR_ADCUI F1STAT VF_OVER [2..2]  ============================================ */
typedef enum {                                  /*!< MDR_ADCUI_F1STAT_VF_OVER                                                  */
  MDR_ADCUI_F1STAT_VF_OVER_Off         = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F1STAT_VF_OVER_On          = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F1STAT_VF_OVER_Enum;

/* ============================================  MDR_ADCUI F1STAT IF_EMP [3..3]  ============================================= */
typedef enum {                                  /*!< MDR_ADCUI_F1STAT_IF_EMP                                                   */
  MDR_ADCUI_F1STAT_IF_EMP_Off          = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F1STAT_IF_EMP_On           = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F1STAT_IF_EMP_Enum;

/* ============================================  MDR_ADCUI F1STAT IF_FLL [4..4]  ============================================= */
typedef enum {                                  /*!< MDR_ADCUI_F1STAT_IF_FLL                                                   */
  MDR_ADCUI_F1STAT_IF_FLL_Off          = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F1STAT_IF_FLL_On           = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F1STAT_IF_FLL_Enum;

/* ============================================  MDR_ADCUI F1STAT IF_OVER [5..5]  ============================================ */
typedef enum {                                  /*!< MDR_ADCUI_F1STAT_IF_OVER                                                  */
  MDR_ADCUI_F1STAT_IF_OVER_Off         = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F1STAT_IF_OVER_On          = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F1STAT_IF_OVER_Enum;

/* =============================================  MDR_ADCUI F1STAT SAGF [6..6]  ============================================== */
typedef enum {                                  /*!< MDR_ADCUI_F1STAT_SAGF                                                     */
  MDR_ADCUI_F1STAT_SAGF_Off            = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F1STAT_SAGF_On             = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F1STAT_SAGF_Enum;

