StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VK234.h
/* ============================================  MDR_ADCUI F1STAT PEAKVF [7..7]  ============================================= */
typedef enum {                                  /*!< MDR_ADCUI_F1STAT_PEAKVF                                                   */
  MDR_ADCUI_F1STAT_PEAKVF_Off          = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F1STAT_PEAKVF_On           = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F1STAT_PEAKVF_Enum;

/* ============================================  MDR_ADCUI F1STAT PEAKIF [8..8]  ============================================= */
typedef enum {                                  /*!< MDR_ADCUI_F1STAT_PEAKIF                                                   */
  MDR_ADCUI_F1STAT_PEAKIF_Off          = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F1STAT_PEAKIF_On           = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F1STAT_PEAKIF_Enum;

/* ============================================  MDR_ADCUI F1STAT WATTOVP [9..9]  ============================================ */
typedef enum {                                  /*!< MDR_ADCUI_F1STAT_WATTOVP                                                  */
  MDR_ADCUI_F1STAT_WATTOVP_Off         = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F1STAT_WATTOVP_On          = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F1STAT_WATTOVP_Enum;

/* ===========================================  MDR_ADCUI F1STAT VAROVP [10..10]  ============================================ */
typedef enum {                                  /*!< MDR_ADCUI_F1STAT_VAROVP                                                   */
  MDR_ADCUI_F1STAT_VAROVP_Off          = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F1STAT_VAROVP_On           = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F1STAT_VAROVP_Enum;

/* ============================================  MDR_ADCUI F1STAT VAOV [11..11]  ============================================= */
typedef enum {                                  /*!< MDR_ADCUI_F1STAT_VAOV                                                     */
  MDR_ADCUI_F1STAT_VAOV_Off            = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F1STAT_VAOV_On             = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F1STAT_VAOV_Enum;

/* ============================================  MDR_ADCUI F1STAT ZTXVF [12..12]  ============================================ */
typedef enum {                                  /*!< MDR_ADCUI_F1STAT_ZTXVF                                                    */
  MDR_ADCUI_F1STAT_ZTXVF_Off           = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F1STAT_ZTXVF_On            = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F1STAT_ZTXVF_Enum;

/* ===========================================  MDR_ADCUI F1STAT APSIGN [15..15]  ============================================ */
typedef enum {                                  /*!< MDR_ADCUI_F1STAT_APSIGN                                                   */
  MDR_ADCUI_F1STAT_APSIGN_Off          = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F1STAT_APSIGN_On           = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F1STAT_APSIGN_Enum;

/* ===========================================  MDR_ADCUI F1STAT APNLDFL [16..16]  =========================================== */
typedef enum {                                  /*!< MDR_ADCUI_F1STAT_APNLDFL                                                  */
  MDR_ADCUI_F1STAT_APNLDFL_Off         = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F1STAT_APNLDFL_On          = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F1STAT_APNLDFL_Enum;

/* ===========================================  MDR_ADCUI F1STAT VARSIGN [17..17]  =========================================== */
typedef enum {                                  /*!< MDR_ADCUI_F1STAT_VARSIGN                                                  */
  MDR_ADCUI_F1STAT_VARSIGN_Off         = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F1STAT_VARSIGN_On          = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F1STAT_VARSIGN_Enum;

/* ==========================================  MDR_ADCUI F1STAT VARNLDFL [18..18]  =========================================== */
typedef enum {                                  /*!< MDR_ADCUI_F1STAT_VARNLDFL                                                 */
  MDR_ADCUI_F1STAT_VARNLDFL_Off        = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F1STAT_VARNLDFL_On         = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F1STAT_VARNLDFL_Enum;

/* ===========================================  MDR_ADCUI F1STAT VANLDFL [20..20]  =========================================== */
typedef enum {                                  /*!< MDR_ADCUI_F1STAT_VANLDFL                                                  */
  MDR_ADCUI_F1STAT_VANLDFL_Off         = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F1STAT_VANLDFL_On          = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F1STAT_VANLDFL_Enum;

/* ===========================================  MDR_ADCUI F1STAT ZEROCRS [21..21]  =========================================== */
typedef enum {                                  /*!< MDR_ADCUI_F1STAT_ZEROCRS                                                  */
  MDR_ADCUI_F1STAT_ZEROCRS_Off         = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F1STAT_ZEROCRS_On          = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F1STAT_ZEROCRS_Enum;

