StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VK234.h
/* ===========================================  MDR_ADCUI F1STAT WATTOVN [25..25]  =========================================== */
typedef enum {                                  /*!< MDR_ADCUI_F1STAT_WATTOVN                                                  */
  MDR_ADCUI_F1STAT_WATTOVN_Off         = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F1STAT_WATTOVN_On          = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F1STAT_WATTOVN_Enum;

/* ===========================================  MDR_ADCUI F1STAT VAROVN [26..26]  ============================================ */
typedef enum {                                  /*!< MDR_ADCUI_F1STAT_VAROVN                                                   */
  MDR_ADCUI_F1STAT_VAROVN_Off          = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F1STAT_VAROVN_On           = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F1STAT_VAROVN_Enum;

/* ========================================================  F1MASK  ========================================================= */
/* ============================================  MDR_ADCUI F1MASK VF_EMPM [0..0]  ============================================ */
typedef enum {                                  /*!< MDR_ADCUI_F1MASK_VF_EMPM                                                  */
  MDR_ADCUI_F1MASK_VF_EMPM_Off         = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F1MASK_VF_EMPM_On          = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F1MASK_VF_EMPM_Enum;

/* ============================================  MDR_ADCUI F1MASK VF_FLLM [1..1]  ============================================ */
typedef enum {                                  /*!< MDR_ADCUI_F1MASK_VF_FLLM                                                  */
  MDR_ADCUI_F1MASK_VF_FLLM_Off         = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F1MASK_VF_FLLM_On          = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F1MASK_VF_FLLM_Enum;

/* ===========================================  MDR_ADCUI F1MASK VF_OVERM [2..2]  ============================================ */
typedef enum {                                  /*!< MDR_ADCUI_F1MASK_VF_OVERM                                                 */
  MDR_ADCUI_F1MASK_VF_OVERM_Off        = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F1MASK_VF_OVERM_On         = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F1MASK_VF_OVERM_Enum;

/* ============================================  MDR_ADCUI F1MASK IF_EMPM [3..3]  ============================================ */
typedef enum {                                  /*!< MDR_ADCUI_F1MASK_IF_EMPM                                                  */
  MDR_ADCUI_F1MASK_IF_EMPM_Off         = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F1MASK_IF_EMPM_On          = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F1MASK_IF_EMPM_Enum;

/* ============================================  MDR_ADCUI F1MASK IF_FLLM [4..4]  ============================================ */
typedef enum {                                  /*!< MDR_ADCUI_F1MASK_IF_FLLM                                                  */
  MDR_ADCUI_F1MASK_IF_FLLM_Off         = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F1MASK_IF_FLLM_On          = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F1MASK_IF_FLLM_Enum;

/* ===========================================  MDR_ADCUI F1MASK IF_OVERM [5..5]  ============================================ */
typedef enum {                                  /*!< MDR_ADCUI_F1MASK_IF_OVERM                                                 */
  MDR_ADCUI_F1MASK_IF_OVERM_Off        = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F1MASK_IF_OVERM_On         = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F1MASK_IF_OVERM_Enum;

/* =============================================  MDR_ADCUI F1MASK SAGFM [6..6]  ============================================= */
typedef enum {                                  /*!< MDR_ADCUI_F1MASK_SAGFM                                                    */
  MDR_ADCUI_F1MASK_SAGFM_Off           = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F1MASK_SAGFM_On            = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F1MASK_SAGFM_Enum;

/* ============================================  MDR_ADCUI F1MASK PEAKVFM [7..7]  ============================================ */
typedef enum {                                  /*!< MDR_ADCUI_F1MASK_PEAKVFM                                                  */
  MDR_ADCUI_F1MASK_PEAKVFM_Off         = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F1MASK_PEAKVFM_On          = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F1MASK_PEAKVFM_Enum;

/* ============================================  MDR_ADCUI F1MASK PEAKIFM [8..8]  ============================================ */
typedef enum {                                  /*!< MDR_ADCUI_F1MASK_PEAKIFM                                                  */
  MDR_ADCUI_F1MASK_PEAKIFM_Off         = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F1MASK_PEAKIFM_On          = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F1MASK_PEAKIFM_Enum;

/* ===========================================  MDR_ADCUI F1MASK WATTOVPM [9..9]  ============================================ */
typedef enum {                                  /*!< MDR_ADCUI_F1MASK_WATTOVPM                                                 */
  MDR_ADCUI_F1MASK_WATTOVPM_Off        = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F1MASK_WATTOVPM_On         = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F1MASK_WATTOVPM_Enum;

