StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VK234.h
/* ===========================================  MDR_ADCUI F1MASK VAROVPM [10..10]  =========================================== */
typedef enum {                                  /*!< MDR_ADCUI_F1MASK_VAROVPM                                                  */
  MDR_ADCUI_F1MASK_VAROVPM_Off         = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F1MASK_VAROVPM_On          = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F1MASK_VAROVPM_Enum;

/* ============================================  MDR_ADCUI F1MASK VAOVM [11..11]  ============================================ */
typedef enum {                                  /*!< MDR_ADCUI_F1MASK_VAOVM                                                    */
  MDR_ADCUI_F1MASK_VAOVM_Off           = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F1MASK_VAOVM_On            = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F1MASK_VAOVM_Enum;

/* ===========================================  MDR_ADCUI F1MASK ZTXVFM [12..12]  ============================================ */
typedef enum {                                  /*!< MDR_ADCUI_F1MASK_ZTXVFM                                                   */
  MDR_ADCUI_F1MASK_ZTXVFM_Off          = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F1MASK_ZTXVFM_On           = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F1MASK_ZTXVFM_Enum;

/* ===========================================  MDR_ADCUI F1MASK APSIGNM [15..15]  =========================================== */
typedef enum {                                  /*!< MDR_ADCUI_F1MASK_APSIGNM                                                  */
  MDR_ADCUI_F1MASK_APSIGNM_Off         = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F1MASK_APSIGNM_On          = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F1MASK_APSIGNM_Enum;

/* ==========================================  MDR_ADCUI F1MASK APNLDFLM [16..16]  =========================================== */
typedef enum {                                  /*!< MDR_ADCUI_F1MASK_APNLDFLM                                                 */
  MDR_ADCUI_F1MASK_APNLDFLM_Off        = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F1MASK_APNLDFLM_On         = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F1MASK_APNLDFLM_Enum;

/* ==========================================  MDR_ADCUI F1MASK VARSIGNM [17..17]  =========================================== */
typedef enum {                                  /*!< MDR_ADCUI_F1MASK_VARSIGNM                                                 */
  MDR_ADCUI_F1MASK_VARSIGNM_Off        = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F1MASK_VARSIGNM_On         = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F1MASK_VARSIGNM_Enum;

/* ==========================================  MDR_ADCUI F1MASK VARNLDFLM [18..18]  ========================================== */
typedef enum {                                  /*!< MDR_ADCUI_F1MASK_VARNLDFLM                                                */
  MDR_ADCUI_F1MASK_VARNLDFLM_Off       = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F1MASK_VARNLDFLM_On        = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F1MASK_VARNLDFLM_Enum;

/* ==========================================  MDR_ADCUI F1MASK VANLDFLM [20..20]  =========================================== */
typedef enum {                                  /*!< MDR_ADCUI_F1MASK_VANLDFLM                                                 */
  MDR_ADCUI_F1MASK_VANLDFLM_Off        = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F1MASK_VANLDFLM_On         = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F1MASK_VANLDFLM_Enum;

/* ==========================================  MDR_ADCUI F1MASK ZEROCRSM [21..21]  =========================================== */
typedef enum {                                  /*!< MDR_ADCUI_F1MASK_ZEROCRSM                                                 */
  MDR_ADCUI_F1MASK_ZEROCRSM_Off        = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F1MASK_ZEROCRSM_On         = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F1MASK_ZEROCRSM_Enum;

/* ==========================================  MDR_ADCUI F1MASK WATTOVNM [25..25]  =========================================== */
typedef enum {                                  /*!< MDR_ADCUI_F1MASK_WATTOVNM                                                 */
  MDR_ADCUI_F1MASK_WATTOVNM_Off        = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F1MASK_WATTOVNM_On         = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F1MASK_WATTOVNM_Enum;

/* ===========================================  MDR_ADCUI F1MASK VAROVNM [26..26]  =========================================== */
typedef enum {                                  /*!< MDR_ADCUI_F1MASK_VAROVNM                                                  */
  MDR_ADCUI_F1MASK_VAROVNM_Off         = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F1MASK_VAROVNM_On          = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F1MASK_VAROVNM_Enum;

/* =========================================================  F2CTR  ========================================================= */
/* =============================================  MDR_ADCUI F2CTR INTEN [0..0]  ============================================== */
typedef enum {                                  /*!< MDR_ADCUI_F2CTR_INTEN                                                     */
  MDR_ADCUI_F2CTR_INTEN_Off            = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F2CTR_INTEN_On             = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F2CTR_INTEN_Enum;

/* =============================================  MDR_ADCUI F2CTR VASEL [2..2]  ============================================== */
typedef enum {                                  /*!< MDR_ADCUI_F2CTR_VASEL                                                     */
  MDR_ADCUI_F2CTR_VASEL_FullEnergy     = 0,     /*!< FullEnergy : IDAT and VDAT can store FullEnergy                           */
  MDR_ADCUI_F2CTR_VASEL_I_RMS          = 1,     /*!< I_RMS : IDAT and VDAT can store I_RMS                                     */
} MDR_ADCUI_F2CTR_VASEL_Enum;

/* ==============================================  MDR_ADCUI F2CTR RARS [3..3]  ============================================== */
typedef enum {                                  /*!< MDR_ADCUI_F2CTR_RARS                                                      */
  MDR_ADCUI_F2CTR_RARS_Inactive        = 0,     /*!< Inactive : Inactive state                                                 */
  MDR_ADCUI_F2CTR_RARS_Clear           = 1,     /*!< Clear : Accumulator sets to zero                                          */
} MDR_ADCUI_F2CTR_RARS_Enum;

/* ==============================================  MDR_ADCUI F2CTR RRRS [4..4]  ============================================== */
typedef enum {                                  /*!< MDR_ADCUI_F2CTR_RRRS                                                      */
  MDR_ADCUI_F2CTR_RRRS_Inactive        = 0,     /*!< Inactive : Inactive state                                                 */
  MDR_ADCUI_F2CTR_RRRS_Clear           = 1,     /*!< Clear : Accumulator sets to zero                                          */
} MDR_ADCUI_F2CTR_RRRS_Enum;

