StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VK234.h
/* ==============================================  MDR_ADCUI F2CTR RVRS [5..5]  ============================================== */
typedef enum {                                  /*!< MDR_ADCUI_F2CTR_RVRS                                                      */
  MDR_ADCUI_F2CTR_RVRS_Inactive        = 0,     /*!< Inactive : Inactive state                                                 */
  MDR_ADCUI_F2CTR_RVRS_Clear           = 1,     /*!< Clear : Accumulator sets to zero                                          */
} MDR_ADCUI_F2CTR_RVRS_Enum;

/* =============================================  MDR_ADCUI F2CTR IGAIN [6..7]  ============================================== */
typedef enum {                                  /*!< MDR_ADCUI_F2CTR_IGAIN                                                     */
  MDR_ADCUI_F2CTR_IGAIN_x1             = 0,     /*!< x1 : Signal amplification 0dB                                             */
  MDR_ADCUI_F2CTR_IGAIN_x2             = 1,     /*!< x2 : Signal amplification 6dB                                             */
  MDR_ADCUI_F2CTR_IGAIN_x4             = 2,     /*!< x4 : Signal amplification 12dB                                            */
  MDR_ADCUI_F2CTR_IGAIN_x8             = 3,     /*!< x8 : Signal amplification 18dB                                            */
} MDR_ADCUI_F2CTR_IGAIN_Enum;

/* =============================================  MDR_ADCUI F2CTR VGAIN [8..9]  ============================================== */
typedef enum {                                  /*!< MDR_ADCUI_F2CTR_VGAIN                                                     */
  MDR_ADCUI_F2CTR_VGAIN_x1             = 0,     /*!< x1 : Signal amplification 0dB                                             */
  MDR_ADCUI_F2CTR_VGAIN_x2             = 1,     /*!< x2 : Signal amplification 6dB                                             */
  MDR_ADCUI_F2CTR_VGAIN_x4             = 2,     /*!< x4 : Signal amplification 12dB                                            */
  MDR_ADCUI_F2CTR_VGAIN_x8             = 3,     /*!< x8 : Signal amplification 18dB                                            */
} MDR_ADCUI_F2CTR_VGAIN_Enum;

/* =========================================================  F2WC  ========================================================== */
/* ========================================================  F2WATTP  ======================================================== */
/* ========================================================  F2WATTN  ======================================================== */
/* =========================================================  F2VC  ========================================================== */
/* ========================================================  F2VARP  ========================================================= */
/* ========================================================  F2VARN  ========================================================= */
/* =========================================================  F2AC  ========================================================== */
/* =========================================================  F2VR  ========================================================== */
/* =========================================================  F2MD0  ========================================================= */
/* ==============================================  MDR_ADCUI F2MD0 VSEL [0..1]  ============================================== */
typedef enum {                                  /*!< MDR_ADCUI_F2MD0_VSEL                                                      */
  MDR_ADCUI_F2MD0_VSEL_ADC_V           = 0,     /*!< ADC_V : ADC_V output                                                      */
  MDR_ADCUI_F2MD0_VSEL_ActivePower     = 1,     /*!< ActivePower : Active Power                                                */
  MDR_ADCUI_F2MD0_VSEL_ReactivePower   = 2,     /*!< ReactivePower : Reactive Power                                            */
  MDR_ADCUI_F2MD0_VSEL_FullPower       = 3,     /*!< FullPower : Full Power                                                    */
} MDR_ADCUI_F2MD0_VSEL_Enum;

/* ==============================================  MDR_ADCUI F2MD0 ISEL [2..3]  ============================================== */
typedef enum {                                  /*!< MDR_ADCUI_F2MD0_ISEL                                                      */
  MDR_ADCUI_F2MD0_ISEL_ADC_I           = 0,     /*!< ADC_I : ADC_I output                                                      */
  MDR_ADCUI_F2MD0_ISEL_ActivePower     = 1,     /*!< ActivePower : Active Power                                                */
  MDR_ADCUI_F2MD0_ISEL_ReactivePower   = 2,     /*!< ReactivePower : Reactive Power                                            */
  MDR_ADCUI_F2MD0_ISEL_FullPower       = 3,     /*!< FullPower : Full Power                                                    */
} MDR_ADCUI_F2MD0_ISEL_Enum;

/* ==============================================  MDR_ADCUI F2MD0 ACTS [4..4]  ============================================== */
typedef enum {                                  /*!< MDR_ADCUI_F2MD0_ACTS                                                      */
  MDR_ADCUI_F2MD0_ACTS_Pos             = 0,     /*!< Pos : Positive sign                                                       */
  MDR_ADCUI_F2MD0_ACTS_Neg             = 1,     /*!< Neg : Negative sign                                                       */
} MDR_ADCUI_F2MD0_ACTS_Enum;

/* =============================================  MDR_ADCUI F2MD0 REACTS [5..5]  ============================================= */
typedef enum {                                  /*!< MDR_ADCUI_F2MD0_REACTS                                                    */
  MDR_ADCUI_F2MD0_REACTS_Pos           = 0,     /*!< Pos : Positive sign                                                       */
  MDR_ADCUI_F2MD0_REACTS_Neg           = 1,     /*!< Neg : Negative sign                                                       */
} MDR_ADCUI_F2MD0_REACTS_Enum;

/* =============================================  MDR_ADCUI F2MD0 IGAIN [6..6]  ============================================== */
typedef enum {                                  /*!< MDR_ADCUI_F2MD0_IGAIN                                                     */
  MDR_ADCUI_F2MD0_IGAIN_x1             = 0,     /*!< x1 : No gain                                                              */
  MDR_ADCUI_F2MD0_IGAIN_x2             = 1,     /*!< x2 : Gain by +6dB                                                         */
} MDR_ADCUI_F2MD0_IGAIN_Enum;

