StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VK234.h
/* =============================================  MDR_ADCUI F2MD0 VGAIN [7..7]  ============================================== */
typedef enum {                                  /*!< MDR_ADCUI_F2MD0_VGAIN                                                     */
  MDR_ADCUI_F2MD0_VGAIN_x1             = 0,     /*!< x1 : No gain                                                              */
  MDR_ADCUI_F2MD0_VGAIN_x2             = 1,     /*!< x2 : Gain by +6dB                                                         */
} MDR_ADCUI_F2MD0_VGAIN_Enum;

/* =========================================================  F2MD1  ========================================================= */
/* =========================================================  F2MD2  ========================================================= */
/* ========================================================  F2VPEAK  ======================================================== */
/* ========================================================  F2IPEAK  ======================================================== */
/* ========================================================  F2VDAT  ========================================================= */
/* ========================================================  F2IDAT  ========================================================= */
/* ========================================================  F2VRMS  ========================================================= */
/* ========================================================  F2VRMS2  ======================================================== */
/* ========================================================  F2IRMS  ========================================================= */
/* ========================================================  F2IRMS2  ======================================================== */
/* ========================================================  F2STAT  ========================================================= */
/* ============================================  MDR_ADCUI F2STAT VF_EMP [0..0]  ============================================= */
typedef enum {                                  /*!< MDR_ADCUI_F2STAT_VF_EMP                                                   */
  MDR_ADCUI_F2STAT_VF_EMP_Off          = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F2STAT_VF_EMP_On           = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F2STAT_VF_EMP_Enum;

/* ============================================  MDR_ADCUI F2STAT VF_FLL [1..1]  ============================================= */
typedef enum {                                  /*!< MDR_ADCUI_F2STAT_VF_FLL                                                   */
  MDR_ADCUI_F2STAT_VF_FLL_Off          = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F2STAT_VF_FLL_On           = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F2STAT_VF_FLL_Enum;

/* ============================================  MDR_ADCUI F2STAT VF_OVER [2..2]  ============================================ */
typedef enum {                                  /*!< MDR_ADCUI_F2STAT_VF_OVER                                                  */
  MDR_ADCUI_F2STAT_VF_OVER_Off         = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F2STAT_VF_OVER_On          = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F2STAT_VF_OVER_Enum;

/* ============================================  MDR_ADCUI F2STAT IF_EMP [3..3]  ============================================= */
typedef enum {                                  /*!< MDR_ADCUI_F2STAT_IF_EMP                                                   */
  MDR_ADCUI_F2STAT_IF_EMP_Off          = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F2STAT_IF_EMP_On           = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F2STAT_IF_EMP_Enum;

/* ============================================  MDR_ADCUI F2STAT IF_FLL [4..4]  ============================================= */
typedef enum {                                  /*!< MDR_ADCUI_F2STAT_IF_FLL                                                   */
  MDR_ADCUI_F2STAT_IF_FLL_Off          = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F2STAT_IF_FLL_On           = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F2STAT_IF_FLL_Enum;

/* ============================================  MDR_ADCUI F2STAT IF_OVER [5..5]  ============================================ */
typedef enum {                                  /*!< MDR_ADCUI_F2STAT_IF_OVER                                                  */
  MDR_ADCUI_F2STAT_IF_OVER_Off         = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F2STAT_IF_OVER_On          = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F2STAT_IF_OVER_Enum;

/* =============================================  MDR_ADCUI F2STAT SAGF [6..6]  ============================================== */
typedef enum {                                  /*!< MDR_ADCUI_F2STAT_SAGF                                                     */
  MDR_ADCUI_F2STAT_SAGF_Off            = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F2STAT_SAGF_On             = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F2STAT_SAGF_Enum;

/* ============================================  MDR_ADCUI F2STAT PEAKVF [7..7]  ============================================= */
typedef enum {                                  /*!< MDR_ADCUI_F2STAT_PEAKVF                                                   */
  MDR_ADCUI_F2STAT_PEAKVF_Off          = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F2STAT_PEAKVF_On           = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F2STAT_PEAKVF_Enum;

/* ============================================  MDR_ADCUI F2STAT PEAKIF [8..8]  ============================================= */
typedef enum {                                  /*!< MDR_ADCUI_F2STAT_PEAKIF                                                   */
  MDR_ADCUI_F2STAT_PEAKIF_Off          = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F2STAT_PEAKIF_On           = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F2STAT_PEAKIF_Enum;

/* ============================================  MDR_ADCUI F2STAT WATTOVP [9..9]  ============================================ */
typedef enum {                                  /*!< MDR_ADCUI_F2STAT_WATTOVP                                                  */
  MDR_ADCUI_F2STAT_WATTOVP_Off         = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F2STAT_WATTOVP_On          = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F2STAT_WATTOVP_Enum;

