StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VK234.h
/* ===========================================  MDR_ADCUI F2STAT VAROVP [10..10]  ============================================ */
typedef enum {                                  /*!< MDR_ADCUI_F2STAT_VAROVP                                                   */
  MDR_ADCUI_F2STAT_VAROVP_Off          = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F2STAT_VAROVP_On           = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F2STAT_VAROVP_Enum;

/* ============================================  MDR_ADCUI F2STAT VAOV [11..11]  ============================================= */
typedef enum {                                  /*!< MDR_ADCUI_F2STAT_VAOV                                                     */
  MDR_ADCUI_F2STAT_VAOV_Off            = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F2STAT_VAOV_On             = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F2STAT_VAOV_Enum;

/* ============================================  MDR_ADCUI F2STAT ZTXVF [12..12]  ============================================ */
typedef enum {                                  /*!< MDR_ADCUI_F2STAT_ZTXVF                                                    */
  MDR_ADCUI_F2STAT_ZTXVF_Off           = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F2STAT_ZTXVF_On            = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F2STAT_ZTXVF_Enum;

/* ===========================================  MDR_ADCUI F2STAT APSIGN [15..15]  ============================================ */
typedef enum {                                  /*!< MDR_ADCUI_F2STAT_APSIGN                                                   */
  MDR_ADCUI_F2STAT_APSIGN_Off          = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F2STAT_APSIGN_On           = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F2STAT_APSIGN_Enum;

/* ===========================================  MDR_ADCUI F2STAT APNLDFL [16..16]  =========================================== */
typedef enum {                                  /*!< MDR_ADCUI_F2STAT_APNLDFL                                                  */
  MDR_ADCUI_F2STAT_APNLDFL_Off         = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F2STAT_APNLDFL_On          = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F2STAT_APNLDFL_Enum;

/* ===========================================  MDR_ADCUI F2STAT VARSIGN [17..17]  =========================================== */
typedef enum {                                  /*!< MDR_ADCUI_F2STAT_VARSIGN                                                  */
  MDR_ADCUI_F2STAT_VARSIGN_Off         = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F2STAT_VARSIGN_On          = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F2STAT_VARSIGN_Enum;

/* ==========================================  MDR_ADCUI F2STAT VARNLDFL [18..18]  =========================================== */
typedef enum {                                  /*!< MDR_ADCUI_F2STAT_VARNLDFL                                                 */
  MDR_ADCUI_F2STAT_VARNLDFL_Off        = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F2STAT_VARNLDFL_On         = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F2STAT_VARNLDFL_Enum;

/* ===========================================  MDR_ADCUI F2STAT VANLDFL [20..20]  =========================================== */
typedef enum {                                  /*!< MDR_ADCUI_F2STAT_VANLDFL                                                  */
  MDR_ADCUI_F2STAT_VANLDFL_Off         = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F2STAT_VANLDFL_On          = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F2STAT_VANLDFL_Enum;

/* ===========================================  MDR_ADCUI F2STAT ZEROCRS [21..21]  =========================================== */
typedef enum {                                  /*!< MDR_ADCUI_F2STAT_ZEROCRS                                                  */
  MDR_ADCUI_F2STAT_ZEROCRS_Off         = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F2STAT_ZEROCRS_On          = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F2STAT_ZEROCRS_Enum;

/* ===========================================  MDR_ADCUI F2STAT WATTOVN [25..25]  =========================================== */
typedef enum {                                  /*!< MDR_ADCUI_F2STAT_WATTOVN                                                  */
  MDR_ADCUI_F2STAT_WATTOVN_Off         = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F2STAT_WATTOVN_On          = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F2STAT_WATTOVN_Enum;

/* ===========================================  MDR_ADCUI F2STAT VAROVN [26..26]  ============================================ */
typedef enum {                                  /*!< MDR_ADCUI_F2STAT_VAROVN                                                   */
  MDR_ADCUI_F2STAT_VAROVN_Off          = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F2STAT_VAROVN_On           = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F2STAT_VAROVN_Enum;

/* ========================================================  F2MASK  ========================================================= */
/* ============================================  MDR_ADCUI F2MASK VF_EMPM [0..0]  ============================================ */
typedef enum {                                  /*!< MDR_ADCUI_F2MASK_VF_EMPM                                                  */
  MDR_ADCUI_F2MASK_VF_EMPM_Off         = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F2MASK_VF_EMPM_On          = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F2MASK_VF_EMPM_Enum;

/* ============================================  MDR_ADCUI F2MASK VF_FLLM [1..1]  ============================================ */
typedef enum {                                  /*!< MDR_ADCUI_F2MASK_VF_FLLM                                                  */
  MDR_ADCUI_F2MASK_VF_FLLM_Off         = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F2MASK_VF_FLLM_On          = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F2MASK_VF_FLLM_Enum;

/* ===========================================  MDR_ADCUI F2MASK VF_OVERM [2..2]  ============================================ */
typedef enum {                                  /*!< MDR_ADCUI_F2MASK_VF_OVERM                                                 */
  MDR_ADCUI_F2MASK_VF_OVERM_Off        = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F2MASK_VF_OVERM_On         = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F2MASK_VF_OVERM_Enum;

/* ============================================  MDR_ADCUI F2MASK IF_EMPM [3..3]  ============================================ */
typedef enum {                                  /*!< MDR_ADCUI_F2MASK_IF_EMPM                                                  */
  MDR_ADCUI_F2MASK_IF_EMPM_Off         = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F2MASK_IF_EMPM_On          = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F2MASK_IF_EMPM_Enum;

/* ============================================  MDR_ADCUI F2MASK IF_FLLM [4..4]  ============================================ */
typedef enum {                                  /*!< MDR_ADCUI_F2MASK_IF_FLLM                                                  */
  MDR_ADCUI_F2MASK_IF_FLLM_Off         = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F2MASK_IF_FLLM_On          = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F2MASK_IF_FLLM_Enum;

/* ===========================================  MDR_ADCUI F2MASK IF_OVERM [5..5]  ============================================ */
typedef enum {                                  /*!< MDR_ADCUI_F2MASK_IF_OVERM                                                 */
  MDR_ADCUI_F2MASK_IF_OVERM_Off        = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F2MASK_IF_OVERM_On         = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F2MASK_IF_OVERM_Enum;

