StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VK234.h
/* =============================================  MDR_ADCUI F2MASK SAGFM [6..6]  ============================================= */
typedef enum {                                  /*!< MDR_ADCUI_F2MASK_SAGFM                                                    */
  MDR_ADCUI_F2MASK_SAGFM_Off           = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F2MASK_SAGFM_On            = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F2MASK_SAGFM_Enum;

/* ============================================  MDR_ADCUI F2MASK PEAKVFM [7..7]  ============================================ */
typedef enum {                                  /*!< MDR_ADCUI_F2MASK_PEAKVFM                                                  */
  MDR_ADCUI_F2MASK_PEAKVFM_Off         = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F2MASK_PEAKVFM_On          = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F2MASK_PEAKVFM_Enum;

/* ============================================  MDR_ADCUI F2MASK PEAKIFM [8..8]  ============================================ */
typedef enum {                                  /*!< MDR_ADCUI_F2MASK_PEAKIFM                                                  */
  MDR_ADCUI_F2MASK_PEAKIFM_Off         = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F2MASK_PEAKIFM_On          = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F2MASK_PEAKIFM_Enum;

/* ===========================================  MDR_ADCUI F2MASK WATTOVPM [9..9]  ============================================ */
typedef enum {                                  /*!< MDR_ADCUI_F2MASK_WATTOVPM                                                 */
  MDR_ADCUI_F2MASK_WATTOVPM_Off        = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F2MASK_WATTOVPM_On         = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F2MASK_WATTOVPM_Enum;

/* ===========================================  MDR_ADCUI F2MASK VAROVPM [10..10]  =========================================== */
typedef enum {                                  /*!< MDR_ADCUI_F2MASK_VAROVPM                                                  */
  MDR_ADCUI_F2MASK_VAROVPM_Off         = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F2MASK_VAROVPM_On          = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F2MASK_VAROVPM_Enum;

/* ============================================  MDR_ADCUI F2MASK VAOVM [11..11]  ============================================ */
typedef enum {                                  /*!< MDR_ADCUI_F2MASK_VAOVM                                                    */
  MDR_ADCUI_F2MASK_VAOVM_Off           = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F2MASK_VAOVM_On            = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F2MASK_VAOVM_Enum;

/* ===========================================  MDR_ADCUI F2MASK ZTXVFM [12..12]  ============================================ */
typedef enum {                                  /*!< MDR_ADCUI_F2MASK_ZTXVFM                                                   */
  MDR_ADCUI_F2MASK_ZTXVFM_Off          = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F2MASK_ZTXVFM_On           = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F2MASK_ZTXVFM_Enum;

/* ===========================================  MDR_ADCUI F2MASK APSIGNM [15..15]  =========================================== */
typedef enum {                                  /*!< MDR_ADCUI_F2MASK_APSIGNM                                                  */
  MDR_ADCUI_F2MASK_APSIGNM_Off         = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F2MASK_APSIGNM_On          = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F2MASK_APSIGNM_Enum;

/* ==========================================  MDR_ADCUI F2MASK APNLDFLM [16..16]  =========================================== */
typedef enum {                                  /*!< MDR_ADCUI_F2MASK_APNLDFLM                                                 */
  MDR_ADCUI_F2MASK_APNLDFLM_Off        = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F2MASK_APNLDFLM_On         = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F2MASK_APNLDFLM_Enum;

/* ==========================================  MDR_ADCUI F2MASK VARSIGNM [17..17]  =========================================== */
typedef enum {                                  /*!< MDR_ADCUI_F2MASK_VARSIGNM                                                 */
  MDR_ADCUI_F2MASK_VARSIGNM_Off        = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F2MASK_VARSIGNM_On         = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F2MASK_VARSIGNM_Enum;

/* ==========================================  MDR_ADCUI F2MASK VARNLDFLM [18..18]  ========================================== */
typedef enum {                                  /*!< MDR_ADCUI_F2MASK_VARNLDFLM                                                */
  MDR_ADCUI_F2MASK_VARNLDFLM_Off       = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F2MASK_VARNLDFLM_On        = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F2MASK_VARNLDFLM_Enum;

/* ==========================================  MDR_ADCUI F2MASK VANLDFLM [20..20]  =========================================== */
typedef enum {                                  /*!< MDR_ADCUI_F2MASK_VANLDFLM                                                 */
  MDR_ADCUI_F2MASK_VANLDFLM_Off        = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F2MASK_VANLDFLM_On         = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F2MASK_VANLDFLM_Enum;

/* ==========================================  MDR_ADCUI F2MASK ZEROCRSM [21..21]  =========================================== */
typedef enum {                                  /*!< MDR_ADCUI_F2MASK_ZEROCRSM                                                 */
  MDR_ADCUI_F2MASK_ZEROCRSM_Off        = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F2MASK_ZEROCRSM_On         = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F2MASK_ZEROCRSM_Enum;

/* ==========================================  MDR_ADCUI F2MASK WATTOVNM [25..25]  =========================================== */
typedef enum {                                  /*!< MDR_ADCUI_F2MASK_WATTOVNM                                                 */
  MDR_ADCUI_F2MASK_WATTOVNM_Off        = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F2MASK_WATTOVNM_On         = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F2MASK_WATTOVNM_Enum;

/* ===========================================  MDR_ADCUI F2MASK VAROVNM [26..26]  =========================================== */
typedef enum {                                  /*!< MDR_ADCUI_F2MASK_VAROVNM                                                  */
  MDR_ADCUI_F2MASK_VAROVNM_Off         = 0,     /*!< Off : Disabled                                                            */
  MDR_ADCUI_F2MASK_VAROVNM_On          = 1,     /*!< On : Enabled                                                              */
} MDR_ADCUI_F2MASK_VAROVNM_Enum;

/* =========================================================  CCAL1  ========================================================= */
/* =========================================================  CCAL2  ========================================================= */
/* =========================================================  CCAL3  ========================================================= */
/* =========================================================  CCAL4  ========================================================= */


/* =========================================================================================================================== */
/* ================                                         MDR_UART1                                         ================ */
/* =========================================================================================================================== */

/* ==========================================================  DR  =========================================================== */
/* ================================================  MDR_UART1 DR FE [8..8]  ================================================= */
typedef enum {                                  /*!< MDR_UART1_DR_FE                                                           */
  MDR_UART1_DR_FE_Ok                   = 0,     /*!< Ok : No Error                                                             */
  MDR_UART1_DR_FE_ERROR                = 1,     /*!< ERROR : Error is active                                                   */
} MDR_UART1_DR_FE_Enum;

/* ================================================  MDR_UART1 DR PE [9..9]  ================================================= */
typedef enum {                                  /*!< MDR_UART1_DR_PE                                                           */
  MDR_UART1_DR_PE_Ok                   = 0,     /*!< Ok : No Error                                                             */
  MDR_UART1_DR_PE_ERROR                = 1,     /*!< ERROR : Error is active                                                   */
} MDR_UART1_DR_PE_Enum;

