StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VK234.h
/* ================================================  MDR_UART1 CR LBE [7..7]  ================================================ */
typedef enum {                                  /*!< MDR_UART1_CR_LBE                                                          */
  MDR_UART1_CR_LBE_Off                 = 0,     /*!< Off : Disabled                                                            */
  MDR_UART1_CR_LBE_On                  = 1,     /*!< On : Enabled                                                              */
} MDR_UART1_CR_LBE_Enum;

/* ================================================  MDR_UART1 CR TXE [8..8]  ================================================ */
typedef enum {                                  /*!< MDR_UART1_CR_TXE                                                          */
  MDR_UART1_CR_TXE_Off                 = 0,     /*!< Off : Disabled                                                            */
  MDR_UART1_CR_TXE_On                  = 1,     /*!< On : Enabled                                                              */
} MDR_UART1_CR_TXE_Enum;

/* ================================================  MDR_UART1 CR RXE [9..9]  ================================================ */
typedef enum {                                  /*!< MDR_UART1_CR_RXE                                                          */
  MDR_UART1_CR_RXE_Off                 = 0,     /*!< Off : Disabled                                                            */
  MDR_UART1_CR_RXE_On                  = 1,     /*!< On : Enabled                                                              */
} MDR_UART1_CR_RXE_Enum;

/* ===============================================  MDR_UART1 CR DTR [10..10]  =============================================== */
typedef enum {                                  /*!< MDR_UART1_CR_DTR                                                          */
  MDR_UART1_CR_DTR_Inactive            = 0,     /*!< Inactive : Sets modem line to Inactive                                    */
  MDR_UART1_CR_DTR_Active              = 1,     /*!< Active : Sets modem line to Active                                        */
} MDR_UART1_CR_DTR_Enum;

/* ===============================================  MDR_UART1 CR RTS [11..11]  =============================================== */
typedef enum {                                  /*!< MDR_UART1_CR_RTS                                                          */
  MDR_UART1_CR_RTS_Inactive            = 0,     /*!< Inactive : Sets modem line to Inactive                                    */
  MDR_UART1_CR_RTS_Active              = 1,     /*!< Active : Sets modem line to Active                                        */
} MDR_UART1_CR_RTS_Enum;

/* ==============================================  MDR_UART1 CR Out1 [12..12]  =============================================== */
typedef enum {                                  /*!< MDR_UART1_CR_Out1                                                         */
  MDR_UART1_CR_Out1_Inactive           = 0,     /*!< Inactive : Sets modem line to Inactive                                    */
  MDR_UART1_CR_Out1_Active             = 1,     /*!< Active : Sets modem line to Active                                        */
} MDR_UART1_CR_Out1_Enum;

/* ==============================================  MDR_UART1 CR Out2 [13..13]  =============================================== */
typedef enum {                                  /*!< MDR_UART1_CR_Out2                                                         */
  MDR_UART1_CR_Out2_Inactive           = 0,     /*!< Inactive : Sets modem line to Inactive                                    */
  MDR_UART1_CR_Out2_Active             = 1,     /*!< Active : Sets modem line to Active                                        */
} MDR_UART1_CR_Out2_Enum;

/* ==============================================  MDR_UART1 CR RTSEn [14..14]  ============================================== */
typedef enum {                                  /*!< MDR_UART1_CR_RTSEn                                                        */
  MDR_UART1_CR_RTSEn_Off               = 0,     /*!< Off : Disabled                                                            */
  MDR_UART1_CR_RTSEn_On                = 1,     /*!< On : Enabled                                                              */
} MDR_UART1_CR_RTSEn_Enum;

/* ==============================================  MDR_UART1 CR CTSEn [15..15]  ============================================== */
typedef enum {                                  /*!< MDR_UART1_CR_CTSEn                                                        */
  MDR_UART1_CR_CTSEn_Off               = 0,     /*!< Off : Disabled                                                            */
  MDR_UART1_CR_CTSEn_On                = 1,     /*!< On : Enabled                                                              */
} MDR_UART1_CR_CTSEn_Enum;

/* =========================================================  IFLS  ========================================================== */
/* ============================================  MDR_UART1 IFLS TXIFLSES [0..2]  ============================================= */
typedef enum {                                  /*!< MDR_UART1_IFLS_TXIFLSES                                                   */
  MDR_UART1_IFLS_TXIFLSES_Words_le4    = 0,     /*!< Words_le4 : Less or Equal words in FIFO_TX                                */
  MDR_UART1_IFLS_TXIFLSES_Words_le8    = 1,     /*!< Words_le8 : Less or Equal words in FIFO_TX                                */
  MDR_UART1_IFLS_TXIFLSES_Words_le16   = 2,     /*!< Words_le16 : Less or Equal words in FIFO_TX                               */
  MDR_UART1_IFLS_TXIFLSES_Words_le24   = 3,     /*!< Words_le24 : Less or Equal words in FIFO_TX                               */
  MDR_UART1_IFLS_TXIFLSES_Words_le32   = 4,     /*!< Words_le32 : Less or Equal words in FIFO_TX                               */
} MDR_UART1_IFLS_TXIFLSES_Enum;

/* ============================================  MDR_UART1 IFLS RXIFLSES [3..5]  ============================================= */
typedef enum {                                  /*!< MDR_UART1_IFLS_RXIFLSES                                                   */
  MDR_UART1_IFLS_RXIFLSES_Words_ge4    = 0,     /*!< Words_ge4 : Greater or Equal words in FIFO_RX                             */
  MDR_UART1_IFLS_RXIFLSES_Words_ge8    = 1,     /*!< Words_ge8 : Greater or Equal words in FIFO_RX                             */
  MDR_UART1_IFLS_RXIFLSES_Words_ge16   = 2,     /*!< Words_ge16 : Greater or Equal words in FIFO_RX                            */
  MDR_UART1_IFLS_RXIFLSES_Words_ge24   = 3,     /*!< Words_ge24 : Greater or Equal words in FIFO_RX                            */
  MDR_UART1_IFLS_RXIFLSES_Words_ge32   = 4,     /*!< Words_ge32 : Greater or Equal words in FIFO_RX                            */
} MDR_UART1_IFLS_RXIFLSES_Enum;

/* =========================================================  IMSC  ========================================================== */
/* =============================================  MDR_UART1 IMSC RIM_IM [0..0]  ============================================== */
typedef enum {                                  /*!< MDR_UART1_IMSC_RIM_IM                                                     */
  MDR_UART1_IMSC_RIM_IM_Off            = 0,     /*!< Off : IRQ Disabled                                                        */
  MDR_UART1_IMSC_RIM_IM_On             = 1,     /*!< On : IRQ Enabled                                                          */
} MDR_UART1_IMSC_RIM_IM_Enum;

/* =============================================  MDR_UART1 IMSC STCM_IM [1..1]  ============================================= */
typedef enum {                                  /*!< MDR_UART1_IMSC_STCM_IM                                                    */
  MDR_UART1_IMSC_STCM_IM_Off           = 0,     /*!< Off : IRQ Disabled                                                        */
  MDR_UART1_IMSC_STCM_IM_On            = 1,     /*!< On : IRQ Enabled                                                          */
} MDR_UART1_IMSC_STCM_IM_Enum;

