StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VK234.h
/* =============================================  MDR_UART1 MIS DCDM_MIS [2..2]  ============================================= */
typedef enum {                                  /*!< MDR_UART1_MIS_DCDM_MIS                                                    */
  MDR_UART1_MIS_DCDM_MIS_Off           = 0,     /*!< Off : Event Inactive                                                      */
  MDR_UART1_MIS_DCDM_MIS_On            = 1,     /*!< On : Event Active                                                         */
} MDR_UART1_MIS_DCDM_MIS_Enum;

/* =============================================  MDR_UART1 MIS DSRM_MIS [3..3]  ============================================= */
typedef enum {                                  /*!< MDR_UART1_MIS_DSRM_MIS                                                    */
  MDR_UART1_MIS_DSRM_MIS_Off           = 0,     /*!< Off : Event Inactive                                                      */
  MDR_UART1_MIS_DSRM_MIS_On            = 1,     /*!< On : Event Active                                                         */
} MDR_UART1_MIS_DSRM_MIS_Enum;

/* ==============================================  MDR_UART1 MIS RX_MIS [4..4]  ============================================== */
typedef enum {                                  /*!< MDR_UART1_MIS_RX_MIS                                                      */
  MDR_UART1_MIS_RX_MIS_Off             = 0,     /*!< Off : Event Inactive                                                      */
  MDR_UART1_MIS_RX_MIS_On              = 1,     /*!< On : Event Active                                                         */
} MDR_UART1_MIS_RX_MIS_Enum;

/* ==============================================  MDR_UART1 MIS TX_MIS [5..5]  ============================================== */
typedef enum {                                  /*!< MDR_UART1_MIS_TX_MIS                                                      */
  MDR_UART1_MIS_TX_MIS_Off             = 0,     /*!< Off : Event Inactive                                                      */
  MDR_UART1_MIS_TX_MIS_On              = 1,     /*!< On : Event Active                                                         */
} MDR_UART1_MIS_TX_MIS_Enum;

/* ==============================================  MDR_UART1 MIS RT_MIS [6..6]  ============================================== */
typedef enum {                                  /*!< MDR_UART1_MIS_RT_MIS                                                      */
  MDR_UART1_MIS_RT_MIS_Off             = 0,     /*!< Off : Event Inactive                                                      */
  MDR_UART1_MIS_RT_MIS_On              = 1,     /*!< On : Event Active                                                         */
} MDR_UART1_MIS_RT_MIS_Enum;

/* ==============================================  MDR_UART1 MIS FE_MIS [7..7]  ============================================== */
typedef enum {                                  /*!< MDR_UART1_MIS_FE_MIS                                                      */
  MDR_UART1_MIS_FE_MIS_Off             = 0,     /*!< Off : Event Inactive                                                      */
  MDR_UART1_MIS_FE_MIS_On              = 1,     /*!< On : Event Active                                                         */
} MDR_UART1_MIS_FE_MIS_Enum;

/* ==============================================  MDR_UART1 MIS PE_MIS [8..8]  ============================================== */
typedef enum {                                  /*!< MDR_UART1_MIS_PE_MIS                                                      */
  MDR_UART1_MIS_PE_MIS_Off             = 0,     /*!< Off : Event Inactive                                                      */
  MDR_UART1_MIS_PE_MIS_On              = 1,     /*!< On : Event Active                                                         */
} MDR_UART1_MIS_PE_MIS_Enum;

/* ==============================================  MDR_UART1 MIS BE_MIS [9..9]  ============================================== */
typedef enum {                                  /*!< MDR_UART1_MIS_BE_MIS                                                      */
  MDR_UART1_MIS_BE_MIS_Off             = 0,     /*!< Off : Event Inactive                                                      */
  MDR_UART1_MIS_BE_MIS_On              = 1,     /*!< On : Event Active                                                         */
} MDR_UART1_MIS_BE_MIS_Enum;

/* =============================================  MDR_UART1 MIS OE_MIS [10..10]  ============================================= */
typedef enum {                                  /*!< MDR_UART1_MIS_OE_MIS                                                      */
  MDR_UART1_MIS_OE_MIS_Off             = 0,     /*!< Off : Event Inactive                                                      */
  MDR_UART1_MIS_OE_MIS_On              = 1,     /*!< On : Event Active                                                         */
} MDR_UART1_MIS_OE_MIS_Enum;

/* ==========================================================  ICR  ========================================================== */
/* ==============================================  MDR_UART1 ICR RIM_IC [0..0]  ============================================== */
typedef enum {                                  /*!< MDR_UART1_ICR_RIM_IC                                                      */
  MDR_UART1_ICR_RIM_IC_Inactive        = 0,     /*!< Inactive : Inactive state                                                 */
  MDR_UART1_ICR_RIM_IC_Clear           = 1,     /*!< Clear : Clear event                                                       */
} MDR_UART1_ICR_RIM_IC_Enum;

/* =============================================  MDR_UART1 ICR STCM_IC [1..1]  ============================================== */
typedef enum {                                  /*!< MDR_UART1_ICR_STCM_IC                                                     */
  MDR_UART1_ICR_STCM_IC_Inactive       = 0,     /*!< Inactive : Inactive state                                                 */
  MDR_UART1_ICR_STCM_IC_Clear          = 1,     /*!< Clear : Clear event                                                       */
} MDR_UART1_ICR_STCM_IC_Enum;

/* =============================================  MDR_UART1 ICR DCDM_IC [2..2]  ============================================== */
typedef enum {                                  /*!< MDR_UART1_ICR_DCDM_IC                                                     */
  MDR_UART1_ICR_DCDM_IC_Inactive       = 0,     /*!< Inactive : Inactive state                                                 */
  MDR_UART1_ICR_DCDM_IC_Clear          = 1,     /*!< Clear : Clear event                                                       */
} MDR_UART1_ICR_DCDM_IC_Enum;

/* =============================================  MDR_UART1 ICR DSRM_IC [3..3]  ============================================== */
typedef enum {                                  /*!< MDR_UART1_ICR_DSRM_IC                                                     */
  MDR_UART1_ICR_DSRM_IC_Inactive       = 0,     /*!< Inactive : Inactive state                                                 */
  MDR_UART1_ICR_DSRM_IC_Clear          = 1,     /*!< Clear : Clear event                                                       */
} MDR_UART1_ICR_DSRM_IC_Enum;

/* ==============================================  MDR_UART1 ICR RX_IC [4..4]  =============================================== */
typedef enum {                                  /*!< MDR_UART1_ICR_RX_IC                                                       */
  MDR_UART1_ICR_RX_IC_Inactive         = 0,     /*!< Inactive : Inactive state                                                 */
  MDR_UART1_ICR_RX_IC_Clear            = 1,     /*!< Clear : Clear event                                                       */
} MDR_UART1_ICR_RX_IC_Enum;

