StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VK234.h
/* ==============================================  MDR_UART1 ICR TX_IC [5..5]  =============================================== */
typedef enum {                                  /*!< MDR_UART1_ICR_TX_IC                                                       */
  MDR_UART1_ICR_TX_IC_Inactive         = 0,     /*!< Inactive : Inactive state                                                 */
  MDR_UART1_ICR_TX_IC_Clear            = 1,     /*!< Clear : Clear event                                                       */
} MDR_UART1_ICR_TX_IC_Enum;

/* ==============================================  MDR_UART1 ICR RT_IC [6..6]  =============================================== */
typedef enum {                                  /*!< MDR_UART1_ICR_RT_IC                                                       */
  MDR_UART1_ICR_RT_IC_Inactive         = 0,     /*!< Inactive : Inactive state                                                 */
  MDR_UART1_ICR_RT_IC_Clear            = 1,     /*!< Clear : Clear event                                                       */
} MDR_UART1_ICR_RT_IC_Enum;

/* ==============================================  MDR_UART1 ICR FE_IC [7..7]  =============================================== */
typedef enum {                                  /*!< MDR_UART1_ICR_FE_IC                                                       */
  MDR_UART1_ICR_FE_IC_Inactive         = 0,     /*!< Inactive : Inactive state                                                 */
  MDR_UART1_ICR_FE_IC_Clear            = 1,     /*!< Clear : Clear event                                                       */
} MDR_UART1_ICR_FE_IC_Enum;

/* ==============================================  MDR_UART1 ICR PE_IC [8..8]  =============================================== */
typedef enum {                                  /*!< MDR_UART1_ICR_PE_IC                                                       */
  MDR_UART1_ICR_PE_IC_Inactive         = 0,     /*!< Inactive : Inactive state                                                 */
  MDR_UART1_ICR_PE_IC_Clear            = 1,     /*!< Clear : Clear event                                                       */
} MDR_UART1_ICR_PE_IC_Enum;

/* ==============================================  MDR_UART1 ICR BE_IC [9..9]  =============================================== */
typedef enum {                                  /*!< MDR_UART1_ICR_BE_IC                                                       */
  MDR_UART1_ICR_BE_IC_Inactive         = 0,     /*!< Inactive : Inactive state                                                 */
  MDR_UART1_ICR_BE_IC_Clear            = 1,     /*!< Clear : Clear event                                                       */
} MDR_UART1_ICR_BE_IC_Enum;

/* =============================================  MDR_UART1 ICR OE_IC [10..10]  ============================================== */
typedef enum {                                  /*!< MDR_UART1_ICR_OE_IC                                                       */
  MDR_UART1_ICR_OE_IC_Inactive         = 0,     /*!< Inactive : Inactive state                                                 */
  MDR_UART1_ICR_OE_IC_Clear            = 1,     /*!< Clear : Clear event                                                       */
} MDR_UART1_ICR_OE_IC_Enum;

/* =========================================================  DMACR  ========================================================= */
/* =============================================  MDR_UART1 DMACR RXDMAE [0..0]  ============================================= */
typedef enum {                                  /*!< MDR_UART1_DMACR_RXDMAE                                                    */
  MDR_UART1_DMACR_RXDMAE_Disabled      = 0,     /*!< Disabled : DMA disabled                                                   */
  MDR_UART1_DMACR_RXDMAE_Enabled       = 1,     /*!< Enabled : DMA enabled                                                     */
} MDR_UART1_DMACR_RXDMAE_Enum;

/* =============================================  MDR_UART1 DMACR TXDMAE [1..1]  ============================================= */
typedef enum {                                  /*!< MDR_UART1_DMACR_TXDMAE                                                    */
  MDR_UART1_DMACR_TXDMAE_Disabled      = 0,     /*!< Disabled : DMA disabled                                                   */
  MDR_UART1_DMACR_TXDMAE_Enabled       = 1,     /*!< Enabled : DMA enabled                                                     */
} MDR_UART1_DMACR_TXDMAE_Enum;

/* ============================================  MDR_UART1 DMACR DMAonErr [2..2]  ============================================ */
typedef enum {                                  /*!< MDR_UART1_DMACR_DMAonErr                                                  */
  MDR_UART1_DMACR_DMAonErr_IgnoreError = 0,     /*!< IgnoreError : Ignore Errors                                               */
  MDR_UART1_DMACR_DMAonErr_StopOnError = 1,     /*!< StopOnError : SReq and Req disable on Error                               */
} MDR_UART1_DMACR_DMAonErr_Enum;

/* ==========================================================  TCR  ========================================================== */
/* ===============================================  MDR_UART1 TCR ITEN [0..0]  =============================================== */
typedef enum {                                  /*!< MDR_UART1_TCR_ITEN                                                        */
  MDR_UART1_TCR_ITEN_Disabled          = 0,     /*!< Disabled : Normal operation                                               */
  MDR_UART1_TCR_ITEN_Enabled           = 1,     /*!< Enabled : Testing Mode                                                    */
} MDR_UART1_TCR_ITEN_Enum;

/* =============================================  MDR_UART1 TCR TestFIFO [1..1]  ============================================= */
typedef enum {                                  /*!< MDR_UART1_TCR_TestFIFO                                                    */
  MDR_UART1_TCR_TestFIFO_Disabled      = 0,     /*!< Disabled : Normal operation                                               */
  MDR_UART1_TCR_TestFIFO_Enabled       = 1,     /*!< Enabled : Testing Mode                                                    */
} MDR_UART1_TCR_TestFIFO_Enum;

/* =============================================  MDR_UART1 TCR SIRTest [2..2]  ============================================== */
typedef enum {                                  /*!< MDR_UART1_TCR_SIRTest                                                     */
  MDR_UART1_TCR_SIRTest_Disabled       = 0,     /*!< Disabled : Normal operation                                               */
  MDR_UART1_TCR_SIRTest_Enabled        = 1,     /*!< Enabled : Testing Mode                                                    */
} MDR_UART1_TCR_SIRTest_Enum;



/* =========================================================================================================================== */
/* ================                                         MDR_PORTA                                         ================ */
/* =========================================================================================================================== */

/* =========================================================  RXTX  ========================================================== */
/* ==============================================  MDR_PORTA RXTX Pin_ [0..0]  =============================================== */
typedef enum {                                  /*!< MDR_PORTA_RXTX_Pin_                                                       */
  MDR_GPIO__PIN_DATA__Low              = 0,     /*!< Low : LOW Level Voltage                                                   */
  MDR_GPIO__PIN_DATA__High             = 1,     /*!< High : HIGH Level Voltage                                                 */
} MDR_GPIO__PIN_DATA__Enum;

/* ==========================================================  OE  =========================================================== */
/* ===============================================  MDR_PORTA OE Pin_ [0..0]  ================================================ */
typedef enum {                                  /*!< MDR_PORTA_OE_Pin_                                                         */
  MDR_GPIO__PIN_DIR__IN                = 0,     /*!< IN : Input pin                                                            */
  MDR_GPIO__PIN_DIR__OUT               = 1,     /*!< OUT : Output pin                                                          */
} MDR_GPIO__PIN_DIR__Enum;

/* =========================================================  FUNC  ========================================================== */
/* ==============================================  MDR_PORTA FUNC Pin_ [0..1]  =============================================== */
typedef enum {                                  /*!< MDR_PORTA_FUNC_Pin_                                                       */
  MDR_GPIO__PIN_FUNC__Port             = 0,     /*!< Port : RXTX defined pin                                                   */
  MDR_GPIO__PIN_FUNC__Main             = 1,     /*!< Main : Main Periph defined pin                                            */
  MDR_GPIO__PIN_FUNC__Alter            = 2,     /*!< Alter : Alter Periph defined pin                                          */
  MDR_GPIO__PIN_FUNC__Override         = 3,     /*!< Override : Override Periph defined pin                                    */
} MDR_GPIO__PIN_FUNC__Enum;

/* ========================================================  ANALOG  ========================================================= */
/* =============================================  MDR_PORTA ANALOG Pin_ [0..0]  ============================================== */
typedef enum {                                  /*!< MDR_PORTA_ANALOG_Pin_                                                     */
  MDR_GPIO__PIN_DIGIT__Analog          = 0,     /*!< Analog : Pin works with Analog signal                                     */
  MDR_GPIO__PIN_DIGIT__Digital         = 1,     /*!< Digital : Pin works with Digital signal                                   */
} MDR_GPIO__PIN_DIGIT__Enum;

/* =========================================================  PULL  ========================================================== */
/* ===========================================  MDR_PORTA PULL Down_Pin_0 [0..0]  ============================================ */
typedef enum {                                  /*!< MDR_PORTA_PULL_Down_Pin_0                                                 */
  MDR_GPIO__PIN_DOWN__Off              = 0,     /*!< Off : No pull selected                                                    */
  MDR_GPIO__PIN_DOWN__DOWN             = 1,     /*!< DOWN : Pin pulled down to GND                                             */
} MDR_GPIO__PIN_DOWN__Enum;

/* ===========================================  MDR_PORTA PULL Down_Pin_1 [1..1]  ============================================ */
typedef enum {                                  /*!< MDR_PORTA_PULL_Down_Pin_1                                                 */
  MDR_PORTA_PULL_Down_Pin_1_Off        = 0,     /*!< Off : No pull selected                                                    */
  MDR_PORTA_PULL_Down_Pin_1_DOWN       = 1,     /*!< DOWN : Pin pulled down to GND                                             */
} MDR_PORTA_PULL_Down_Pin_1_Enum;

/* ===========================================  MDR_PORTA PULL Down_Pin_2 [2..2]  ============================================ */
typedef enum {                                  /*!< MDR_PORTA_PULL_Down_Pin_2                                                 */
  MDR_PORTA_PULL_Down_Pin_2_Off        = 0,     /*!< Off : No pull selected                                                    */
  MDR_PORTA_PULL_Down_Pin_2_DOWN       = 1,     /*!< DOWN : Pin pulled down to GND                                             */
} MDR_PORTA_PULL_Down_Pin_2_Enum;

